{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Logs\event_study.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}29 Jun 2024, 11:09:23
{txt}
{com}. 
. 
. * Controls
. global controls year_grado
{txt}
{com}. global cohorts 1995 //2000 2005 2010 
{txt}
{com}. global treatment_groups treated_1a treated_1b treated_1c treated_1d ///
>                         treated_2a treated_2b treated_2c treated_2d
{txt}
{com}. * Outcomes
. global outcomes service_mental service_mental2 service_mental3 cardio_risk laboral                                              ///
>                                 pila_independientes p_cotizaciones pila_salario_r sal_dias_cot
{txt}
{com}. /*global outcomes service_mental service_mental2 service_mental3 diag_laboral estres_laboral                            ///
>                                 accidente_laboral enfermedad_laboral acc_enf_laboral laboral                                                    ///
>                                 pregnancy stroke infarct cardiovascular cardio_risk digestive                                                   ///
>                                 pila_independientes p_cotizaciones pila_salario_r pila_salario_r_max sal_dias_cot*/
. *global outcomes pila_salario_r service_mental          
.                                         
. ****************************************************************************
. **#                                             1. Merge data and set-up
. ****************************************************************************
. 
. * RIPS
. use "${c -(}data{c )-}\Individual_balanced_all_RIPS", clear
{txt}
{com}. rename year_RIPS fecha_pila
{res}{txt}
{com}. 
. * PILA
. merge 1:1 personabasicaid fecha_pila using "${c -(}data{c )-}\Individual_balanced_all_PILA"
{res}{txt}{p 0 7 2}
(variable
{bf:personabasicaid} was {bf:long}, now {bf:double} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:fecha_pila} was {bf:int}, now {bf:float} to accommodate using data's values)
{p_end}

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          96,046
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}          96,046{txt}  (_merge==2)

{col 5}Matched{col 30}{res}       1,344,644{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop if _merge == 2 // Estos son los del 2008
{txt}(96,046 observations deleted)

{com}. keep if inrange(posgrado_start, 2011, 2017) | mi(posgrado_start)
{txt}(58,534 observations deleted)

{com}. 
. * ReTHUS
. merge m:1 personabasicaid using "${c -(}data{c )-}\master_rethus.dta", keep(3) nogen 
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}       1,286,110{txt}  
{col 5}{hline 41}

{com}. drop if mi(fechapregrado)
{txt}(0 observations deleted)

{com}. gen year_grado = yofd(fechapregrado)
{txt}
{com}. 
. rename rethus_sexo rethus_sexo_temp
{res}{txt}
{com}. gen rethus_sexo = 0 
{txt}
{com}. replace rethus_sexo = 1 if rethus_sexo_temp == "MASCULINO"
{txt}(546,868 real changes made)

{com}. replace rethus_sexo = 2 if rethus_sexo_temp == "FEMENINO"
{txt}(739,046 real changes made)

{com}. drop rethus_sexo_temp
{txt}
{com}. drop if rethus_sexo == 0
{txt}(196 observations deleted)

{com}. 
. * Final outcomes
. gen service_mental3 = (service_mental == 1 & service_mental2 == 0)
{txt}
{com}. gen cardio_risk     = (stroke == 1 | infarct == 1 | cardiovascular == 1)
{txt}
{com}. gen laboral         = (diag_laboral == 1 | estres_laboral == 1 | ///
>                        accidente_laboral == 1 | enfermedad_laboral == 1 | ///
>                                            acc_enf_laboral == 1)
{txt}
{com}. 
. 
. ****************************************************************************
. **#                                             2. Estimation features
. ****************************************************************************
. 
. gen dist = fecha_pila - posgrado_start
{txt}(1,145,214 missing values generated)

{com}. *keep if (dist >= -2 & dist <= 5)
. 
. * Eventually treated dummy
. gen eventually_treated = (posgrado_start != .)
{txt}
{com}. 
. * Never treated condition
. replace posgrado_start = 0      if      posgrado_start == .
{txt}(1,145,214 real changes made)

{com}. 
. ****************************************************************************
. **#                                             3. CS never treated only
. ****************************************************************************                    
. local replace replace
{txt}
{com}. 
. preserve
{txt}
{com}. 
. timer on 1
{txt}
{com}. foreach treated in $treatment_groups {c -(}    
{txt}  2{com}.         
.         keep if `treated' + control > 0
{txt}  3{com}.         
.         foreach cohort in $cohorts {c -(}
{txt}  4{com}.                 
.                 keep if year_grado >= `cohort'
{txt}  5{com}.                 
.                 foreach outcome in $outcomes {c -(}
{txt}  6{com}.                                                 
.                         dis as err "Running event study for `outcome'"
{txt}  7{com}.                         
.                         * Without controls
.                         qui sum `outcome' if mi(dist)
{txt}  8{com}.                         local mean = r(mean)
{txt}  9{com}.                         
.                         qui sum `outcome' if fecha_pila == 2015
{txt} 10{com}.                         local obs  = r(N) 
{txt} 11{com}.                         
.                         csdid2          `outcome',                                      ///
>                                                 i(personabasicaid)                      /// panel id variable
>                                                 t(fecha_pila)                           /// Time variable
>                                                 gvar(posgrado_start)            /// Treatment time
>                                                 long2                                           /// Calculate results relative to -1
>                                                 asinr                                           /// Calculate pre-treatment results as in R
>                                                 method(drimp)                           /// Use doubly robust improved method
>                                                 cluster(personabasicaid)                                
{txt} 12{com}.                         estat event, post                                               // Aggregate estimation like an event-study
{txt} 13{com}.                         
.                         regsave using "${c -(}output{c )-}\Tables\CS_results", `replace' ci level(95) ///
>                                         addlabel(treatment_group, `treated', outcome, `outcome', mean, `mean', n, `obs', wboot, 0, estimation, NT, cohort, `cohort', controls, 0)
{txt} 14{com}.                         
.                         local replace append
{txt} 15{com}.                         
.                         estat event, wboot post                                 // SE using WildBootstrap
{txt} 16{com}.                         regsave using "${c -(}output{c )-}\Tables\CS_results", append ci rtable ///
>                                         addlabel(treatment_group, `treated', outcome, `outcome', mean, `mean', n, `obs', wboot, 1, estimation, NT, cohort, `cohort', controls, 0)
{txt} 17{com}.                                         
.                         * With controls
.                         qui sum `outcome' if mi(dist)
{txt} 18{com}.                         local mean = r(mean)
{txt} 19{com}.                         
.                         qui sum `outcome' if fecha_pila == 2015
{txt} 20{com}.                         local obs  = r(N) 
{txt} 21{com}.                         
.                         csdid2          `outcome' $controls ,           ///
>                                                 i(personabasicaid)                      /// panel id variable
>                                                 t(fecha_pila)                           /// Time variable
>                                                 gvar(posgrado_start)            /// Treatment time
>                                                 long2                                           /// Calculate results relative to -1
>                                                 asinr                                           /// Calculate pre-treatment results as in R
>                                                 method(drimp)                           /// Use doubly robust improved method
>                                                 cluster(personabasicaid)                                
{txt} 22{com}.                         estat event, post                                               // Aggregate estimation like an event-study
{txt} 23{com}.                         
.                         regsave using "${c -(}output{c )-}\Tables\CS_results", append ci level(95) ///
>                                         addlabel(treatment_group, `treated', outcome, `outcome', mean, `mean', n, `obs', wboot, 0, estimation, NT, cohort, `cohort', controls, 1)
{txt} 24{com}.                         
.                         estat event, wboot post                                 // SE using WildBootstrap
{txt} 25{com}.                         regsave using "${c -(}output{c )-}\Tables\CS_results", append ci rtable ///
>                                         addlabel(treatment_group, `treated', outcome, `outcome', mean, `mean', n, `obs', wboot, 1, estimation, NT, cohort, `cohort', controls, 1)
{txt} 26{com}.                 
.                 {c )-}
{txt} 27{com}.                 
.         {c )-}
{txt} 28{com}. 
.         cap restore
{txt} 29{com}. {c )-}
{txt}(0 observations deleted)
(0 observations deleted)
{err}Running event study for service_mental
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0010508{col 26}{space 2} .0014416{col 37}{space 1}    0.73{col 46}{space 3}0.466{col 54}{space 4}-.0017748{col 67}{space 3} .0038763
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} -.010421{col 26}{space 2}  .001244{col 37}{space 1}   -8.38{col 46}{space 3}0.000{col 54}{space 4}-.0128592{col 67}{space 3}-.0079827
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0016436{col 26}{space 2} .0034677{col 37}{space 1}   -0.47{col 46}{space 3}0.636{col 54}{space 4}-.0084402{col 67}{space 3} .0051529
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0008368{col 26}{space 2} .0024185{col 37}{space 1}    0.35{col 46}{space 3}0.729{col 54}{space 4}-.0039035{col 67}{space 3}  .005577
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0022982{col 26}{space 2} .0020801{col 37}{space 1}    1.10{col 46}{space 3}0.269{col 54}{space 4}-.0017786{col 67}{space 3} .0063751
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0022307{col 26}{space 2} .0017655{col 37}{space 1}    1.26{col 46}{space 3}0.206{col 54}{space 4}-.0012295{col 67}{space 3} .0056909
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0021766{col 26}{space 2} .0015731{col 37}{space 1}    1.38{col 46}{space 3}0.166{col 54}{space 4}-.0009065{col 67}{space 3} .0052598
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0014897{col 26}{space 2} .0014112{col 37}{space 1}    1.06{col 46}{space 3}0.291{col 54}{space 4}-.0012762{col 67}{space 3} .0042555
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2} -.000033{col 26}{space 2} .0012448{col 37}{space 1}   -0.03{col 46}{space 3}0.979{col 54}{space 4}-.0024728{col 67}{space 3} .0024067
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2} .0008255{col 26}{space 2} .0013225{col 37}{space 1}    0.62{col 46}{space 3}0.533{col 54}{space 4}-.0017667{col 67}{space 3} .0034176
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.0006843{col 26}{space 2} .0014575{col 37}{space 1}   -0.47{col 46}{space 3}0.639{col 54}{space 4} -.003541{col 67}{space 3} .0021724
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.0012934{col 26}{space 2} .0015775{col 37}{space 1}   -0.82{col 46}{space 3}0.412{col 54}{space 4}-.0043854{col 67}{space 3} .0017985
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0061978{col 26}{space 2} .0015664{col 37}{space 1}   -3.96{col 46}{space 3}0.000{col 54}{space 4}-.0092679{col 67}{space 3}-.0031277
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2} -.011172{col 26}{space 2} .0016169{col 37}{space 1}   -6.91{col 46}{space 3}0.000{col 54}{space 4}-.0143412{col 67}{space 3}-.0080029
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0140517{col 26}{space 2} .0016184{col 37}{space 1}   -8.68{col 46}{space 3}0.000{col 54}{space 4}-.0172236{col 67}{space 3}-.0108797
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}-.0125742{col 26}{space 2} .0018513{col 37}{space 1}   -6.79{col 46}{space 3}0.000{col 54}{space 4}-.0162027{col 67}{space 3}-.0089457
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}-.0143209{col 26}{space 2} .0020957{col 37}{space 1}   -6.83{col 46}{space 3}0.000{col 54}{space 4}-.0184283{col 67}{space 3}-.0102135
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0180404{col 26}{space 2} .0022632{col 37}{space 1}   -7.97{col 46}{space 3}0.000{col 54}{space 4}-.0224762{col 67}{space 3}-.0136046
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-.0188023{col 26}{space 2} .0026988{col 37}{space 1}   -6.97{col 46}{space 3}0.000{col 54}{space 4} -.024092{col 67}{space 3}-.0135127
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} -.014212{col 26}{space 2} .0036809{col 37}{space 1}   -3.86{col 46}{space 3}0.000{col 54}{space 4}-.0214265{col 67}{space 3}-.0069975
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2}-.0145283{col 26}{space 2} .0044801{col 37}{space 1}   -3.24{col 46}{space 3}0.001{col 54}{space 4}-.0233091{col 67}{space 3}-.0057475
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0010508{col 26}{space 1} .0014516{col 38}   0.72{col 46}{space 3}-.0029412{col 58}{space 3} .0050427
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} -.010421{col 26}{space 1}  .001232{col 38}  -8.46{col 46}{space 3}-.0138089{col 58}{space 3}-.0070331
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0016436{col 26}{space 1} .0033988{col 38}  -0.48{col 46}{space 3}-.0109905{col 58}{space 3} .0077033
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0008368{col 26}{space 1} .0025081{col 38}   0.33{col 46}{space 3}-.0060606{col 58}{space 3} .0077341
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0022982{col 26}{space 1} .0020371{col 38}   1.13{col 46}{space 3}-.0033038{col 58}{space 3} .0079002
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0022307{col 26}{space 1} .0018758{col 38}   1.19{col 46}{space 3}-.0029278{col 58}{space 3} .0073892
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0021766{col 26}{space 1} .0015285{col 38}   1.42{col 46}{space 3}-.0020267{col 58}{space 3}   .00638
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0014897{col 26}{space 1} .0014006{col 38}   1.06{col 46}{space 3} -.002362{col 58}{space 3} .0053414
{col 1}{text}        tm2{col 13}{c |}{result}{space 2} -.000033{col 26}{space 1} .0012565{col 38}  -0.03{col 46}{space 3}-.0034884{col 58}{space 3} .0034223
{col 1}{text}        tp0{col 13}{c |}{result}{space 2} .0008255{col 26}{space 1} .0013277{col 38}   0.62{col 46}{space 3}-.0028258{col 58}{space 3} .0044767
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.0006843{col 26}{space 1} .0015035{col 38}  -0.46{col 46}{space 3} -.004819{col 58}{space 3} .0034503
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.0012934{col 26}{space 1}  .001672{col 38}  -0.77{col 46}{space 3}-.0058913{col 58}{space 3} .0033045
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0061978{col 26}{space 1} .0015675{col 38}  -3.95{col 46}{space 3}-.0105083{col 58}{space 3}-.0018873
{col 1}{text}        tp4{col 13}{c |}{result}{space 2} -.011172{col 26}{space 1} .0016055{col 38}  -6.96{col 46}{space 3}-.0155871{col 58}{space 3} -.006757
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0140517{col 26}{space 1} .0016325{col 38}  -8.61{col 46}{space 3}-.0185412{col 58}{space 3}-.0095622
{col 1}{text}        tp6{col 13}{c |}{result}{space 2}-.0125742{col 26}{space 1} .0018803{col 38}  -6.69{col 46}{space 3} -.017745{col 58}{space 3}-.0074034
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}-.0143209{col 26}{space 1} .0021105{col 38}  -6.79{col 46}{space 3}-.0201249{col 58}{space 3} -.008517
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0180404{col 26}{space 1} .0022154{col 38}  -8.14{col 46}{space 3}-.0241327{col 58}{space 3} -.011948
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}-.0188023{col 26}{space 1} .0026631{col 38}  -7.06{col 46}{space 3}-.0261258{col 58}{space 3}-.0114788
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} -.014212{col 26}{space 1} .0036565{col 38}  -3.89{col 46}{space 3}-.0242676{col 58}{space 3}-.0041565
{col 1}{text}       tp11{col 13}{c |}{result}{space 2}-.0145283{col 26}{space 1} .0046429{col 38}  -3.13{col 46}{space 3}-.0272963{col 58}{space 3}-.0017602
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2}  .000694{col 26}{space 2} .0014459{col 37}{space 1}    0.48{col 46}{space 3}0.631{col 54}{space 4}-.0021398{col 67}{space 3} .0035278
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}-.0060244{col 26}{space 2} .0012656{col 37}{space 1}   -4.76{col 46}{space 3}0.000{col 54}{space 4} -.008505{col 67}{space 3}-.0035439
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0023692{col 26}{space 2} .0034712{col 37}{space 1}   -0.68{col 46}{space 3}0.495{col 54}{space 4}-.0091726{col 67}{space 3} .0044342
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0003597{col 26}{space 2} .0024241{col 37}{space 1}    0.15{col 46}{space 3}0.882{col 54}{space 4}-.0043915{col 67}{space 3} .0051109
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0019191{col 26}{space 2} .0020853{col 37}{space 1}    0.92{col 46}{space 3}0.357{col 54}{space 4}-.0021681{col 67}{space 3} .0060063
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0018802{col 26}{space 2} .0017715{col 37}{space 1}    1.06{col 46}{space 3}0.289{col 54}{space 4}-.0015919{col 67}{space 3} .0053524
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0019199{col 26}{space 2} .0015778{col 37}{space 1}    1.22{col 46}{space 3}0.224{col 54}{space 4}-.0011726{col 67}{space 3} .0050124
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0012862{col 26}{space 2} .0014144{col 37}{space 1}    0.91{col 46}{space 3}0.363{col 54}{space 4} -.001486{col 67}{space 3} .0040584
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0001378{col 26}{space 2} .0012461{col 37}{space 1}   -0.11{col 46}{space 3}0.912{col 54}{space 4}  -.00258{col 67}{space 3} .0023045
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2} .0011017{col 26}{space 2} .0013241{col 37}{space 1}    0.83{col 46}{space 3}0.405{col 54}{space 4}-.0014936{col 67}{space 3} .0036969
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.0000978{col 26}{space 2} .0014601{col 37}{space 1}   -0.07{col 46}{space 3}0.947{col 54}{space 4}-.0029596{col 67}{space 3}  .002764
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.0001872{col 26}{space 2}  .001582{col 37}{space 1}   -0.12{col 46}{space 3}0.906{col 54}{space 4} -.003288{col 67}{space 3} .0029135
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}  -.00445{col 26}{space 2} .0015716{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-.0075303{col 67}{space 3}-.0013697
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0086666{col 26}{space 2}  .001624{col 37}{space 1}   -5.34{col 46}{space 3}0.000{col 54}{space 4}-.0118497{col 67}{space 3}-.0054835
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0106382{col 26}{space 2} .0016269{col 37}{space 1}   -6.54{col 46}{space 3}0.000{col 54}{space 4}-.0138268{col 67}{space 3}-.0074496
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}-.0080544{col 26}{space 2} .0018647{col 37}{space 1}   -4.32{col 46}{space 3}0.000{col 54}{space 4}-.0117091{col 67}{space 3}-.0043996
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}-.0086589{col 26}{space 2} .0021145{col 37}{space 1}   -4.09{col 46}{space 3}0.000{col 54}{space 4}-.0128032{col 67}{space 3}-.0045145
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0107197{col 26}{space 2} .0022935{col 37}{space 1}   -4.67{col 46}{space 3}0.000{col 54}{space 4}-.0152149{col 67}{space 3}-.0062245
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-.0105791{col 26}{space 2} .0027368{col 37}{space 1}   -3.87{col 46}{space 3}0.000{col 54}{space 4}-.0159431{col 67}{space 3}-.0052152
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2}-.0051117{col 26}{space 2} .0037226{col 37}{space 1}   -1.37{col 46}{space 3}0.170{col 54}{space 4}-.0124078{col 67}{space 3} .0021844
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2}-.0062312{col 26}{space 2} .0045369{col 37}{space 1}   -1.37{col 46}{space 3}0.170{col 54}{space 4}-.0151234{col 67}{space 3}  .002661
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2}  .000694{col 26}{space 1} .0015315{col 38}   0.45{col 46}{space 3}-.0034969{col 58}{space 3} .0048849
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2}-.0060244{col 26}{space 1} .0012824{col 38}  -4.70{col 46}{space 3}-.0095336{col 58}{space 3}-.0025152
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0023692{col 26}{space 1} .0035583{col 38}  -0.67{col 46}{space 3}-.0121061{col 58}{space 3} .0073676
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0003597{col 26}{space 1} .0026834{col 38}   0.13{col 46}{space 3}-.0069831{col 58}{space 3} .0077025
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0019191{col 26}{space 1} .0022236{col 38}   0.86{col 46}{space 3}-.0041656{col 58}{space 3} .0080038
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0018802{col 26}{space 1} .0018037{col 38}   1.04{col 46}{space 3}-.0030555{col 58}{space 3}  .006816
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0019199{col 26}{space 1} .0015507{col 38}   1.24{col 46}{space 3}-.0023233{col 58}{space 3} .0061632
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0012862{col 26}{space 1} .0013713{col 38}   0.94{col 46}{space 3}-.0024662{col 58}{space 3} .0050387
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0001378{col 26}{space 1} .0011335{col 38}  -0.12{col 46}{space 3}-.0032395{col 58}{space 3} .0029639
{col 1}{text}        tp0{col 13}{c |}{result}{space 2} .0011017{col 26}{space 1}  .001384{col 38}   0.80{col 46}{space 3}-.0026855{col 58}{space 3} .0048888
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.0000978{col 26}{space 1}  .001436{col 38}  -0.07{col 46}{space 3}-.0040271{col 58}{space 3} .0038316
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.0001872{col 26}{space 1} .0015363{col 38}  -0.12{col 46}{space 3}-.0043912{col 58}{space 3} .0040167
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}  -.00445{col 26}{space 1} .0015057{col 38}  -2.96{col 46}{space 3}  -.00857{col 58}{space 3}-.0003299
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0086666{col 26}{space 1} .0016472{col 38}  -5.26{col 46}{space 3}-.0131741{col 58}{space 3}-.0041591
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0106382{col 26}{space 1} .0016194{col 38}  -6.57{col 46}{space 3}-.0150695{col 58}{space 3} -.006207
{col 1}{text}        tp6{col 13}{c |}{result}{space 2}-.0080544{col 26}{space 1} .0018898{col 38}  -4.26{col 46}{space 3}-.0132255{col 58}{space 3}-.0028832
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}-.0086589{col 26}{space 1}  .002055{col 38}  -4.21{col 46}{space 3}-.0142823{col 58}{space 3}-.0030355
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0107197{col 26}{space 1} .0023371{col 38}  -4.59{col 46}{space 3} -.017115{col 58}{space 3}-.0043244
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}-.0105791{col 26}{space 1} .0026755{col 38}  -3.95{col 46}{space 3}-.0179005{col 58}{space 3}-.0032578
{col 1}{text}       tp10{col 13}{c |}{result}{space 2}-.0051117{col 26}{space 1}  .003781{col 38}  -1.35{col 46}{space 3}-.0154579{col 58}{space 3} .0052345
{col 1}{text}       tp11{col 13}{c |}{result}{space 2}-.0062312{col 26}{space 1} .0046148{col 38}  -1.35{col 46}{space 3}-.0188592{col 58}{space 3} .0063968
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Tables\CS_results.dta{rm}
saved
{p_end}
{err}Running event study for service_mental2
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0008528{col 26}{space 2} .0013347{col 37}{space 1}    0.64{col 46}{space 3}0.523{col 54}{space 4}-.0017632{col 67}{space 3} .0034689
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} -.010846{col 26}{space 2} .0011512{col 37}{space 1}   -9.42{col 46}{space 3}0.000{col 54}{space 4}-.0131024{col 67}{space 3}-.0085896
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0013158{col 26}{space 2} .0031861{col 37}{space 1}   -0.41{col 46}{space 3}0.680{col 54}{space 4}-.0075603{col 67}{space 3} .0049288
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0006301{col 26}{space 2} .0022594{col 37}{space 1}    0.28{col 46}{space 3}0.780{col 54}{space 4}-.0037984{col 67}{space 3} .0050585
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0017696{col 26}{space 2} .0019455{col 37}{space 1}    0.91{col 46}{space 3}0.363{col 54}{space 4}-.0020435{col 67}{space 3} .0055826
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0012013{col 26}{space 2} .0016024{col 37}{space 1}    0.75{col 46}{space 3}0.453{col 54}{space 4}-.0019394{col 67}{space 3}  .004342
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0017195{col 26}{space 2} .0014617{col 37}{space 1}    1.18{col 46}{space 3}0.239{col 54}{space 4}-.0011455{col 67}{space 3} .0045844
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0015441{col 26}{space 2} .0013144{col 37}{space 1}    1.17{col 46}{space 3}0.240{col 54}{space 4} -.001032{col 67}{space 3} .0041203
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}  .000421{col 26}{space 2} .0011833{col 37}{space 1}    0.36{col 46}{space 3}0.722{col 54}{space 4}-.0018982{col 67}{space 3} .0027403
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0002844{col 26}{space 2} .0011965{col 37}{space 1}   -0.24{col 46}{space 3}0.812{col 54}{space 4}-.0026296{col 67}{space 3} .0020608
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.0012531{col 26}{space 2} .0013477{col 37}{space 1}   -0.93{col 46}{space 3}0.352{col 54}{space 4}-.0038944{col 67}{space 3} .0013883
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.0015189{col 26}{space 2} .0014801{col 37}{space 1}   -1.03{col 46}{space 3}0.305{col 54}{space 4}-.0044198{col 67}{space 3} .0013819
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0055475{col 26}{space 2} .0014811{col 37}{space 1}   -3.75{col 46}{space 3}0.000{col 54}{space 4}-.0084504{col 67}{space 3}-.0026445
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0108153{col 26}{space 2} .0015174{col 37}{space 1}   -7.13{col 46}{space 3}0.000{col 54}{space 4}-.0137894{col 67}{space 3}-.0078411
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2} -.013012{col 26}{space 2} .0015243{col 37}{space 1}   -8.54{col 46}{space 3}0.000{col 54}{space 4}-.0159995{col 67}{space 3}-.0100244
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} -.013573{col 26}{space 2}  .001694{col 37}{space 1}   -8.01{col 46}{space 3}0.000{col 54}{space 4}-.0168931{col 67}{space 3}-.0102528
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}-.0145677{col 26}{space 2} .0019401{col 37}{space 1}   -7.51{col 46}{space 3}0.000{col 54}{space 4}-.0183701{col 67}{space 3}-.0107652
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0168652{col 26}{space 2} .0020967{col 37}{space 1}   -8.04{col 46}{space 3}0.000{col 54}{space 4}-.0209747{col 67}{space 3}-.0127557
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-.0204168{col 26}{space 2} .0024238{col 37}{space 1}   -8.42{col 46}{space 3}0.000{col 54}{space 4}-.0251674{col 67}{space 3}-.0156661
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2}-.0151613{col 26}{space 2} .0033193{col 37}{space 1}   -4.57{col 46}{space 3}0.000{col 54}{space 4} -.021667{col 67}{space 3}-.0086557
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2}-.0171375{col 26}{space 2} .0038567{col 37}{space 1}   -4.44{col 46}{space 3}0.000{col 54}{space 4}-.0246964{col 67}{space 3}-.0095786
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0008528{col 26}{space 1} .0013145{col 38}   0.65{col 46}{space 3}-.0028803{col 58}{space 3} .0045859
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} -.010846{col 26}{space 1} .0010658{col 38} -10.18{col 46}{space 3}-.0138728{col 58}{space 3}-.0078193
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0013158{col 26}{space 1} .0030055{col 38}  -0.44{col 46}{space 3}-.0098515{col 58}{space 3} .0072199
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0006301{col 26}{space 1} .0023645{col 38}   0.27{col 46}{space 3}-.0060851{col 58}{space 3} .0073452
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0017696{col 26}{space 1} .0019081{col 38}   0.93{col 46}{space 3}-.0036495{col 58}{space 3} .0071886
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0012013{col 26}{space 1} .0016038{col 38}   0.75{col 46}{space 3}-.0033535{col 58}{space 3} .0057561
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0017195{col 26}{space 1} .0014315{col 38}   1.20{col 46}{space 3}-.0023458{col 58}{space 3} .0057848
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0015441{col 26}{space 1} .0012781{col 38}   1.21{col 46}{space 3}-.0020856{col 58}{space 3} .0051739
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}  .000421{col 26}{space 1} .0011542{col 38}   0.36{col 46}{space 3}-.0028569{col 58}{space 3}  .003699
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0002844{col 26}{space 1} .0011958{col 38}  -0.24{col 46}{space 3}-.0036805{col 58}{space 3} .0031117
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.0012531{col 26}{space 1} .0014244{col 38}  -0.88{col 46}{space 3}-.0052983{col 58}{space 3} .0027921
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.0015189{col 26}{space 1} .0014724{col 38}  -1.03{col 46}{space 3}-.0057004{col 58}{space 3} .0026626
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0055475{col 26}{space 1} .0014523{col 38}  -3.82{col 46}{space 3}-.0096719{col 58}{space 3} -.001423
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0108153{col 26}{space 1} .0015164{col 38}  -7.13{col 46}{space 3}-.0151217{col 58}{space 3}-.0065088
{col 1}{text}        tp5{col 13}{c |}{result}{space 2} -.013012{col 26}{space 1} .0014572{col 38}  -8.93{col 46}{space 3}-.0171504{col 58}{space 3}-.0088736
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} -.013573{col 26}{space 1} .0016094{col 38}  -8.43{col 46}{space 3}-.0181437{col 58}{space 3}-.0090022
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}-.0145677{col 26}{space 1} .0019559{col 38}  -7.45{col 46}{space 3}-.0201222{col 58}{space 3}-.0090131
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0168652{col 26}{space 1} .0021296{col 38}  -7.92{col 46}{space 3}-.0229131{col 58}{space 3}-.0108173
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}-.0204168{col 26}{space 1} .0024608{col 38}  -8.30{col 46}{space 3}-.0274053{col 58}{space 3}-.0134282
{col 1}{text}       tp10{col 13}{c |}{result}{space 2}-.0151613{col 26}{space 1} .0034452{col 38}  -4.40{col 46}{space 3}-.0249455{col 58}{space 3}-.0053772
{col 1}{text}       tp11{col 13}{c |}{result}{space 2}-.0171375{col 26}{space 1} .0039264{col 38}  -4.36{col 46}{space 3}-.0282883{col 58}{space 3}-.0059867
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0006113{col 26}{space 2} .0013389{col 37}{space 1}    0.46{col 46}{space 3}0.648{col 54}{space 4} -.002013{col 67}{space 3} .0032356
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}-.0068173{col 26}{space 2} .0011717{col 37}{space 1}   -5.82{col 46}{space 3}0.000{col 54}{space 4}-.0091139{col 67}{space 3}-.0045208
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0018824{col 26}{space 2} .0031894{col 37}{space 1}   -0.59{col 46}{space 3}0.555{col 54}{space 4}-.0081336{col 67}{space 3} .0043687
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0002977{col 26}{space 2} .0022648{col 37}{space 1}    0.13{col 46}{space 3}0.895{col 54}{space 4}-.0041412{col 67}{space 3} .0047366
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0015339{col 26}{space 2} .0019509{col 37}{space 1}    0.79{col 46}{space 3}0.432{col 54}{space 4}-.0022898{col 67}{space 3} .0053576
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0009946{col 26}{space 2} .0016087{col 37}{space 1}    0.62{col 46}{space 3}0.536{col 54}{space 4}-.0021583{col 67}{space 3} .0041475
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0015733{col 26}{space 2} .0014665{col 37}{space 1}    1.07{col 46}{space 3}0.283{col 54}{space 4}-.0013009{col 67}{space 3} .0044476
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0014024{col 26}{space 2} .0013175{col 37}{space 1}    1.06{col 46}{space 3}0.287{col 54}{space 4}-.0011799{col 67}{space 3} .0039847
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2} .0003595{col 26}{space 2} .0011845{col 37}{space 1}    0.30{col 46}{space 3}0.762{col 54}{space 4}-.0019621{col 67}{space 3}  .002681
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0000556{col 26}{space 2} .0011981{col 37}{space 1}   -0.05{col 46}{space 3}0.963{col 54}{space 4}-.0024039{col 67}{space 3} .0022926
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.0007984{col 26}{space 2} .0013502{col 37}{space 1}   -0.59{col 46}{space 3}0.554{col 54}{space 4}-.0034447{col 67}{space 3} .0018479
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.0005955{col 26}{space 2} .0014844{col 37}{space 1}   -0.40{col 46}{space 3}0.688{col 54}{space 4}-.0035049{col 67}{space 3} .0023139
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0040261{col 26}{space 2}  .001486{col 37}{space 1}   -2.71{col 46}{space 3}0.007{col 54}{space 4}-.0069385{col 67}{space 3}-.0011136
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0085875{col 26}{space 2} .0015244{col 37}{space 1}   -5.63{col 46}{space 3}0.000{col 54}{space 4}-.0115754{col 67}{space 3}-.0055997
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0099243{col 26}{space 2} .0015327{col 37}{space 1}   -6.47{col 46}{space 3}0.000{col 54}{space 4}-.0129284{col 67}{space 3}-.0069202
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}-.0094186{col 26}{space 2} .0017073{col 37}{space 1}   -5.52{col 46}{space 3}0.000{col 54}{space 4}-.0127649{col 67}{space 3}-.0060722
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}-.0093392{col 26}{space 2} .0019586{col 37}{space 1}   -4.77{col 46}{space 3}0.000{col 54}{space 4} -.013178{col 67}{space 3}-.0055004
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0099549{col 26}{space 2} .0021249{col 37}{space 1}   -4.68{col 46}{space 3}0.000{col 54}{space 4}-.0141197{col 67}{space 3}-.0057901
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-.0128474{col 26}{space 2}  .002461{col 37}{space 1}   -5.22{col 46}{space 3}0.000{col 54}{space 4}-.0176708{col 67}{space 3} -.008024
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2}-.0068217{col 26}{space 2} .0033594{col 37}{space 1}   -2.03{col 46}{space 3}0.042{col 54}{space 4}-.0134061{col 67}{space 3}-.0002373
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} -.009439{col 26}{space 2} .0039141{col 37}{space 1}   -2.41{col 46}{space 3}0.016{col 54}{space 4}-.0171104{col 67}{space 3}-.0017676
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0006113{col 26}{space 1} .0013992{col 38}   0.44{col 46}{space 3}-.0031687{col 58}{space 3} .0043913
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2}-.0068173{col 26}{space 1} .0010953{col 38}  -6.22{col 46}{space 3}-.0097764{col 58}{space 3}-.0038583
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0018824{col 26}{space 1} .0031289{col 38}  -0.60{col 46}{space 3}-.0103351{col 58}{space 3} .0065702
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0002977{col 26}{space 1} .0023604{col 38}   0.13{col 46}{space 3}-.0060789{col 58}{space 3} .0066743
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0015339{col 26}{space 1} .0021337{col 38}   0.72{col 46}{space 3}-.0042303{col 58}{space 3} .0072981
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0009946{col 26}{space 1} .0016355{col 38}   0.61{col 46}{space 3}-.0034238{col 58}{space 3}  .005413
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0015733{col 26}{space 1} .0015303{col 38}   1.03{col 46}{space 3}-.0025607{col 58}{space 3} .0057073
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0014024{col 26}{space 1} .0014215{col 38}   0.99{col 46}{space 3}-.0024378{col 58}{space 3} .0052426
{col 1}{text}        tm2{col 13}{c |}{result}{space 2} .0003595{col 26}{space 1} .0011884{col 38}   0.30{col 46}{space 3}-.0028511{col 58}{space 3}   .00357
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0000556{col 26}{space 1} .0011588{col 38}  -0.05{col 46}{space 3}-.0031862{col 58}{space 3} .0030749
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.0007984{col 26}{space 1} .0013913{col 38}  -0.57{col 46}{space 3} -.004557{col 58}{space 3} .0029601
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.0005955{col 26}{space 1} .0014387{col 38}  -0.41{col 46}{space 3}-.0044821{col 58}{space 3} .0032912
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0040261{col 26}{space 1} .0015238{col 38}  -2.64{col 46}{space 3}-.0081427{col 58}{space 3} .0000906
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0085875{col 26}{space 1} .0015172{col 38}  -5.66{col 46}{space 3}-.0126863{col 58}{space 3}-.0044887
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0099243{col 26}{space 1} .0015163{col 38}  -6.55{col 46}{space 3}-.0140205{col 58}{space 3}-.0058281
{col 1}{text}        tp6{col 13}{c |}{result}{space 2}-.0094186{col 26}{space 1} .0016919{col 38}  -5.57{col 46}{space 3}-.0139893{col 58}{space 3}-.0048478
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}-.0093392{col 26}{space 1} .0018822{col 38}  -4.96{col 46}{space 3} -.014424{col 58}{space 3}-.0042544
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0099549{col 26}{space 1} .0021591{col 38}  -4.61{col 46}{space 3}-.0157877{col 58}{space 3}-.0041222
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}-.0128474{col 26}{space 1} .0025702{col 38}  -5.00{col 46}{space 3}-.0197909{col 58}{space 3}-.0059039
{col 1}{text}       tp10{col 13}{c |}{result}{space 2}-.0068217{col 26}{space 1} .0031731{col 38}  -2.15{col 46}{space 3} -.015394{col 58}{space 3} .0017506
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} -.009439{col 26}{space 1} .0036448{col 38}  -2.59{col 46}{space 3}-.0192853{col 58}{space 3} .0004074
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Tables\CS_results.dta{rm}
saved
{p_end}
{err}Running event study for service_mental3
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0003049{col 26}{space 2} .0005461{col 37}{space 1}    0.56{col 46}{space 3}0.577{col 54}{space 4}-.0007655{col 67}{space 3} .0013752
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} .0003188{col 26}{space 2} .0004859{col 37}{space 1}    0.66{col 46}{space 3}0.512{col 54}{space 4}-.0006335{col 67}{space 3} .0012711
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0001811{col 26}{space 2} .0013727{col 37}{space 1}   -0.13{col 46}{space 3}0.895{col 54}{space 4}-.0028716{col 67}{space 3} .0025093
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0003354{col 26}{space 2} .0009779{col 37}{space 1}    0.34{col 46}{space 3}0.732{col 54}{space 4}-.0015813{col 67}{space 3} .0022521
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0006429{col 26}{space 2} .0007362{col 37}{space 1}    0.87{col 46}{space 3}0.383{col 54}{space 4}-.0008001{col 67}{space 3} .0020859
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0012771{col 26}{space 2} .0008271{col 37}{space 1}    1.54{col 46}{space 3}0.123{col 54}{space 4} -.000344{col 67}{space 3} .0028981
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0003918{col 26}{space 2} .0006252{col 37}{space 1}    0.63{col 46}{space 3}0.531{col 54}{space 4}-.0008336{col 67}{space 3} .0016172
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0001011{col 26}{space 2} .0005506{col 37}{space 1}    0.18{col 46}{space 3}0.854{col 54}{space 4} -.000978{col 67}{space 3} .0011803
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0004331{col 26}{space 2} .0004346{col 37}{space 1}   -1.00{col 46}{space 3}0.319{col 54}{space 4}-.0012848{col 67}{space 3} .0004187
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2} .0009453{col 26}{space 2} .0005893{col 37}{space 1}    1.60{col 46}{space 3}0.109{col 54}{space 4}-.0002098{col 67}{space 3} .0021004
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2} .0004386{col 26}{space 2} .0005903{col 37}{space 1}    0.74{col 46}{space 3}0.457{col 54}{space 4}-.0007183{col 67}{space 3} .0015956
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}  .000217{col 26}{space 2} .0005833{col 37}{space 1}    0.37{col 46}{space 3}0.710{col 54}{space 4}-.0009262{col 67}{space 3} .0013602
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0007247{col 26}{space 2} .0005848{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-.0018709{col 67}{space 3} .0004215
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0004954{col 26}{space 2} .0006431{col 37}{space 1}   -0.77{col 46}{space 3}0.441{col 54}{space 4}-.0017558{col 67}{space 3}  .000765
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0010993{col 26}{space 2}  .000621{col 37}{space 1}   -1.77{col 46}{space 3}0.077{col 54}{space 4}-.0023165{col 67}{space 3} .0001179
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} .0007015{col 26}{space 2} .0008139{col 37}{space 1}    0.86{col 46}{space 3}0.389{col 54}{space 4}-.0008937{col 67}{space 3} .0022967
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2} .0001079{col 26}{space 2} .0008711{col 37}{space 1}    0.12{col 46}{space 3}0.901{col 54}{space 4}-.0015995{col 67}{space 3} .0018152
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0008707{col 26}{space 2}  .000973{col 37}{space 1}   -0.89{col 46}{space 3}0.371{col 54}{space 4}-.0027778{col 67}{space 3} .0010363
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2} .0014288{col 26}{space 2} .0013182{col 37}{space 1}    1.08{col 46}{space 3}0.278{col 54}{space 4}-.0011548{col 67}{space 3} .0040123
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} .0009096{col 26}{space 2} .0016547{col 37}{space 1}    0.55{col 46}{space 3}0.583{col 54}{space 4}-.0023336{col 67}{space 3} .0041527
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} .0022669{col 26}{space 2} .0022943{col 37}{space 1}    0.99{col 46}{space 3}0.323{col 54}{space 4}-.0022298{col 67}{space 3} .0067637
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0003049{col 26}{space 1} .0005649{col 38}   0.54{col 46}{space 3}-.0013044{col 58}{space 3} .0019141
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} .0003188{col 26}{space 1} .0004889{col 38}   0.65{col 46}{space 3}-.0010739{col 58}{space 3} .0017115
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0001811{col 26}{space 1} .0012511{col 38}  -0.14{col 46}{space 3} -.003745{col 58}{space 3} .0033827
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0003354{col 26}{space 1} .0010729{col 38}   0.31{col 46}{space 3}-.0027207{col 58}{space 3} .0033916
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0006429{col 26}{space 1} .0007394{col 38}   0.87{col 46}{space 3}-.0014634{col 58}{space 3} .0027492
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0012771{col 26}{space 1} .0008297{col 38}   1.54{col 46}{space 3}-.0010862{col 58}{space 3} .0036404
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0003918{col 26}{space 1} .0005717{col 38}   0.69{col 46}{space 3}-.0012367{col 58}{space 3} .0020203
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0001011{col 26}{space 1} .0005567{col 38}   0.18{col 46}{space 3}-.0014845{col 58}{space 3} .0016868
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0004331{col 26}{space 1}  .000472{col 38}  -0.92{col 46}{space 3}-.0017775{col 58}{space 3} .0009114
{col 1}{text}        tp0{col 13}{c |}{result}{space 2} .0009453{col 26}{space 1} .0006336{col 38}   1.49{col 46}{space 3}-.0008595{col 58}{space 3} .0027501
{col 1}{text}        tp1{col 13}{c |}{result}{space 2} .0004386{col 26}{space 1} .0005257{col 38}   0.83{col 46}{space 3}-.0010588{col 58}{space 3} .0019361
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}  .000217{col 26}{space 1} .0006091{col 38}   0.36{col 46}{space 3}-.0015181{col 58}{space 3} .0019521
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0007247{col 26}{space 1} .0005936{col 38}  -1.22{col 46}{space 3}-.0024157{col 58}{space 3} .0009663
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0004954{col 26}{space 1} .0006358{col 38}  -0.78{col 46}{space 3}-.0023066{col 58}{space 3} .0013159
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0010993{col 26}{space 1}  .000607{col 38}  -1.81{col 46}{space 3}-.0028285{col 58}{space 3} .0006299
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} .0007015{col 26}{space 1} .0007737{col 38}   0.91{col 46}{space 3}-.0015024{col 58}{space 3} .0029054
{col 1}{text}        tp7{col 13}{c |}{result}{space 2} .0001079{col 26}{space 1} .0009144{col 38}   0.12{col 46}{space 3}-.0024968{col 58}{space 3} .0027126
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0008707{col 26}{space 1} .0009838{col 38}  -0.89{col 46}{space 3}-.0036731{col 58}{space 3} .0019316
{col 1}{text}        tp9{col 13}{c |}{result}{space 2} .0014288{col 26}{space 1} .0013383{col 38}   1.07{col 46}{space 3}-.0023835{col 58}{space 3}  .005241
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} .0009096{col 26}{space 1}  .001446{col 38}   0.63{col 46}{space 3}-.0032093{col 58}{space 3} .0050285
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} .0022669{col 26}{space 1} .0024847{col 38}   0.91{col 46}{space 3}-.0048108{col 58}{space 3} .0093447
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0001839{col 26}{space 2} .0005478{col 37}{space 1}    0.34{col 46}{space 3}0.737{col 54}{space 4}-.0008898{col 67}{space 3} .0012576
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} .0007242{col 26}{space 2} .0004936{col 37}{space 1}    1.47{col 46}{space 3}0.142{col 54}{space 4}-.0002432{col 67}{space 3} .0016915
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0003483{col 26}{space 2} .0013744{col 37}{space 1}   -0.25{col 46}{space 3}0.800{col 54}{space 4}-.0030422{col 67}{space 3} .0023455
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0001839{col 26}{space 2} .0009799{col 37}{space 1}    0.19{col 46}{space 3}0.851{col 54}{space 4}-.0017367{col 67}{space 3} .0021045
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0004907{col 26}{space 2} .0007379{col 37}{space 1}    0.66{col 46}{space 3}0.506{col 54}{space 4}-.0009556{col 67}{space 3} .0019371
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0011259{col 26}{space 2} .0008288{col 37}{space 1}    1.36{col 46}{space 3}0.174{col 54}{space 4}-.0004984{col 67}{space 3} .0027503
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0002783{col 26}{space 2} .0006269{col 37}{space 1}    0.44{col 46}{space 3}0.657{col 54}{space 4}-.0009505{col 67}{space 3}  .001507
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0000368{col 26}{space 2} .0005518{col 37}{space 1}    0.07{col 46}{space 3}0.947{col 54}{space 4}-.0010447{col 67}{space 3} .0011184
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}  -.00048{col 26}{space 2} .0004354{col 37}{space 1}   -1.10{col 46}{space 3}0.270{col 54}{space 4}-.0013332{col 67}{space 3} .0003733
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2} .0009954{col 26}{space 2} .0005898{col 37}{space 1}    1.69{col 46}{space 3}0.091{col 54}{space 4}-.0001606{col 67}{space 3} .0021514
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2} .0005698{col 26}{space 2} .0005912{col 37}{space 1}    0.96{col 46}{space 3}0.335{col 54}{space 4} -.000589{col 67}{space 3} .0017285
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2} .0004121{col 26}{space 2}  .000585{col 37}{space 1}    0.70{col 46}{space 3}0.481{col 54}{space 4}-.0007345{col 67}{space 3} .0015587
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0004696{col 26}{space 2} .0005868{col 37}{space 1}   -0.80{col 46}{space 3}0.424{col 54}{space 4}-.0016197{col 67}{space 3} .0006806
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0001906{col 26}{space 2} .0006455{col 37}{space 1}   -0.30{col 46}{space 3}0.768{col 54}{space 4}-.0014556{col 67}{space 3} .0010745
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0007412{col 26}{space 2} .0006242{col 37}{space 1}   -1.19{col 46}{space 3}0.235{col 54}{space 4}-.0019645{col 67}{space 3} .0004822
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} .0011218{col 26}{space 2} .0008182{col 37}{space 1}    1.37{col 46}{space 3}0.170{col 54}{space 4}-.0004819{col 67}{space 3} .0027255
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2} .0006008{col 26}{space 2} .0008774{col 37}{space 1}    0.68{col 46}{space 3}0.494{col 54}{space 4}-.0011189{col 67}{space 3} .0023205
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0003516{col 26}{space 2}  .000984{col 37}{space 1}   -0.36{col 46}{space 3}0.721{col 54}{space 4}-.0022801{col 67}{space 3} .0015769
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2} .0021581{col 26}{space 2} .0013293{col 37}{space 1}    1.62{col 46}{space 3}0.104{col 54}{space 4}-.0004472{col 67}{space 3} .0047634
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} .0016707{col 26}{space 2} .0016678{col 37}{space 1}    1.00{col 46}{space 3}0.316{col 54}{space 4}-.0015981{col 67}{space 3} .0049395
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} .0029144{col 26}{space 2} .0023117{col 37}{space 1}    1.26{col 46}{space 3}0.207{col 54}{space 4}-.0016165{col 67}{space 3} .0074453
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0001839{col 26}{space 1} .0005973{col 38}   0.31{col 46}{space 3}-.0014541{col 58}{space 3} .0018219
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} .0007242{col 26}{space 1} .0005094{col 38}   1.42{col 46}{space 3}-.0006728{col 58}{space 3} .0021212
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0003483{col 26}{space 1} .0013338{col 38}  -0.26{col 46}{space 3}-.0040061{col 58}{space 3} .0033095
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0001839{col 26}{space 1} .0009874{col 38}   0.19{col 46}{space 3} -.002524{col 58}{space 3} .0028917
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0004907{col 26}{space 1}  .000705{col 38}   0.70{col 46}{space 3}-.0014427{col 58}{space 3} .0024242
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0011259{col 26}{space 1} .0008227{col 38}   1.37{col 46}{space 3}-.0011301{col 58}{space 3}  .003382
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0002783{col 26}{space 1} .0006476{col 38}   0.43{col 46}{space 3}-.0014977{col 58}{space 3} .0020542
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0000368{col 26}{space 1} .0005741{col 38}   0.06{col 46}{space 3}-.0015375{col 58}{space 3} .0016111
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}  -.00048{col 26}{space 1} .0004665{col 38}  -1.03{col 46}{space 3}-.0017592{col 58}{space 3} .0007992
{col 1}{text}        tp0{col 13}{c |}{result}{space 2} .0009954{col 26}{space 1} .0006271{col 38}   1.59{col 46}{space 3}-.0007242{col 58}{space 3} .0027151
{col 1}{text}        tp1{col 13}{c |}{result}{space 2} .0005698{col 26}{space 1} .0005506{col 38}   1.03{col 46}{space 3}-.0009401{col 58}{space 3} .0020796
{col 1}{text}        tp2{col 13}{c |}{result}{space 2} .0004121{col 26}{space 1} .0006223{col 38}   0.66{col 46}{space 3}-.0012946{col 58}{space 3} .0021187
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0004696{col 26}{space 1} .0005943{col 38}  -0.79{col 46}{space 3}-.0020994{col 58}{space 3} .0011603
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0001906{col 26}{space 1} .0006321{col 38}  -0.30{col 46}{space 3} -.001924{col 58}{space 3} .0015429
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0007412{col 26}{space 1} .0006166{col 38}  -1.20{col 46}{space 3} -.002432{col 58}{space 3} .0009497
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} .0011218{col 26}{space 1} .0007972{col 38}   1.41{col 46}{space 3}-.0010644{col 58}{space 3}  .003308
{col 1}{text}        tp7{col 13}{c |}{result}{space 2} .0006008{col 26}{space 1} .0009033{col 38}   0.67{col 46}{space 3}-.0018763{col 58}{space 3} .0030779
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0003516{col 26}{space 1} .0009453{col 38}  -0.37{col 46}{space 3} -.002944{col 58}{space 3} .0022409
{col 1}{text}        tp9{col 13}{c |}{result}{space 2} .0021581{col 26}{space 1}   .00132{col 38}   1.63{col 46}{space 3} -.001462{col 58}{space 3} .0057781
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} .0016707{col 26}{space 1} .0016601{col 38}   1.01{col 46}{space 3}-.0028821{col 58}{space 3} .0062235
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} .0029144{col 26}{space 1} .0025388{col 38}   1.15{col 46}{space 3}-.0040479{col 58}{space 3} .0098767
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Tables\CS_results.dta{rm}
saved
{p_end}
{err}Running event study for cardio_risk
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0006514{col 26}{space 2} .0004928{col 37}{space 1}    1.32{col 46}{space 3}0.186{col 54}{space 4}-.0003145{col 67}{space 3} .0016173
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}-.0011238{col 26}{space 2} .0005153{col 37}{space 1}   -2.18{col 46}{space 3}0.029{col 54}{space 4}-.0021337{col 67}{space 3}-.0001138
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2} .0009413{col 26}{space 2}  .001229{col 37}{space 1}    0.77{col 46}{space 3}0.444{col 54}{space 4}-.0014674{col 67}{space 3}   .00335
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0010655{col 26}{space 2} .0009235{col 37}{space 1}    1.15{col 46}{space 3}0.249{col 54}{space 4}-.0007446{col 67}{space 3} .0028756
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0012521{col 26}{space 2} .0007665{col 37}{space 1}    1.63{col 46}{space 3}0.102{col 54}{space 4}-.0002503{col 67}{space 3} .0027545
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0007352{col 26}{space 2} .0006446{col 37}{space 1}    1.14{col 46}{space 3}0.254{col 54}{space 4}-.0005281{col 67}{space 3} .0019985
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0006138{col 26}{space 2} .0005969{col 37}{space 1}    1.03{col 46}{space 3}0.304{col 54}{space 4}-.0005561{col 67}{space 3} .0017837
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0002326{col 26}{space 2} .0005739{col 37}{space 1}    0.41{col 46}{space 3}0.685{col 54}{space 4}-.0008923{col 67}{space 3} .0013575
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0002807{col 26}{space 2} .0004881{col 37}{space 1}   -0.57{col 46}{space 3}0.565{col 54}{space 4}-.0012374{col 67}{space 3} .0006761
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}  -.00096{col 26}{space 2} .0004783{col 37}{space 1}   -2.01{col 46}{space 3}0.045{col 54}{space 4}-.0018974{col 67}{space 3}-.0000226
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.0010272{col 26}{space 2} .0005098{col 37}{space 1}   -2.01{col 46}{space 3}0.044{col 54}{space 4}-.0020263{col 67}{space 3} -.000028
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.0008889{col 26}{space 2} .0005493{col 37}{space 1}   -1.62{col 46}{space 3}0.106{col 54}{space 4}-.0019655{col 67}{space 3} .0001877
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0007685{col 26}{space 2} .0006107{col 37}{space 1}   -1.26{col 46}{space 3}0.208{col 54}{space 4}-.0019654{col 67}{space 3} .0004284
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0011638{col 26}{space 2} .0006046{col 37}{space 1}   -1.92{col 46}{space 3}0.054{col 54}{space 4}-.0023488{col 67}{space 3} .0000212
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0013927{col 26}{space 2} .0005894{col 37}{space 1}   -2.36{col 46}{space 3}0.018{col 54}{space 4}-.0025479{col 67}{space 3}-.0002375
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}-.0005141{col 26}{space 2} .0007522{col 37}{space 1}   -0.68{col 46}{space 3}0.494{col 54}{space 4}-.0019883{col 67}{space 3}   .00096
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}-.0001373{col 26}{space 2} .0008838{col 37}{space 1}   -0.16{col 46}{space 3}0.877{col 54}{space 4}-.0018696{col 67}{space 3}  .001595
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2} -.002392{col 26}{space 2} .0008361{col 37}{space 1}   -2.86{col 46}{space 3}0.004{col 54}{space 4}-.0040308{col 67}{space 3}-.0007533
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-.0022969{col 26}{space 2} .0009892{col 37}{space 1}   -2.32{col 46}{space 3}0.020{col 54}{space 4}-.0042357{col 67}{space 3}-.0003581
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} -.002421{col 26}{space 2} .0012743{col 37}{space 1}   -1.90{col 46}{space 3}0.057{col 54}{space 4}-.0049186{col 67}{space 3} .0000767
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} .0004773{col 26}{space 2} .0017156{col 37}{space 1}    0.28{col 46}{space 3}0.781{col 54}{space 4}-.0028853{col 67}{space 3} .0038399
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 7 2}
(variable
{bf:outcome} was {bf:str11}, now {bf:str15} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0006514{col 26}{space 1} .0005423{col 38}   1.20{col 46}{space 3}-.0008113{col 58}{space 3} .0021141
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2}-.0011238{col 26}{space 1} .0005316{col 38}  -2.11{col 46}{space 3}-.0025576{col 58}{space 3} .0003101
{col 1}{text}        tm8{col 13}{c |}{result}{space 2} .0009413{col 26}{space 1}  .001737{col 38}   0.54{col 46}{space 3}-.0037441{col 58}{space 3} .0056267
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0010655{col 26}{space 1} .0010365{col 38}   1.03{col 46}{space 3}-.0017304{col 58}{space 3} .0038614
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0012521{col 26}{space 1} .0007613{col 38}   1.64{col 46}{space 3}-.0008015{col 58}{space 3} .0033057
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0007352{col 26}{space 1} .0006587{col 38}   1.12{col 46}{space 3}-.0010415{col 58}{space 3} .0025119
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0006138{col 26}{space 1} .0005421{col 38}   1.13{col 46}{space 3}-.0008484{col 58}{space 3}  .002076
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0002326{col 26}{space 1} .0005785{col 38}   0.40{col 46}{space 3}-.0013279{col 58}{space 3} .0017931
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0002807{col 26}{space 1} .0004987{col 38}  -0.56{col 46}{space 3}-.0016258{col 58}{space 3} .0010645
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}  -.00096{col 26}{space 1} .0005066{col 38}  -1.90{col 46}{space 3}-.0023265{col 58}{space 3} .0004064
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.0010272{col 26}{space 1} .0005595{col 38}  -1.84{col 46}{space 3}-.0025365{col 58}{space 3} .0004821
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.0008889{col 26}{space 1} .0005742{col 38}  -1.55{col 46}{space 3}-.0024378{col 58}{space 3}   .00066
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0007685{col 26}{space 1} .0005854{col 38}  -1.31{col 46}{space 3}-.0023477{col 58}{space 3} .0008107
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0011638{col 26}{space 1}  .000609{col 38}  -1.91{col 46}{space 3}-.0028066{col 58}{space 3} .0004791
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0013927{col 26}{space 1} .0006428{col 38}  -2.17{col 46}{space 3}-.0031267{col 58}{space 3} .0003413
{col 1}{text}        tp6{col 13}{c |}{result}{space 2}-.0005141{col 26}{space 1} .0007658{col 38}  -0.67{col 46}{space 3}-.0025798{col 58}{space 3} .0015515
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}-.0001373{col 26}{space 1} .0009136{col 38}  -0.15{col 46}{space 3}-.0026015{col 58}{space 3}  .002327
{col 1}{text}        tp8{col 13}{c |}{result}{space 2} -.002392{col 26}{space 1} .0008333{col 38}  -2.87{col 46}{space 3}-.0046399{col 58}{space 3}-.0001442
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}-.0022969{col 26}{space 1} .0009663{col 38}  -2.38{col 46}{space 3}-.0049034{col 58}{space 3} .0003096
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} -.002421{col 26}{space 1} .0013414{col 38}  -1.80{col 46}{space 3}-.0060393{col 58}{space 3} .0011974
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} .0004773{col 26}{space 1} .0015097{col 38}   0.32{col 46}{space 3} -.003595{col 58}{space 3} .0045497
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str11}, now {bf:str15} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0008005{col 26}{space 2} .0004978{col 37}{space 1}    1.61{col 46}{space 3}0.108{col 54}{space 4}-.0001753{col 67}{space 3} .0017762
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}-.0019316{col 26}{space 2} .0005412{col 37}{space 1}   -3.57{col 46}{space 3}0.000{col 54}{space 4}-.0029923{col 67}{space 3}-.0008709
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2} .0009986{col 26}{space 2}  .001234{col 37}{space 1}    0.81{col 46}{space 3}0.418{col 54}{space 4}-.0014199{col 67}{space 3} .0034171
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2}  .001261{col 26}{space 2} .0009296{col 37}{space 1}    1.36{col 46}{space 3}0.175{col 54}{space 4} -.000561{col 67}{space 3}  .003083
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0014537{col 26}{space 2}  .000772{col 37}{space 1}    1.88{col 46}{space 3}0.060{col 54}{space 4}-.0000595{col 67}{space 3} .0029669
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0009412{col 26}{space 2} .0006511{col 37}{space 1}    1.45{col 46}{space 3}0.148{col 54}{space 4} -.000335{col 67}{space 3} .0022173
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0008134{col 26}{space 2} .0006014{col 37}{space 1}    1.35{col 46}{space 3}0.176{col 54}{space 4}-.0003652{col 67}{space 3}  .001992
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0003596{col 26}{space 2} .0005766{col 37}{space 1}    0.62{col 46}{space 3}0.533{col 54}{space 4}-.0007705{col 67}{space 3} .0014897
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0002243{col 26}{space 2} .0004893{col 37}{space 1}   -0.46{col 46}{space 3}0.647{col 54}{space 4}-.0011833{col 67}{space 3} .0007347
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0010152{col 26}{space 2} .0004797{col 37}{space 1}   -2.12{col 46}{space 3}0.034{col 54}{space 4}-.0019553{col 67}{space 3}-.0000751
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.0012177{col 26}{space 2} .0005131{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4}-.0022233{col 67}{space 3} -.000212
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2} -.001152{col 26}{space 2} .0005548{col 37}{space 1}   -2.08{col 46}{space 3}0.038{col 54}{space 4}-.0022395{col 67}{space 3}-.0000646
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0011038{col 26}{space 2} .0006188{col 37}{space 1}   -1.78{col 46}{space 3}0.074{col 54}{space 4}-.0023167{col 67}{space 3} .0001091
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0016297{col 26}{space 2} .0006162{col 37}{space 1}   -2.64{col 46}{space 3}0.008{col 54}{space 4}-.0028375{col 67}{space 3}-.0004219
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0019006{col 26}{space 2} .0006049{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-.0030862{col 67}{space 3}-.0007149
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}-.0012655{col 26}{space 2} .0007728{col 37}{space 1}   -1.64{col 46}{space 3}0.102{col 54}{space 4}-.0027801{col 67}{space 3} .0002491
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}-.0012462{col 26}{space 2} .0009101{col 37}{space 1}   -1.37{col 46}{space 3}0.171{col 54}{space 4}-.0030299{col 67}{space 3} .0005374
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0038103{col 26}{space 2} .0008805{col 37}{space 1}   -4.33{col 46}{space 3}0.000{col 54}{space 4}-.0055361{col 67}{space 3}-.0020845
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-.0038995{col 26}{space 2} .0010389{col 37}{space 1}   -3.75{col 46}{space 3}0.000{col 54}{space 4}-.0059357{col 67}{space 3}-.0018632
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2}-.0042351{col 26}{space 2} .0013313{col 37}{space 1}   -3.18{col 46}{space 3}0.001{col 54}{space 4}-.0068444{col 67}{space 3}-.0016258
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2}-.0007034{col 26}{space 2}  .001776{col 37}{space 1}   -0.40{col 46}{space 3}0.692{col 54}{space 4}-.0041843{col 67}{space 3} .0027775
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 7 2}
(variable
{bf:outcome} was {bf:str11}, now {bf:str15} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}