{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Logs\event_study.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}28 Jun 2024, 14:16:36
{txt}
{com}. 
. * Outcomes and categories
. global specialities     all quirurgical clinical other none
{txt}
{com}. global genders          all female male
{txt}
{com}. 
. /*
> global outcomes         sal_dias_cot posgrado_salud pila_salario_r l_pila_salario_r                             ///
>                                         posgrado_rethus p_cotizaciones nro_cotizaciones                                                         ///
>                                         pila_independientes pila_dependientes formal                                                            ///
>                                         diag_mental diag_mental2 service_mental service_mental2                                         ///
>                                         urg hosp urg_np hosp_np pregnancy service cons_mental                                           ///
>                                         cons_mental2 cons_mental3 cons_mental4 consul proce
> */
.                                         
. ****************************************************************************
. **#                                             1. Merge data and set-up
. ****************************************************************************
. 
. * Panel
. use "${c -(}data{c )-}\Individual_balanced_all_RIPS", clear
{txt}
{com}. 
. rename year_RIPS fecha_pila
{res}{txt}
{com}. drop if mi(fechapregrado)
{txt}(0 observations deleted)

{com}. merge 1:1 personabasicaid fecha_pila using "${c -(}data{c )-}\Individual_balanced_all_PILA"
{res}{txt}{p 0 7 2}
(variable
{bf:personabasicaid} was {bf:long}, now {bf:double} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:fecha_pila} was {bf:int}, now {bf:float} to accommodate using data's values)
{p_end}

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          96,046
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}          96,046{txt}  (_merge==2)

{col 5}Matched{col 30}{res}       1,344,644{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. cap drop year_grado
{txt}
{com}. gen year_grado = yofd(fechapregrado)
{txt}(96,046 missing values generated)

{com}. 
. drop if _merge == 2 // Estos son los del 2008
{txt}(96,046 observations deleted)

{com}. 
. rename rethus_sexo rethus_sexo_temp
{res}{txt}
{com}. gen rethus_sexo = 0 
{txt}
{com}. replace rethus_sexo = 1 if rethus_sexo_temp == "MASCULINO"
{txt}(574,462 real changes made)

{com}. replace rethus_sexo = 2 if rethus_sexo_temp == "FEMENINO"
{txt}(769,986 real changes made)

{com}. drop rethus_sexo_temp
{txt}
{com}. drop if rethus_sexo == 0
{txt}(196 observations deleted)

{com}. 
. keep if inrange(posgrado_start, 2011, 2017) | mi(posgrado_start)
{txt}(58,520 observations deleted)

{com}. 
. * Final outcomes
. g service_mental3       = (service_mental == 1          & service_mental2 == 0                                                          )
{txt}
{com}. g cardio_risk           = (stroke == 1                          | infarct == 1                  | cardiovascular == 1           )
{txt}
{com}. g laboral                       = (diag_laboral == 1            | estres_laboral == 1   | accidente_laboral == 1        |       ///
>                                            enfermedad_laboral == 1      | acc_enf_laboral == 1                                                          )
{txt}
{com}. 
. 
. ****************************************************************************
. **#                                             2. Estimation features
. ****************************************************************************
. 
. * Balance
. gen dist = fecha_pila - posgrado_start
{txt}(1,145,270 missing values generated)

{com}. *keep if (dist >= -2 & dist <= 5)
. 
. * Eventually treated dummy
. g eventually_treated = (posgrado_start != .)
{txt}
{com}. 
. * Never treated condition
. replace posgrado_start = 0      if      posgrado_start == .
{txt}(1,145,270 real changes made)

{com}. 
. * Outcomes all
. /*
> global outcomes service_mental service_mental2 service_mental3 diag_laboral estres_laboral                              ///
>                                 accidente_laboral enfermedad_laboral acc_enf_laboral laboral                                                    ///
>                                 pregnancy stroke infarct cardiovascular cardio_risk digestive                                                   ///
>                                 pila_independientes p_cotizaciones pila_salario_r pila_salario_r_max sal_dias_cot
> */
. 
. * Outcomes simplified
. global outcomes service_mental service_mental2 service_mental3 cardio_risk laboral                                              ///
>                                 pila_independientes p_cotizaciones pila_salario_r sal_dias_cot
{txt}
{com}. 
. * Controls
. global controls year_grado
{txt}
{com}. 
. 
. ****************************************************************************
. **#                                             3. CS never treated only
. ****************************************************************************                    
.                                         
. foreach cohort in 1995 2000 2005 2010 {c -(}
{txt}  2{com}.         
.         preserve        
{txt}  3{com}.         keep if year_grado >= `cohort'
{txt}  4{com}.         
.         foreach outcome in $outcomes {c -(}
{txt}  5{com}.                                         
.                 dis as err "Running event study for `outcome'"
{txt}  6{com}.                 
.                 * Without controls
.                 qui sum `outcome' if mi(dist)
{txt}  7{com}.                 local mean = r(mean)
{txt}  8{com}.                 
.                 qui sum `outcome' if fecha_pila == 2015
{txt}  9{com}.                 local obs  = r(N) 
{txt} 10{com}.                 
.                 csdid2          `outcome',                                      ///
>                                         i(personabasicaid)                      /// panel id variable
>                                         t(fecha_pila)                           /// Time variable
>                                         gvar(posgrado_start)            /// Treatment time
>                                         long2                                           /// Calculate results relative to -1
>                                         asinr                                           /// Calculate pre-treatment results as in R
>                                         method(drimp)                           /// Use doubly robust improved method
>                                         cluster(personabasicaid)                                
{txt} 11{com}.                 estat event, post                                               // Aggregate estimation like an event-study
{txt} 12{com}.                 
.                 regsave using "${c -(}output{c )-}\Tables\CS_results", replace ci level(95) ///
>                                 addlabel(outcome, `outcome', mean, `mean', n, `obs', wboot, 0, estimation, NT, cohort, `cohort', controls, 0)
{txt} 13{com}.                 
.                 estat event, wboot post                                 // SE using WildBootstrap
{txt} 14{com}.                 regsave using "${c -(}output{c )-}\Tables\CS_results", append ci rtable ///
>                                 addlabel(outcome, `outcome', mean, `mean', n, `obs', wboot, 1, estimation, NT, cohort, `cohort', controls, 0)
{txt} 15{com}.                                 
.                 * With controls
.                 qui sum `outcome' if mi(dist)
{txt} 16{com}.                 local mean = r(mean)
{txt} 17{com}.                 
.                 qui sum `outcome' if fecha_pila == 2015
{txt} 18{com}.                 local obs  = r(N) 
{txt} 19{com}.                 
.                 csdid2          `outcome' $controls ,           ///
>                                         i(personabasicaid)                      /// panel id variable
>                                         t(fecha_pila)                           /// Time variable
>                                         gvar(posgrado_start)            /// Treatment time
>                                         long2                                           /// Calculate results relative to -1
>                                         asinr                                           /// Calculate pre-treatment results as in R
>                                         method(drimp)                           /// Use doubly robust improved method
>                                         cluster(personabasicaid)                                
{txt} 20{com}.                 estat event, post                                               // Aggregate estimation like an event-study
{txt} 21{com}.                 
.                 regsave using "${c -(}output{c )-}\Tables\CS_results", append ci level(95) ///
>                                 addlabel(outcome, `outcome', mean, `mean', n, `obs', wboot, 0, estimation, NT, cohort, `cohort', controls, 1)
{txt} 22{com}.                 
.                 estat event, wboot post                                 // SE using WildBootstrap
{txt} 23{com}.                 regsave using "${c -(}output{c )-}\Tables\CS_results", append ci rtable ///
>                                 addlabel(outcome, `outcome', mean, `mean', n, `obs', wboot, 1, estimation, NT, cohort, `cohort', controls, 1)
{txt} 24{com}.         
.         {c )-}
{txt} 25{com}.         
.         restore
{txt} 26{com}.         
. {c )-}
{txt}(0 observations deleted)
{err}Running event study for service_mental
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0010503{col 26}{space 2} .0014418{col 37}{space 1}    0.73{col 46}{space 3}0.466{col 54}{space 4}-.0017755{col 67}{space 3} .0038762
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}-.0104046{col 26}{space 2} .0012447{col 37}{space 1}   -8.36{col 46}{space 3}0.000{col 54}{space 4}-.0128441{col 67}{space 3} -.007965
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2} -.001644{col 26}{space 2} .0034677{col 37}{space 1}   -0.47{col 46}{space 3}0.635{col 54}{space 4}-.0084405{col 67}{space 3} .0051526
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0008364{col 26}{space 2} .0024185{col 37}{space 1}    0.35{col 46}{space 3}0.729{col 54}{space 4}-.0039039{col 67}{space 3} .0055766
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0022968{col 26}{space 2} .0020805{col 37}{space 1}    1.10{col 46}{space 3}0.270{col 54}{space 4}-.0017809{col 67}{space 3} .0063744
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0022302{col 26}{space 2} .0017657{col 37}{space 1}    1.26{col 46}{space 3}0.207{col 54}{space 4}-.0012306{col 67}{space 3}  .005691
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0021765{col 26}{space 2} .0015733{col 37}{space 1}    1.38{col 46}{space 3}0.167{col 54}{space 4} -.000907{col 67}{space 3}   .00526
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0014898{col 26}{space 2} .0014113{col 37}{space 1}    1.06{col 46}{space 3}0.291{col 54}{space 4}-.0012764{col 67}{space 3} .0042559
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0000332{col 26}{space 2} .0012452{col 37}{space 1}   -0.03{col 46}{space 3}0.979{col 54}{space 4}-.0024737{col 67}{space 3} .0024073
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2} .0008261{col 26}{space 2} .0013229{col 37}{space 1}    0.62{col 46}{space 3}0.532{col 54}{space 4}-.0017668{col 67}{space 3}  .003419
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.0006779{col 26}{space 2}  .001458{col 37}{space 1}   -0.46{col 46}{space 3}0.642{col 54}{space 4}-.0035355{col 67}{space 3} .0021796
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.0012845{col 26}{space 2}  .001578{col 37}{space 1}   -0.81{col 46}{space 3}0.416{col 54}{space 4}-.0043774{col 67}{space 3} .0018083
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0061861{col 26}{space 2} .0015668{col 37}{space 1}   -3.95{col 46}{space 3}0.000{col 54}{space 4}-.0092571{col 67}{space 3}-.0031152
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0111595{col 26}{space 2} .0016174{col 37}{space 1}   -6.90{col 46}{space 3}0.000{col 54}{space 4}-.0143296{col 67}{space 3}-.0079895
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0140377{col 26}{space 2} .0016188{col 37}{space 1}   -8.67{col 46}{space 3}0.000{col 54}{space 4}-.0172105{col 67}{space 3}-.0108649
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} -.012557{col 26}{space 2} .0018519{col 37}{space 1}   -6.78{col 46}{space 3}0.000{col 54}{space 4}-.0161867{col 67}{space 3}-.0089273
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}-.0143008{col 26}{space 2} .0020965{col 37}{space 1}   -6.82{col 46}{space 3}0.000{col 54}{space 4}-.0184098{col 67}{space 3}-.0101918
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0180228{col 26}{space 2}  .002264{col 37}{space 1}   -7.96{col 46}{space 3}0.000{col 54}{space 4}-.0224601{col 67}{space 3}-.0135855
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-.0187802{col 26}{space 2} .0027001{col 37}{space 1}   -6.96{col 46}{space 3}0.000{col 54}{space 4}-.0240723{col 67}{space 3}-.0134881
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2}-.0141779{col 26}{space 2} .0036838{col 37}{space 1}   -3.85{col 46}{space 3}0.000{col 54}{space 4}-.0213979{col 67}{space 3}-.0069579
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2}-.0144961{col 26}{space 2} .0044867{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-.0232899{col 67}{space 3}-.0057023
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0010503{col 26}{space 1} .0014273{col 38}   0.74{col 46}{space 3} -.002968{col 58}{space 3} .0050687
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2}-.0104046{col 26}{space 1} .0011941{col 38}  -8.71{col 46}{space 3}-.0137662{col 58}{space 3}-.0070429
{col 1}{text}        tm8{col 13}{c |}{result}{space 2} -.001644{col 26}{space 1} .0032359{col 38}  -0.51{col 46}{space 3}-.0107539{col 58}{space 3} .0074659
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0008364{col 26}{space 1} .0023706{col 38}   0.35{col 46}{space 3}-.0058377{col 58}{space 3} .0075104
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0022968{col 26}{space 1} .0020745{col 38}   1.11{col 46}{space 3}-.0035435{col 58}{space 3}  .008137
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0022302{col 26}{space 1} .0018719{col 38}   1.19{col 46}{space 3}-.0030397{col 58}{space 3} .0075001
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0021765{col 26}{space 1} .0016493{col 38}   1.32{col 46}{space 3}-.0024668{col 58}{space 3} .0068197
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0014898{col 26}{space 1} .0013831{col 38}   1.08{col 46}{space 3}-.0024042{col 58}{space 3} .0053838
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0000332{col 26}{space 1} .0011941{col 38}  -0.03{col 46}{space 3}-.0033949{col 58}{space 3} .0033285
{col 1}{text}        tp0{col 13}{c |}{result}{space 2} .0008261{col 26}{space 1} .0012955{col 38}   0.64{col 46}{space 3}-.0028212{col 58}{space 3} .0044734
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.0006779{col 26}{space 1} .0015242{col 38}  -0.44{col 46}{space 3}-.0049691{col 58}{space 3} .0036133
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.0012845{col 26}{space 1} .0015506{col 38}  -0.83{col 46}{space 3}-.0056499{col 58}{space 3} .0030808
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0061861{col 26}{space 1}  .001532{col 38}  -4.04{col 46}{space 3} -.010499{col 58}{space 3}-.0018732
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0111595{col 26}{space 1} .0016006{col 38}  -6.97{col 46}{space 3}-.0156656{col 58}{space 3}-.0066535
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0140377{col 26}{space 1} .0016282{col 38}  -8.62{col 46}{space 3}-.0186216{col 58}{space 3}-.0094538
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} -.012557{col 26}{space 1} .0017683{col 38}  -7.10{col 46}{space 3}-.0175352{col 58}{space 3}-.0075788
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}-.0143008{col 26}{space 1} .0020903{col 38}  -6.84{col 46}{space 3}-.0201856{col 58}{space 3} -.008416
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0180228{col 26}{space 1} .0022353{col 38}  -8.06{col 46}{space 3}-.0243159{col 58}{space 3}-.0117297
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}-.0187802{col 26}{space 1} .0026688{col 38}  -7.04{col 46}{space 3}-.0262938{col 58}{space 3}-.0112666
{col 1}{text}       tp10{col 13}{c |}{result}{space 2}-.0141779{col 26}{space 1}  .003505{col 38}  -4.05{col 46}{space 3}-.0240456{col 58}{space 3}-.0043102
{col 1}{text}       tp11{col 13}{c |}{result}{space 2}-.0144961{col 26}{space 1} .0044212{col 38}  -3.28{col 46}{space 3}-.0269431{col 58}{space 3}-.0020492
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0006937{col 26}{space 2}  .001446{col 37}{space 1}    0.48{col 46}{space 3}0.631{col 54}{space 4}-.0021404{col 67}{space 3} .0035278
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}-.0059762{col 26}{space 2} .0012658{col 37}{space 1}   -4.72{col 46}{space 3}0.000{col 54}{space 4}-.0084571{col 67}{space 3}-.0034953
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0023693{col 26}{space 2} .0034712{col 37}{space 1}   -0.68{col 46}{space 3}0.495{col 54}{space 4}-.0091727{col 67}{space 3} .0044341
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0003593{col 26}{space 2} .0024241{col 37}{space 1}    0.15{col 46}{space 3}0.882{col 54}{space 4}-.0043918{col 67}{space 3} .0051105
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0019177{col 26}{space 2} .0020857{col 37}{space 1}    0.92{col 46}{space 3}0.358{col 54}{space 4}-.0021703{col 67}{space 3} .0060057
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0018798{col 26}{space 2} .0017718{col 37}{space 1}    1.06{col 46}{space 3}0.289{col 54}{space 4}-.0015928{col 67}{space 3} .0053525
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0019199{col 26}{space 2}  .001578{col 37}{space 1}    1.22{col 46}{space 3}0.224{col 54}{space 4} -.001173{col 67}{space 3} .0050127
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0012865{col 26}{space 2} .0014146{col 37}{space 1}    0.91{col 46}{space 3}0.363{col 54}{space 4}-.0014861{col 67}{space 3}  .004059
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0001381{col 26}{space 2} .0012464{col 37}{space 1}   -0.11{col 46}{space 3}0.912{col 54}{space 4}-.0025811{col 67}{space 3} .0023049
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2} .0011021{col 26}{space 2} .0013245{col 37}{space 1}    0.83{col 46}{space 3}0.405{col 54}{space 4}-.0014939{col 67}{space 3} .0036981
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.0000892{col 26}{space 2} .0014605{col 37}{space 1}   -0.06{col 46}{space 3}0.951{col 54}{space 4}-.0029518{col 67}{space 3} .0027734
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.0001725{col 26}{space 2} .0015825{col 37}{space 1}   -0.11{col 46}{space 3}0.913{col 54}{space 4}-.0032741{col 67}{space 3}  .002929
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0044287{col 26}{space 2}  .001572{col 37}{space 1}   -2.82{col 46}{space 3}0.005{col 54}{space 4}-.0075097{col 67}{space 3}-.0013476
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0086389{col 26}{space 2} .0016244{col 37}{space 1}   -5.32{col 46}{space 3}0.000{col 54}{space 4}-.0118226{col 67}{space 3}-.0054552
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2} -.010601{col 26}{space 2} .0016271{col 37}{space 1}   -6.52{col 46}{space 3}0.000{col 54}{space 4}-.0137899{col 67}{space 3} -.007412
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}-.0080014{col 26}{space 2} .0018649{col 37}{space 1}   -4.29{col 46}{space 3}0.000{col 54}{space 4}-.0116565{col 67}{space 3}-.0043463
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}-.0085822{col 26}{space 2} .0021146{col 37}{space 1}   -4.06{col 46}{space 3}0.000{col 54}{space 4}-.0127267{col 67}{space 3}-.0044377
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0106392{col 26}{space 2} .0022934{col 37}{space 1}   -4.64{col 46}{space 3}0.000{col 54}{space 4}-.0151342{col 67}{space 3}-.0061442
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-.0104938{col 26}{space 2} .0027372{col 37}{space 1}   -3.83{col 46}{space 3}0.000{col 54}{space 4}-.0158586{col 67}{space 3} -.005129
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2}-.0050275{col 26}{space 2} .0037247{col 37}{space 1}   -1.35{col 46}{space 3}0.177{col 54}{space 4}-.0123278{col 67}{space 3} .0022728
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2}-.0061424{col 26}{space 2} .0045428{col 37}{space 1}   -1.35{col 46}{space 3}0.176{col 54}{space 4} -.015046{col 67}{space 3} .0027613
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0006937{col 26}{space 1} .0014795{col 38}   0.47{col 46}{space 3}-.0034198{col 58}{space 3} .0048072
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2}-.0059762{col 26}{space 1} .0012123{col 38}  -4.93{col 46}{space 3}-.0093468{col 58}{space 3}-.0026057
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0023693{col 26}{space 1} .0036881{col 38}  -0.64{col 46}{space 3}-.0126231{col 58}{space 3} .0078844
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0003593{col 26}{space 1} .0025071{col 38}   0.14{col 46}{space 3}-.0066111{col 58}{space 3} .0073297
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0019177{col 26}{space 1}  .002065{col 38}   0.93{col 46}{space 3}-.0038236{col 58}{space 3} .0076589
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0018798{col 26}{space 1} .0018598{col 38}   1.01{col 46}{space 3}-.0032909{col 58}{space 3} .0070505
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0019199{col 26}{space 1}  .001581{col 38}   1.21{col 46}{space 3}-.0024756{col 58}{space 3} .0063153
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0012865{col 26}{space 1} .0013726{col 38}   0.94{col 46}{space 3}-.0025296{col 58}{space 3} .0051025
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0001381{col 26}{space 1} .0012618{col 38}  -0.11{col 46}{space 3}-.0036462{col 58}{space 3}   .00337
{col 1}{text}        tp0{col 13}{c |}{result}{space 2} .0011021{col 26}{space 1} .0013175{col 38}   0.84{col 46}{space 3}-.0025608{col 58}{space 3} .0047651
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.0000892{col 26}{space 1} .0014205{col 38}  -0.06{col 46}{space 3}-.0040384{col 58}{space 3}   .00386
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.0001725{col 26}{space 1} .0014994{col 38}  -0.12{col 46}{space 3}-.0043413{col 58}{space 3} .0039963
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0044287{col 26}{space 1} .0015309{col 38}  -2.89{col 46}{space 3}-.0086849{col 58}{space 3}-.0001724
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0086389{col 26}{space 1} .0016344{col 38}  -5.29{col 46}{space 3}-.0131829{col 58}{space 3}-.0040949
{col 1}{text}        tp5{col 13}{c |}{result}{space 2} -.010601{col 26}{space 1} .0016288{col 38}  -6.51{col 46}{space 3}-.0151293{col 58}{space 3}-.0060726
{col 1}{text}        tp6{col 13}{c |}{result}{space 2}-.0080014{col 26}{space 1} .0018867{col 38}  -4.24{col 46}{space 3}-.0132468{col 58}{space 3} -.002756
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}-.0085822{col 26}{space 1}  .002168{col 38}  -3.96{col 46}{space 3}-.0146098{col 58}{space 3}-.0025546
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0106392{col 26}{space 1} .0022334{col 38}  -4.76{col 46}{space 3}-.0168486{col 58}{space 3}-.0044298
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}-.0104938{col 26}{space 1} .0027289{col 38}  -3.85{col 46}{space 3}-.0180808{col 58}{space 3}-.0029069
{col 1}{text}       tp10{col 13}{c |}{result}{space 2}-.0050275{col 26}{space 1} .0036241{col 38}  -1.39{col 46}{space 3}-.0151035{col 58}{space 3} .0050485
{col 1}{text}       tp11{col 13}{c |}{result}{space 2}-.0061424{col 26}{space 1} .0046013{col 38}  -1.33{col 46}{space 3}-.0189351{col 58}{space 3} .0066503
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{err}Running event study for service_mental2
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0008525{col 26}{space 2} .0013349{col 37}{space 1}    0.64{col 46}{space 3}0.523{col 54}{space 4}-.0017638{col 67}{space 3} .0034688
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}-.0108311{col 26}{space 2} .0011519{col 37}{space 1}   -9.40{col 46}{space 3}0.000{col 54}{space 4}-.0130887{col 67}{space 3}-.0085735
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0013161{col 26}{space 2} .0031861{col 37}{space 1}   -0.41{col 46}{space 3}0.680{col 54}{space 4}-.0075607{col 67}{space 3} .0049284
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0006297{col 26}{space 2} .0022594{col 37}{space 1}    0.28{col 46}{space 3}0.780{col 54}{space 4}-.0037987{col 67}{space 3} .0050581
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0017681{col 26}{space 2} .0019459{col 37}{space 1}    0.91{col 46}{space 3}0.364{col 54}{space 4}-.0020457{col 67}{space 3}  .005582
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0012008{col 26}{space 2} .0016027{col 37}{space 1}    0.75{col 46}{space 3}0.454{col 54}{space 4}-.0019404{col 67}{space 3}  .004342
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0017194{col 26}{space 2} .0014619{col 37}{space 1}    1.18{col 46}{space 3}0.240{col 54}{space 4}-.0011459{col 67}{space 3} .0045847
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0015443{col 26}{space 2} .0013145{col 37}{space 1}    1.17{col 46}{space 3}0.240{col 54}{space 4}-.0010322{col 67}{space 3} .0041207
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}  .000421{col 26}{space 2} .0011837{col 37}{space 1}    0.36{col 46}{space 3}0.722{col 54}{space 4}-.0018989{col 67}{space 3}  .002741
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0002842{col 26}{space 2} .0011969{col 37}{space 1}   -0.24{col 46}{space 3}0.812{col 54}{space 4}  -.00263{col 67}{space 3} .0020617
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.0012469{col 26}{space 2}  .001348{col 37}{space 1}   -0.92{col 46}{space 3}0.355{col 54}{space 4}-.0038891{col 67}{space 3} .0013952
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.0015102{col 26}{space 2} .0014805{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4}-.0044119{col 67}{space 3} .0013915
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0055359{col 26}{space 2} .0014815{col 37}{space 1}   -3.74{col 46}{space 3}0.000{col 54}{space 4}-.0084397{col 67}{space 3}-.0026321
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2} -.010803{col 26}{space 2} .0015179{col 37}{space 1}   -7.12{col 46}{space 3}0.000{col 54}{space 4} -.013778{col 67}{space 3}-.0078281
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0129981{col 26}{space 2} .0015247{col 37}{space 1}   -8.53{col 46}{space 3}0.000{col 54}{space 4}-.0159865{col 67}{space 3}-.0100098
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}-.0135567{col 26}{space 2} .0016945{col 37}{space 1}   -8.00{col 46}{space 3}0.000{col 54}{space 4} -.016878{col 67}{space 3}-.0102355
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}-.0145486{col 26}{space 2} .0019408{col 37}{space 1}   -7.50{col 46}{space 3}0.000{col 54}{space 4}-.0183525{col 67}{space 3}-.0107446
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0168481{col 26}{space 2} .0020974{col 37}{space 1}   -8.03{col 46}{space 3}0.000{col 54}{space 4} -.020959{col 67}{space 3}-.0127373
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-.0203973{col 26}{space 2}  .002425{col 37}{space 1}   -8.41{col 46}{space 3}0.000{col 54}{space 4}-.0251502{col 67}{space 3}-.0156444
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} -.015131{col 26}{space 2} .0033218{col 37}{space 1}   -4.56{col 46}{space 3}0.000{col 54}{space 4}-.0216416{col 67}{space 3}-.0086204
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2}-.0171136{col 26}{space 2} .0038624{col 37}{space 1}   -4.43{col 46}{space 3}0.000{col 54}{space 4}-.0246837{col 67}{space 3}-.0095435
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0008525{col 26}{space 1} .0012465{col 38}   0.68{col 46}{space 3}-.0026167{col 58}{space 3} .0043216
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2}-.0108311{col 26}{space 1} .0011794{col 38}  -9.18{col 46}{space 3}-.0141136{col 58}{space 3}-.0075487
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0013161{col 26}{space 1}  .003189{col 38}  -0.41{col 46}{space 3}-.0101918{col 58}{space 3} .0075596
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0006297{col 26}{space 1} .0022565{col 38}   0.28{col 46}{space 3}-.0056507{col 58}{space 3} .0069102
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0017681{col 26}{space 1} .0018943{col 38}   0.93{col 46}{space 3}-.0035042{col 58}{space 3} .0070405
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0012008{col 26}{space 1} .0014543{col 38}   0.83{col 46}{space 3}-.0028467{col 58}{space 3} .0052484
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0017194{col 26}{space 1} .0014339{col 38}   1.20{col 46}{space 3}-.0022715{col 58}{space 3} .0057102
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0015443{col 26}{space 1} .0012259{col 38}   1.26{col 46}{space 3}-.0018677{col 58}{space 3} .0049563
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}  .000421{col 26}{space 1} .0012174{col 38}   0.35{col 46}{space 3}-.0029672{col 58}{space 3} .0038092
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0002842{col 26}{space 1}  .001164{col 38}  -0.24{col 46}{space 3}-.0035239{col 58}{space 3} .0029556
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.0012469{col 26}{space 1} .0013597{col 38}  -0.92{col 46}{space 3}-.0050312{col 58}{space 3} .0025373
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.0015102{col 26}{space 1} .0015724{col 38}  -0.96{col 46}{space 3}-.0058866{col 58}{space 3} .0028663
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0055359{col 26}{space 1} .0014794{col 38}  -3.74{col 46}{space 3}-.0096535{col 58}{space 3}-.0014183
{col 1}{text}        tp4{col 13}{c |}{result}{space 2} -.010803{col 26}{space 1} .0015479{col 38}  -6.98{col 46}{space 3}-.0151111{col 58}{space 3}-.0064949
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0129981{col 26}{space 1} .0015691{col 38}  -8.28{col 46}{space 3}-.0173654{col 58}{space 3}-.0086309
{col 1}{text}        tp6{col 13}{c |}{result}{space 2}-.0135567{col 26}{space 1} .0016935{col 38}  -8.01{col 46}{space 3}-.0182702{col 58}{space 3}-.0088433
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}-.0145486{col 26}{space 1}  .002021{col 38}  -7.20{col 46}{space 3}-.0201734{col 58}{space 3}-.0089238
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0168481{col 26}{space 1} .0021789{col 38}  -7.73{col 46}{space 3}-.0229125{col 58}{space 3}-.0107837
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}-.0203973{col 26}{space 1} .0025373{col 38}  -8.04{col 46}{space 3}-.0274591{col 58}{space 3}-.0133356
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} -.015131{col 26}{space 1} .0032349{col 38}  -4.68{col 46}{space 3}-.0241345{col 58}{space 3}-.0061275
{col 1}{text}       tp11{col 13}{c |}{result}{space 2}-.0171136{col 26}{space 1} .0039386{col 38}  -4.35{col 46}{space 3}-.0280757{col 58}{space 3}-.0061515
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0006109{col 26}{space 2} .0013391{col 37}{space 1}    0.46{col 46}{space 3}0.648{col 54}{space 4}-.0020136{col 67}{space 3} .0032354
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}-.0067706{col 26}{space 2} .0011718{col 37}{space 1}   -5.78{col 46}{space 3}0.000{col 54}{space 4}-.0090672{col 67}{space 3} -.004474
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0018826{col 26}{space 2} .0031894{col 37}{space 1}   -0.59{col 46}{space 3}0.555{col 54}{space 4}-.0081337{col 67}{space 3} .0043685
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0002973{col 26}{space 2} .0022648{col 37}{space 1}    0.13{col 46}{space 3}0.896{col 54}{space 4}-.0041416{col 67}{space 3} .0047363
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0015323{col 26}{space 2} .0019513{col 37}{space 1}    0.79{col 46}{space 3}0.432{col 54}{space 4}-.0022921{col 67}{space 3} .0053568
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0009941{col 26}{space 2} .0016089{col 37}{space 1}    0.62{col 46}{space 3}0.537{col 54}{space 4}-.0021593{col 67}{space 3} .0041475
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0015732{col 26}{space 2} .0014667{col 37}{space 1}    1.07{col 46}{space 3}0.283{col 54}{space 4}-.0013015{col 67}{space 3} .0044478
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0014027{col 26}{space 2} .0013177{col 37}{space 1}    1.06{col 46}{space 3}0.287{col 54}{space 4}-.0011799{col 67}{space 3} .0039853
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2} .0003593{col 26}{space 2} .0011848{col 37}{space 1}    0.30{col 46}{space 3}0.762{col 54}{space 4}-.0019629{col 67}{space 3} .0026814
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0000556{col 26}{space 2} .0011984{col 37}{space 1}   -0.05{col 46}{space 3}0.963{col 54}{space 4}-.0024045{col 67}{space 3} .0022933
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.0007901{col 26}{space 2} .0013506{col 37}{space 1}   -0.59{col 46}{space 3}0.559{col 54}{space 4}-.0034371{col 67}{space 3} .0018569
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.0005808{col 26}{space 2} .0014848{col 37}{space 1}   -0.39{col 46}{space 3}0.696{col 54}{space 4}-.0034909{col 67}{space 3} .0023294
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0040047{col 26}{space 2} .0014863{col 37}{space 1}   -2.69{col 46}{space 3}0.007{col 54}{space 4}-.0069177{col 67}{space 3}-.0010916
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0085602{col 26}{space 2} .0015247{col 37}{space 1}   -5.61{col 46}{space 3}0.000{col 54}{space 4}-.0115486{col 67}{space 3}-.0055718
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2} -.009887{col 26}{space 2} .0015329{col 37}{space 1}   -6.45{col 46}{space 3}0.000{col 54}{space 4}-.0128914{col 67}{space 3}-.0068826
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}-.0093663{col 26}{space 2} .0017074{col 37}{space 1}   -5.49{col 46}{space 3}0.000{col 54}{space 4}-.0127127{col 67}{space 3}-.0060198
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}-.0092632{col 26}{space 2} .0019586{col 37}{space 1}   -4.73{col 46}{space 3}0.000{col 54}{space 4}-.0131019{col 67}{space 3}-.0054245
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0098753{col 26}{space 2} .0021247{col 37}{space 1}   -4.65{col 46}{space 3}0.000{col 54}{space 4}-.0140396{col 67}{space 3}-.0057109
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-.0127647{col 26}{space 2} .0024612{col 37}{space 1}   -5.19{col 46}{space 3}0.000{col 54}{space 4}-.0175886{col 67}{space 3}-.0079409
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} -.006741{col 26}{space 2} .0033612{col 37}{space 1}   -2.01{col 46}{space 3}0.045{col 54}{space 4}-.0133289{col 67}{space 3}-.0001532
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2}-.0093581{col 26}{space 2} .0039189{col 37}{space 1}   -2.39{col 46}{space 3}0.017{col 54}{space 4}-.0170389{col 67}{space 3}-.0016772
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0006109{col 26}{space 1} .0013684{col 38}   0.45{col 46}{space 3}-.0032037{col 58}{space 3} .0044255
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2}-.0067706{col 26}{space 1} .0011278{col 38}  -6.00{col 46}{space 3}-.0099145{col 58}{space 3}-.0036267
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0018826{col 26}{space 1} .0031314{col 38}  -0.60{col 46}{space 3}-.0106117{col 58}{space 3} .0068465
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0002973{col 26}{space 1} .0022327{col 38}   0.13{col 46}{space 3}-.0059266{col 58}{space 3} .0065213
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0015323{col 26}{space 1} .0020419{col 38}   0.75{col 46}{space 3}-.0041596{col 58}{space 3} .0072243
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0009941{col 26}{space 1} .0015901{col 38}   0.63{col 46}{space 3}-.0034385{col 58}{space 3} .0054267
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0015732{col 26}{space 1}  .001432{col 38}   1.10{col 46}{space 3}-.0024186{col 58}{space 3} .0055649
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0014027{col 26}{space 1} .0012651{col 38}   1.11{col 46}{space 3}-.0021237{col 58}{space 3} .0049291
{col 1}{text}        tm2{col 13}{c |}{result}{space 2} .0003593{col 26}{space 1} .0011996{col 38}   0.30{col 46}{space 3}-.0029848{col 58}{space 3} .0037033
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0000556{col 26}{space 1} .0011774{col 38}  -0.05{col 46}{space 3}-.0033377{col 58}{space 3} .0032265
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.0007901{col 26}{space 1} .0013064{col 38}  -0.60{col 46}{space 3}-.0044318{col 58}{space 3} .0028516
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.0005808{col 26}{space 1} .0014859{col 38}  -0.39{col 46}{space 3}-.0047229{col 58}{space 3} .0035613
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0040047{col 26}{space 1} .0014522{col 38}  -2.76{col 46}{space 3}-.0080527{col 58}{space 3} .0000434
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0085602{col 26}{space 1} .0015314{col 38}  -5.59{col 46}{space 3} -.012829{col 58}{space 3}-.0042913
{col 1}{text}        tp5{col 13}{c |}{result}{space 2} -.009887{col 26}{space 1} .0015067{col 38}  -6.56{col 46}{space 3}-.0140869{col 58}{space 3}-.0056871
{col 1}{text}        tp6{col 13}{c |}{result}{space 2}-.0093663{col 26}{space 1} .0015742{col 38}  -5.95{col 46}{space 3}-.0137546{col 58}{space 3} -.004978
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}-.0092632{col 26}{space 1} .0020648{col 38}  -4.49{col 46}{space 3} -.015019{col 58}{space 3}-.0035075
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0098753{col 26}{space 1} .0021218{col 38}  -4.65{col 46}{space 3}-.0157898{col 58}{space 3}-.0039607
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}-.0127647{col 26}{space 1}  .002397{col 38}  -5.33{col 46}{space 3}-.0194464{col 58}{space 3} -.006083
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} -.006741{col 26}{space 1} .0034825{col 38}  -1.94{col 46}{space 3}-.0164487{col 58}{space 3} .0029666
{col 1}{text}       tp11{col 13}{c |}{result}{space 2}-.0093581{col 26}{space 1} .0041261{col 38}  -2.27{col 46}{space 3}-.0208599{col 58}{space 3} .0021437
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{err}Running event study for service_mental3
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0003048{col 26}{space 2} .0005462{col 37}{space 1}    0.56{col 46}{space 3}0.577{col 54}{space 4}-.0007656{col 67}{space 3} .0013753
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} .0003205{col 26}{space 2} .0004862{col 37}{space 1}    0.66{col 46}{space 3}0.510{col 54}{space 4}-.0006324{col 67}{space 3} .0012733
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0001812{col 26}{space 2} .0013727{col 37}{space 1}   -0.13{col 46}{space 3}0.895{col 54}{space 4}-.0028716{col 67}{space 3} .0025093
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0003354{col 26}{space 2} .0009779{col 37}{space 1}    0.34{col 46}{space 3}0.732{col 54}{space 4}-.0015813{col 67}{space 3} .0022521
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0006428{col 26}{space 2} .0007364{col 37}{space 1}    0.87{col 46}{space 3}0.383{col 54}{space 4}-.0008005{col 67}{space 3} .0020862
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0012771{col 26}{space 2} .0008272{col 37}{space 1}    1.54{col 46}{space 3}0.123{col 54}{space 4}-.0003442{col 67}{space 3} .0028984
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0003918{col 26}{space 2} .0006253{col 37}{space 1}    0.63{col 46}{space 3}0.531{col 54}{space 4}-.0008338{col 67}{space 3} .0016173
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0001011{col 26}{space 2} .0005506{col 37}{space 1}    0.18{col 46}{space 3}0.854{col 54}{space 4}-.0009781{col 67}{space 3} .0011803
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0004332{col 26}{space 2} .0004347{col 37}{space 1}   -1.00{col 46}{space 3}0.319{col 54}{space 4}-.0012852{col 67}{space 3} .0004188
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2} .0009456{col 26}{space 2} .0005895{col 37}{space 1}    1.60{col 46}{space 3}0.109{col 54}{space 4}-.0002098{col 67}{space 3} .0021011
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2} .0004389{col 26}{space 2} .0005905{col 37}{space 1}    0.74{col 46}{space 3}0.457{col 54}{space 4}-.0007184{col 67}{space 3} .0015962
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2} .0002172{col 26}{space 2} .0005834{col 37}{space 1}    0.37{col 46}{space 3}0.710{col 54}{space 4}-.0009263{col 67}{space 3} .0013607
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0007245{col 26}{space 2}  .000585{col 37}{space 1}   -1.24{col 46}{space 3}0.216{col 54}{space 4}-.0018711{col 67}{space 3}  .000422
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0004951{col 26}{space 2} .0006433{col 37}{space 1}   -0.77{col 46}{space 3}0.442{col 54}{space 4}-.0017558{col 67}{space 3} .0007657
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0010991{col 26}{space 2} .0006212{col 37}{space 1}   -1.77{col 46}{space 3}0.077{col 54}{space 4}-.0023166{col 67}{space 3} .0001185
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} .0007025{col 26}{space 2} .0008142{col 37}{space 1}    0.86{col 46}{space 3}0.388{col 54}{space 4}-.0008932{col 67}{space 3} .0022983
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}  .000109{col 26}{space 2} .0008715{col 37}{space 1}    0.13{col 46}{space 3}0.900{col 54}{space 4} -.001599{col 67}{space 3} .0018171
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0008699{col 26}{space 2} .0009734{col 37}{space 1}   -0.89{col 46}{space 3}0.372{col 54}{space 4}-.0027777{col 67}{space 3} .0010379
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2} .0014316{col 26}{space 2} .0013188{col 37}{space 1}    1.09{col 46}{space 3}0.278{col 54}{space 4}-.0011532{col 67}{space 3} .0040165
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} .0009138{col 26}{space 2}  .001656{col 37}{space 1}    0.55{col 46}{space 3}0.581{col 54}{space 4}-.0023319{col 67}{space 3} .0041595
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} .0022752{col 26}{space 2} .0022978{col 37}{space 1}    0.99{col 46}{space 3}0.322{col 54}{space 4}-.0022283{col 67}{space 3} .0067788
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0003048{col 26}{space 1} .0005521{col 38}   0.55{col 46}{space 3}-.0012541{col 58}{space 3} .0018638
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} .0003205{col 26}{space 1}  .000514{col 38}   0.62{col 46}{space 3}-.0011311{col 58}{space 3}  .001772
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0001812{col 26}{space 1} .0011733{col 38}  -0.15{col 46}{space 3}-.0034945{col 58}{space 3} .0031322
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0003354{col 26}{space 1} .0010234{col 38}   0.33{col 46}{space 3}-.0025546{col 58}{space 3} .0032254
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0006428{col 26}{space 1} .0007172{col 38}   0.90{col 46}{space 3}-.0013826{col 58}{space 3} .0026683
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0012771{col 26}{space 1} .0008617{col 38}   1.48{col 46}{space 3}-.0011562{col 58}{space 3} .0037104
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0003918{col 26}{space 1} .0006473{col 38}   0.61{col 46}{space 3}-.0014361{col 58}{space 3} .0022196
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0001011{col 26}{space 1}  .000576{col 38}   0.18{col 46}{space 3}-.0015256{col 58}{space 3} .0017278
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0004332{col 26}{space 1} .0004728{col 38}  -0.92{col 46}{space 3}-.0017684{col 58}{space 3}  .000902
{col 1}{text}        tp0{col 13}{c |}{result}{space 2} .0009456{col 26}{space 1} .0006477{col 38}   1.46{col 46}{space 3}-.0008834{col 58}{space 3} .0027747
{col 1}{text}        tp1{col 13}{c |}{result}{space 2} .0004389{col 26}{space 1} .0005374{col 38}   0.82{col 46}{space 3}-.0010788{col 58}{space 3} .0019566
{col 1}{text}        tp2{col 13}{c |}{result}{space 2} .0002172{col 26}{space 1} .0006019{col 38}   0.36{col 46}{space 3}-.0014823{col 58}{space 3} .0019168
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0007245{col 26}{space 1} .0005594{col 38}  -1.30{col 46}{space 3}-.0023042{col 58}{space 3} .0008551
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0004951{col 26}{space 1} .0006697{col 38}  -0.74{col 46}{space 3}-.0023861{col 58}{space 3} .0013959
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0010991{col 26}{space 1} .0005968{col 38}  -1.84{col 46}{space 3}-.0027844{col 58}{space 3} .0005862
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} .0007025{col 26}{space 1}  .000829{col 38}   0.85{col 46}{space 3}-.0016385{col 58}{space 3} .0030436
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}  .000109{col 26}{space 1} .0008729{col 38}   0.12{col 46}{space 3} -.002356{col 58}{space 3} .0025741
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0008699{col 26}{space 1} .0009947{col 38}  -0.87{col 46}{space 3}-.0036789{col 58}{space 3} .0019392
{col 1}{text}        tp9{col 13}{c |}{result}{space 2} .0014316{col 26}{space 1} .0012226{col 38}   1.17{col 46}{space 3}-.0020209{col 58}{space 3} .0048842
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} .0009138{col 26}{space 1} .0015544{col 38}   0.59{col 46}{space 3}-.0034755{col 58}{space 3} .0053031
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} .0022752{col 26}{space 1} .0024946{col 38}   0.91{col 46}{space 3}-.0047691{col 58}{space 3} .0093196
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2}  .000184{col 26}{space 2} .0005479{col 37}{space 1}    0.34{col 46}{space 3}0.737{col 54}{space 4}-.0008898{col 67}{space 3} .0012577
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} .0007257{col 26}{space 2} .0004938{col 37}{space 1}    1.47{col 46}{space 3}0.142{col 54}{space 4}-.0002422{col 67}{space 3} .0016937
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0003483{col 26}{space 2} .0013744{col 37}{space 1}   -0.25{col 46}{space 3}0.800{col 54}{space 4}-.0030421{col 67}{space 3} .0023456
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0001839{col 26}{space 2} .0009799{col 37}{space 1}    0.19{col 46}{space 3}0.851{col 54}{space 4}-.0017367{col 67}{space 3} .0021045
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0004909{col 26}{space 2} .0007381{col 37}{space 1}    0.67{col 46}{space 3}0.506{col 54}{space 4}-.0009557{col 67}{space 3} .0019375
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0011261{col 26}{space 2} .0008289{col 37}{space 1}    1.36{col 46}{space 3}0.174{col 54}{space 4}-.0004985{col 67}{space 3} .0027507
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0002783{col 26}{space 2}  .000627{col 37}{space 1}    0.44{col 46}{space 3}0.657{col 54}{space 4}-.0009506{col 67}{space 3} .0015072
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0000369{col 26}{space 2} .0005519{col 37}{space 1}    0.07{col 46}{space 3}0.947{col 54}{space 4}-.0010448{col 67}{space 3} .0011185
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}  -.00048{col 26}{space 2} .0004355{col 37}{space 1}   -1.10{col 46}{space 3}0.270{col 54}{space 4}-.0013336{col 67}{space 3} .0003735
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2} .0009958{col 26}{space 2}   .00059{col 37}{space 1}    1.69{col 46}{space 3}0.091{col 54}{space 4}-.0001605{col 67}{space 3} .0021521
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}   .00057{col 26}{space 2} .0005914{col 37}{space 1}    0.96{col 46}{space 3}0.335{col 54}{space 4}-.0005891{col 67}{space 3} .0017291
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2} .0004122{col 26}{space 2} .0005852{col 37}{space 1}    0.70{col 46}{space 3}0.481{col 54}{space 4}-.0007347{col 67}{space 3} .0015591
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0004696{col 26}{space 2}  .000587{col 37}{space 1}   -0.80{col 46}{space 3}0.424{col 54}{space 4}-.0016201{col 67}{space 3} .0006809
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0001902{col 26}{space 2} .0006456{col 37}{space 1}   -0.29{col 46}{space 3}0.768{col 54}{space 4}-.0014557{col 67}{space 3} .0010752
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0007412{col 26}{space 2} .0006243{col 37}{space 1}   -1.19{col 46}{space 3}0.235{col 54}{space 4}-.0019648{col 67}{space 3} .0004825
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} .0011226{col 26}{space 2} .0008185{col 37}{space 1}    1.37{col 46}{space 3}0.170{col 54}{space 4}-.0004816{col 67}{space 3} .0027268
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2} .0006017{col 26}{space 2} .0008778{col 37}{space 1}    0.69{col 46}{space 3}0.493{col 54}{space 4}-.0011187{col 67}{space 3} .0023221
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0003504{col 26}{space 2} .0009843{col 37}{space 1}   -0.36{col 46}{space 3}0.722{col 54}{space 4}-.0022796{col 67}{space 3} .0015787
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2} .0021608{col 26}{space 2} .0013299{col 37}{space 1}    1.62{col 46}{space 3}0.104{col 54}{space 4}-.0004457{col 67}{space 3} .0047674
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} .0016748{col 26}{space 2} .0016691{col 37}{space 1}    1.00{col 46}{space 3}0.316{col 54}{space 4}-.0015965{col 67}{space 3} .0049461
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} .0029224{col 26}{space 2} .0023151{col 37}{space 1}    1.26{col 46}{space 3}0.207{col 54}{space 4}-.0016151{col 67}{space 3} .0074599
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2}  .000184{col 26}{space 1} .0005716{col 38}   0.32{col 46}{space 3}-.0014652{col 58}{space 3} .0018332
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} .0007257{col 26}{space 1} .0005003{col 38}   1.45{col 46}{space 3}-.0007176{col 58}{space 3} .0021691
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0003483{col 26}{space 1} .0011742{col 38}  -0.30{col 46}{space 3}-.0037361{col 58}{space 3} .0030395
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0001839{col 26}{space 1} .0010634{col 38}   0.17{col 46}{space 3}-.0028842{col 58}{space 3}  .003252
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0004909{col 26}{space 1} .0007568{col 38}   0.65{col 46}{space 3}-.0016925{col 58}{space 3} .0026743
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0011261{col 26}{space 1} .0008228{col 38}   1.37{col 46}{space 3}-.0012479{col 58}{space 3} .0035001
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0002783{col 26}{space 1} .0006132{col 38}   0.45{col 46}{space 3} -.001491{col 58}{space 3} .0020476
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0000369{col 26}{space 1}  .000563{col 38}   0.07{col 46}{space 3}-.0015876{col 58}{space 3} .0016613
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}  -.00048{col 26}{space 1} .0004604{col 38}  -1.04{col 46}{space 3}-.0018085{col 58}{space 3} .0008484
{col 1}{text}        tp0{col 13}{c |}{result}{space 2} .0009958{col 26}{space 1} .0006119{col 38}   1.63{col 46}{space 3}-.0007696{col 58}{space 3} .0027612
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}   .00057{col 26}{space 1} .0005854{col 38}   0.97{col 46}{space 3}-.0011191{col 58}{space 3} .0022591
{col 1}{text}        tp2{col 13}{c |}{result}{space 2} .0004122{col 26}{space 1} .0006104{col 38}   0.68{col 46}{space 3} -.001349{col 58}{space 3} .0021733
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0004696{col 26}{space 1} .0005375{col 38}  -0.87{col 46}{space 3}-.0020203{col 58}{space 3} .0010811
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0001902{col 26}{space 1} .0006416{col 38}  -0.30{col 46}{space 3}-.0020414{col 58}{space 3} .0016609
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0007412{col 26}{space 1} .0006301{col 38}  -1.18{col 46}{space 3} -.002559{col 58}{space 3} .0010767
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} .0011226{col 26}{space 1} .0008423{col 38}   1.33{col 46}{space 3}-.0013077{col 58}{space 3} .0035529
{col 1}{text}        tp7{col 13}{c |}{result}{space 2} .0006017{col 26}{space 1} .0008321{col 38}   0.72{col 46}{space 3}-.0017989{col 58}{space 3} .0030023
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0003504{col 26}{space 1} .0009837{col 38}  -0.36{col 46}{space 3}-.0031887{col 58}{space 3} .0024878
{col 1}{text}        tp9{col 13}{c |}{result}{space 2} .0021608{col 26}{space 1} .0013937{col 38}   1.55{col 46}{space 3}-.0018601{col 58}{space 3} .0061818
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} .0016748{col 26}{space 1}  .001651{col 38}   1.01{col 46}{space 3}-.0030887{col 58}{space 3} .0064383
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} .0029224{col 26}{space 1} .0025028{col 38}   1.17{col 46}{space 3}-.0042988{col 58}{space 3} .0101435
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{err}Running event study for cardio_risk
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0006332{col 26}{space 2} .0004928{col 37}{space 1}    1.29{col 46}{space 3}0.199{col 54}{space 4}-.0003326{col 67}{space 3}  .001599
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}-.0011165{col 26}{space 2} .0005156{col 37}{space 1}   -2.17{col 46}{space 3}0.030{col 54}{space 4} -.002127{col 67}{space 3} -.000106
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2} .0009168{col 26}{space 2} .0012288{col 37}{space 1}    0.75{col 46}{space 3}0.456{col 54}{space 4}-.0014917{col 67}{space 3} .0033253
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0010352{col 26}{space 2} .0009234{col 37}{space 1}    1.12{col 46}{space 3}0.262{col 54}{space 4}-.0007745{col 67}{space 3}  .002845
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0012281{col 26}{space 2} .0007666{col 37}{space 1}    1.60{col 46}{space 3}0.109{col 54}{space 4}-.0002743{col 67}{space 3} .0027305
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0007164{col 26}{space 2} .0006446{col 37}{space 1}    1.11{col 46}{space 3}0.266{col 54}{space 4}-.0005469{col 67}{space 3} .0019797
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0005986{col 26}{space 2} .0005969{col 37}{space 1}    1.00{col 46}{space 3}0.316{col 54}{space 4}-.0005713{col 67}{space 3} .0017686
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0002218{col 26}{space 2}  .000574{col 37}{space 1}    0.39{col 46}{space 3}0.699{col 54}{space 4}-.0009032{col 67}{space 3} .0013467
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0002844{col 26}{space 2} .0004883{col 37}{space 1}   -0.58{col 46}{space 3}0.560{col 54}{space 4}-.0012414{col 67}{space 3} .0006726
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0009564{col 26}{space 2} .0004784{col 37}{space 1}   -2.00{col 46}{space 3}0.046{col 54}{space 4} -.001894{col 67}{space 3}-.0000187
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.0010245{col 26}{space 2} .0005099{col 37}{space 1}   -2.01{col 46}{space 3}0.045{col 54}{space 4} -.002024{col 67}{space 3}-.0000251
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.0008861{col 26}{space 2} .0005494{col 37}{space 1}   -1.61{col 46}{space 3}0.107{col 54}{space 4} -.001963{col 67}{space 3} .0001907
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0007648{col 26}{space 2} .0006108{col 37}{space 1}   -1.25{col 46}{space 3}0.211{col 54}{space 4} -.001962{col 67}{space 3} .0004324
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0011619{col 26}{space 2} .0006048{col 37}{space 1}   -1.92{col 46}{space 3}0.055{col 54}{space 4}-.0023472{col 67}{space 3} .0000234
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0013919{col 26}{space 2} .0005896{col 37}{space 1}   -2.36{col 46}{space 3}0.018{col 54}{space 4}-.0025474{col 67}{space 3}-.0002364
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}-.0005124{col 26}{space 2} .0007524{col 37}{space 1}   -0.68{col 46}{space 3}0.496{col 54}{space 4} -.001987{col 67}{space 3} .0009623
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}-.0001308{col 26}{space 2} .0008842{col 37}{space 1}   -0.15{col 46}{space 3}0.882{col 54}{space 4}-.0018638{col 67}{space 3} .0016022
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0023826{col 26}{space 2} .0008364{col 37}{space 1}   -2.85{col 46}{space 3}0.004{col 54}{space 4}-.0040219{col 67}{space 3}-.0007433
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-.0022832{col 26}{space 2} .0009897{col 37}{space 1}   -2.31{col 46}{space 3}0.021{col 54}{space 4}-.0042229{col 67}{space 3}-.0003435
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2}-.0024085{col 26}{space 2} .0012753{col 37}{space 1}   -1.89{col 46}{space 3}0.059{col 54}{space 4}-.0049081{col 67}{space 3}  .000091
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} .0005053{col 26}{space 2} .0017181{col 37}{space 1}    0.29{col 46}{space 3}0.769{col 54}{space 4}-.0028621{col 67}{space 3} .0038728
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0006332{col 26}{space 1} .0004904{col 38}   1.29{col 46}{space 3}-.0007171{col 58}{space 3} .0019836
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2}-.0011165{col 26}{space 1} .0005007{col 38}  -2.23{col 46}{space 3}-.0024952{col 58}{space 3} .0002622
{col 1}{text}        tm8{col 13}{c |}{result}{space 2} .0009168{col 26}{space 1} .0017208{col 38}   0.53{col 46}{space 3}-.0038214{col 58}{space 3}  .005655
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0010352{col 26}{space 1} .0010049{col 38}   1.03{col 46}{space 3}-.0017318{col 58}{space 3} .0038023
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0012281{col 26}{space 1} .0007878{col 38}   1.56{col 46}{space 3}-.0009411{col 58}{space 3} .0033973
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0007164{col 26}{space 1}  .000649{col 38}   1.10{col 46}{space 3}-.0010706{col 58}{space 3} .0025034
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0005986{col 26}{space 1} .0005445{col 38}   1.10{col 46}{space 3}-.0009005{col 58}{space 3} .0020978
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0002218{col 26}{space 1} .0005726{col 38}   0.39{col 46}{space 3}-.0013547{col 58}{space 3} .0017982
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0002844{col 26}{space 1} .0004865{col 38}  -0.58{col 46}{space 3}-.0016238{col 58}{space 3}  .001055
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0009564{col 26}{space 1} .0004294{col 38}  -2.23{col 46}{space 3}-.0021388{col 58}{space 3} .0002261
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.0010245{col 26}{space 1} .0005061{col 38}  -2.02{col 46}{space 3} -.002418{col 58}{space 3} .0003689
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.0008861{col 26}{space 1} .0005404{col 38}  -1.64{col 46}{space 3}-.0023741{col 58}{space 3} .0006018
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0007648{col 26}{space 1} .0006078{col 38}  -1.26{col 46}{space 3}-.0024383{col 58}{space 3} .0009086
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0011619{col 26}{space 1} .0006164{col 38}  -1.89{col 46}{space 3} -.002859{col 58}{space 3} .0005352
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0013919{col 26}{space 1} .0006031{col 38}  -2.31{col 46}{space 3}-.0030526{col 58}{space 3} .0002688
{col 1}{text}        tp6{col 13}{c |}{result}{space 2}-.0005124{col 26}{space 1} .0007304{col 38}  -0.70{col 46}{space 3}-.0025236{col 58}{space 3} .0014989
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}-.0001308{col 26}{space 1} .0008134{col 38}  -0.16{col 46}{space 3}-.0023706{col 58}{space 3} .0021089
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0023826{col 26}{space 1} .0008648{col 38}  -2.76{col 46}{space 3}-.0047639{col 58}{space 3}-1.38e-06
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}-.0022832{col 26}{space 1} .0009225{col 38}  -2.48{col 46}{space 3}-.0048231{col 58}{space 3} .0002568
{col 1}{text}       tp10{col 13}{c |}{result}{space 2}-.0024085{col 26}{space 1} .0013038{col 38}  -1.85{col 46}{space 3}-.0059984{col 58}{space 3} .0011814
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} .0005053{col 26}{space 1} .0022504{col 38}   0.22{col 46}{space 3}-.0056909{col 58}{space 3} .0067016
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0007704{col 26}{space 2} .0004975{col 37}{space 1}    1.55{col 46}{space 3}0.122{col 54}{space 4}-.0002048{col 67}{space 3} .0017455
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}-.0019081{col 26}{space 2} .0005413{col 37}{space 1}   -3.53{col 46}{space 3}0.000{col 54}{space 4} -.002969{col 67}{space 3}-.0008473
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2} .0009601{col 26}{space 2} .0012336{col 37}{space 1}    0.78{col 46}{space 3}0.436{col 54}{space 4}-.0014577{col 67}{space 3}  .003378
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0012122{col 26}{space 2} .0009292{col 37}{space 1}    1.30{col 46}{space 3}0.192{col 54}{space 4} -.000609{col 67}{space 3} .0030334
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0014131{col 26}{space 2} .0007718{col 37}{space 1}    1.83{col 46}{space 3}0.067{col 54}{space 4}-.0000995{col 67}{space 3} .0029257
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0009093{col 26}{space 2} .0006509{col 37}{space 1}    1.40{col 46}{space 3}0.162{col 54}{space 4}-.0003664{col 67}{space 3} .0021851
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0007878{col 26}{space 2} .0006012{col 37}{space 1}    1.31{col 46}{space 3}0.190{col 54}{space 4}-.0003906{col 67}{space 3} .0019661
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0003414{col 26}{space 2} .0005765{col 37}{space 1}    0.59{col 46}{space 3}0.554{col 54}{space 4}-.0007886{col 67}{space 3} .0014714
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0002314{col 26}{space 2} .0004894{col 37}{space 1}   -0.47{col 46}{space 3}0.636{col 54}{space 4}-.0011907{col 67}{space 3} .0007278
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0010075{col 26}{space 2} .0004798{col 37}{space 1}   -2.10{col 46}{space 3}0.036{col 54}{space 4}-.0019478{col 67}{space 3}-.0000671
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.0012058{col 26}{space 2} .0005132{col 37}{space 1}   -2.35{col 46}{space 3}0.019{col 54}{space 4}-.0022115{col 67}{space 3}   -.0002
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.0011349{col 26}{space 2} .0005548{col 37}{space 1}   -2.05{col 46}{space 3}0.041{col 54}{space 4}-.0022223{col 67}{space 3}-.0000474
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0010786{col 26}{space 2} .0006187{col 37}{space 1}   -1.74{col 46}{space 3}0.081{col 54}{space 4}-.0022912{col 67}{space 3}  .000134
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0016081{col 26}{space 2} .0006162{col 37}{space 1}   -2.61{col 46}{space 3}0.009{col 54}{space 4}-.0028158{col 67}{space 3}-.0004004
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0018881{col 26}{space 2}  .000605{col 37}{space 1}   -3.12{col 46}{space 3}0.002{col 54}{space 4}-.0030739{col 67}{space 3}-.0007023
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}-.0012551{col 26}{space 2}  .000773{col 37}{space 1}   -1.62{col 46}{space 3}0.104{col 54}{space 4}-.0027701{col 67}{space 3} .0002598
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}-.0012316{col 26}{space 2} .0009103{col 37}{space 1}   -1.35{col 46}{space 3}0.176{col 54}{space 4}-.0030159{col 67}{space 3} .0005526
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0037853{col 26}{space 2} .0008806{col 37}{space 1}   -4.30{col 46}{space 3}0.000{col 54}{space 4}-.0055113{col 67}{space 3}-.0020593
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-.0038569{col 26}{space 2}  .001039{col 37}{space 1}   -3.71{col 46}{space 3}0.000{col 54}{space 4}-.0058933{col 67}{space 3}-.0018205
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2}-.0042063{col 26}{space 2} .0013319{col 37}{space 1}   -3.16{col 46}{space 3}0.002{col 54}{space 4}-.0068168{col 67}{space 3}-.0015958
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2}-.0006391{col 26}{space 2} .0017776{col 37}{space 1}   -0.36{col 46}{space 3}0.719{col 54}{space 4}-.0041232{col 67}{space 3} .0028449
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0007704{col 26}{space 1} .0005109{col 38}   1.51{col 46}{space 3}-.0006152{col 58}{space 3} .0021559
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2}-.0019081{col 26}{space 1} .0005236{col 38}  -3.64{col 46}{space 3} -.003328{col 58}{space 3}-.0004882
{col 1}{text}        tm8{col 13}{c |}{result}{space 2} .0009601{col 26}{space 1} .0015456{col 38}   0.62{col 46}{space 3}-.0032315{col 58}{space 3} .0051517
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0012122{col 26}{space 1} .0010184{col 38}   1.19{col 46}{space 3}-.0015496{col 58}{space 3}  .003974
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0014131{col 26}{space 1} .0007608{col 38}   1.86{col 46}{space 3}-.0006501{col 58}{space 3} .0034763
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0009093{col 26}{space 1} .0006694{col 38}   1.36{col 46}{space 3}-.0009061{col 58}{space 3} .0027248
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0007878{col 26}{space 1} .0005832{col 38}   1.35{col 46}{space 3}-.0007938{col 58}{space 3} .0023693
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0003414{col 26}{space 1} .0005801{col 38}   0.59{col 46}{space 3}-.0012319{col 58}{space 3} .0019147
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0002314{col 26}{space 1} .0004984{col 38}  -0.46{col 46}{space 3}-.0015831{col 58}{space 3} .0011202
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0010075{col 26}{space 1} .0004497{col 38}  -2.24{col 46}{space 3}-.0022269{col 58}{space 3}  .000212
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.0012058{col 26}{space 1} .0005061{col 38}  -2.38{col 46}{space 3}-.0025783{col 58}{space 3} .0001667
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.0011349{col 26}{space 1} .0005752{col 38}  -1.97{col 46}{space 3}-.0026947{col 58}{space 3} .0004249
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0010786{col 26}{space 1} .0006014{col 38}  -1.79{col 46}{space 3}-.0027096{col 58}{space 3} .0005525
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0016081{col 26}{space 1} .0006059{col 38}  -2.65{col 46}{space 3}-.0032514{col 58}{space 3} .0000352
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0018881{col 26}{space 1} .0005778{col 38}  -3.27{col 46}{space 3}-.0034549{col 58}{space 3}-.0003212
{col 1}{text}        tp6{col 13}{c |}{result}{space 2}-.0012551{col 26}{space 1} .0007842{col 38}  -1.60{col 46}{space 3} -.003382{col 58}{space 3} .0008717
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}-.0012316{col 26}{space 1} .0009325{col 38}  -1.32{col 46}{space 3}-.0037604{col 58}{space 3} .0012972
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0037853{col 26}{space 1} .0009513{col 38}  -3.98{col 46}{space 3}-.0063653{col 58}{space 3}-.0012054
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}-.0038569{col 26}{space 1} .0010566{col 38}  -3.65{col 46}{space 3}-.0067222{col 58}{space 3}-.0009916
{col 1}{text}       tp10{col 13}{c |}{result}{space 2}-.0042063{col 26}{space 1} .0013346{col 38}  -3.15{col 46}{space 3}-.0078256{col 58}{space 3}-.0005869
{col 1}{text}       tp11{col 13}{c |}{result}{space 2}-.0006391{col 26}{space 1} .0018638{col 38}  -0.34{col 46}{space 3}-.0056935{col 58}{space 3} .0044153
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{err}Running event study for laboral
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2}-.0012426{col 26}{space 2} .0016058{col 37}{space 1}   -0.77{col 46}{space 3}0.439{col 54}{space 4}-.0043898{col 67}{space 3} .0019047
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}-.0007697{col 26}{space 2} .0010848{col 37}{space 1}   -0.71{col 46}{space 3}0.478{col 54}{space 4}-.0028958{col 67}{space 3} .0013564
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2} -.004033{col 26}{space 2} .0037811{col 37}{space 1}   -1.07{col 46}{space 3}0.286{col 54}{space 4}-.0114439{col 67}{space 3} .0033778
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2}-.0029736{col 26}{space 2} .0028312{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-.0085227{col 67}{space 3} .0025755
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2}-.0023015{col 26}{space 2} .0022573{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4}-.0067257{col 67}{space 3} .0021226
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2}-.0010485{col 26}{space 2} .0018753{col 37}{space 1}   -0.56{col 46}{space 3}0.576{col 54}{space 4} -.004724{col 67}{space 3}  .002627
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0001292{col 26}{space 2}  .001688{col 37}{space 1}    0.08{col 46}{space 3}0.939{col 54}{space 4}-.0031793{col 67}{space 3} .0034376
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0001326{col 26}{space 2} .0015154{col 37}{space 1}    0.09{col 46}{space 3}0.930{col 54}{space 4}-.0028375{col 67}{space 3} .0031028
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2} .0013967{col 26}{space 2} .0014356{col 37}{space 1}    0.97{col 46}{space 3}0.331{col 54}{space 4}-.0014169{col 67}{space 3} .0042104
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0030138{col 26}{space 2} .0013688{col 37}{space 1}   -2.20{col 46}{space 3}0.028{col 54}{space 4}-.0056965{col 67}{space 3}-.0003311
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.0012056{col 26}{space 2} .0014969{col 37}{space 1}   -0.81{col 46}{space 3}0.421{col 54}{space 4}-.0041396{col 67}{space 3} .0017283
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2} .0000803{col 26}{space 2} .0015887{col 37}{space 1}    0.05{col 46}{space 3}0.960{col 54}{space 4}-.0030335{col 67}{space 3} .0031942
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0003487{col 26}{space 2} .0016731{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4}-.0036279{col 67}{space 3} .0029306
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0028756{col 26}{space 2} .0017164{col 37}{space 1}   -1.68{col 46}{space 3}0.094{col 54}{space 4}-.0062398{col 67}{space 3} .0004885
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0018564{col 26}{space 2}  .001759{col 37}{space 1}   -1.06{col 46}{space 3}0.291{col 54}{space 4} -.005304{col 67}{space 3} .0015913
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}-.0003377{col 26}{space 2} .0019548{col 37}{space 1}   -0.17{col 46}{space 3}0.863{col 54}{space 4}-.0041691{col 67}{space 3} .0034936
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2} .0001405{col 26}{space 2} .0021529{col 37}{space 1}    0.07{col 46}{space 3}0.948{col 54}{space 4}-.0040792{col 67}{space 3} .0043601
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2} .0017515{col 26}{space 2} .0024334{col 37}{space 1}    0.72{col 46}{space 3}0.472{col 54}{space 4} -.003018{col 67}{space 3} .0065209
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2} .0032007{col 26}{space 2}  .002996{col 37}{space 1}    1.07{col 46}{space 3}0.285{col 54}{space 4}-.0026713{col 67}{space 3} .0090727
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2}-.0014107{col 26}{space 2} .0033172{col 37}{space 1}   -0.43{col 46}{space 3}0.671{col 54}{space 4}-.0079123{col 67}{space 3} .0050909
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2}-.0033612{col 26}{space 2} .0039081{col 37}{space 1}   -0.86{col 46}{space 3}0.390{col 54}{space 4}-.0110209{col 67}{space 3} .0042986
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2}-.0012426{col 26}{space 1} .0016089{col 38}  -0.77{col 46}{space 3}-.0060009{col 58}{space 3} .0035157
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2}-.0007697{col 26}{space 1} .0010809{col 38}  -0.71{col 46}{space 3}-.0039666{col 58}{space 3} .0024272
{col 1}{text}        tm8{col 13}{c |}{result}{space 2} -.004033{col 26}{space 1} .0036758{col 38}  -1.10{col 46}{space 3}-.0149043{col 58}{space 3} .0068382
{col 1}{text}        tm7{col 13}{c |}{result}{space 2}-.0029736{col 26}{space 1} .0027178{col 38}  -1.09{col 46}{space 3}-.0110116{col 58}{space 3} .0050644
{col 1}{text}        tm6{col 13}{c |}{result}{space 2}-.0023015{col 26}{space 1} .0021241{col 38}  -1.08{col 46}{space 3}-.0085835{col 58}{space 3} .0039805
{col 1}{text}        tm5{col 13}{c |}{result}{space 2}-.0010485{col 26}{space 1}  .001907{col 38}  -0.55{col 46}{space 3}-.0066887{col 58}{space 3} .0045916
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0001292{col 26}{space 1} .0015096{col 38}   0.09{col 46}{space 3}-.0043354{col 58}{space 3} .0045937
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0001326{col 26}{space 1} .0014847{col 38}   0.09{col 46}{space 3}-.0042584{col 58}{space 3} .0045237
{col 1}{text}        tm2{col 13}{c |}{result}{space 2} .0013967{col 26}{space 1} .0014162{col 38}   0.99{col 46}{space 3}-.0027918{col 58}{space 3} .0055853
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0030138{col 26}{space 1} .0014305{col 38}  -2.11{col 46}{space 3}-.0072445{col 58}{space 3}  .001217
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.0012056{col 26}{space 1} .0015053{col 38}  -0.80{col 46}{space 3}-.0056575{col 58}{space 3} .0032463
{col 1}{text}        tp2{col 13}{c |}{result}{space 2} .0000803{col 26}{space 1} .0015453{col 38}   0.05{col 46}{space 3}-.0044899{col 58}{space 3} .0046505
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0003487{col 26}{space 1} .0016316{col 38}  -0.21{col 46}{space 3}-.0051743{col 58}{space 3} .0044769
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0028756{col 26}{space 1} .0017253{col 38}  -1.67{col 46}{space 3}-.0079784{col 58}{space 3} .0022272
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0018564{col 26}{space 1} .0017366{col 38}  -1.07{col 46}{space 3}-.0069924{col 58}{space 3} .0032796
{col 1}{text}        tp6{col 13}{c |}{result}{space 2}-.0003377{col 26}{space 1} .0019405{col 38}  -0.17{col 46}{space 3} -.006077{col 58}{space 3} .0054015
{col 1}{text}        tp7{col 13}{c |}{result}{space 2} .0001405{col 26}{space 1} .0021166{col 38}   0.07{col 46}{space 3}-.0061195{col 58}{space 3} .0064005
{col 1}{text}        tp8{col 13}{c |}{result}{space 2} .0017515{col 26}{space 1} .0023384{col 38}   0.75{col 46}{space 3}-.0051645{col 58}{space 3} .0086675
{col 1}{text}        tp9{col 13}{c |}{result}{space 2} .0032007{col 26}{space 1} .0028727{col 38}   1.11{col 46}{space 3}-.0052954{col 58}{space 3} .0116969
{col 1}{text}       tp10{col 13}{c |}{result}{space 2}-.0014107{col 26}{space 1}  .003047{col 38}  -0.46{col 46}{space 3}-.0104222{col 58}{space 3} .0076009
{col 1}{text}       tp11{col 13}{c |}{result}{space 2}-.0033612{col 26}{space 1}  .004007{col 38}  -0.84{col 46}{space 3}-.0152122{col 58}{space 3} .0084899
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2}-.0017368{col 26}{space 2}  .001612{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-.0048963{col 67}{space 3} .0014227
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} .0026616{col 26}{space 2} .0010952{col 37}{space 1}    2.43{col 46}{space 3}0.015{col 54}{space 4} .0005152{col 67}{space 3} .0048081
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0054684{col 26}{space 2} .0037871{col 37}{space 1}   -1.44{col 46}{space 3}0.149{col 54}{space 4}-.0128911{col 67}{space 3} .0019542
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2}-.0033393{col 26}{space 2} .0028385{col 37}{space 1}   -1.18{col 46}{space 3}0.239{col 54}{space 4}-.0089027{col 67}{space 3} .0022241
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2}-.0023468{col 26}{space 2} .0022645{col 37}{space 1}   -1.04{col 46}{space 3}0.300{col 54}{space 4}-.0067851{col 67}{space 3} .0020914
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2}-.0012916{col 26}{space 2} .0018817{col 37}{space 1}   -0.69{col 46}{space 3}0.492{col 54}{space 4}-.0049796{col 67}{space 3} .0023965
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2}-.0002818{col 26}{space 2} .0016939{col 37}{space 1}   -0.17{col 46}{space 3}0.868{col 54}{space 4}-.0036018{col 67}{space 3} .0030381
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2}-.0002436{col 26}{space 2} .0015189{col 37}{space 1}   -0.16{col 46}{space 3}0.873{col 54}{space 4}-.0032207{col 67}{space 3} .0027335
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2} .0008141{col 26}{space 2}  .001438{col 37}{space 1}    0.57{col 46}{space 3}0.571{col 54}{space 4}-.0020043{col 67}{space 3} .0036325
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0029246{col 26}{space 2} .0013699{col 37}{space 1}   -2.13{col 46}{space 3}0.033{col 54}{space 4}-.0056096{col 67}{space 3}-.0002396
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2} -.000987{col 26}{space 2} .0014987{col 37}{space 1}   -0.66{col 46}{space 3}0.510{col 54}{space 4}-.0039245{col 67}{space 3} .0019505
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2} .0005373{col 26}{space 2} .0015913{col 37}{space 1}    0.34{col 46}{space 3}0.736{col 54}{space 4}-.0025815{col 67}{space 3} .0036562
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2} .0005772{col 26}{space 2} .0016764{col 37}{space 1}    0.34{col 46}{space 3}0.731{col 54}{space 4}-.0027085{col 67}{space 3} .0038628
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2} -.001129{col 26}{space 2} .0017199{col 37}{space 1}   -0.66{col 46}{space 3}0.512{col 54}{space 4}-.0044999{col 67}{space 3} .0022418
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2} .0010006{col 26}{space 2}  .001763{col 37}{space 1}    0.57{col 46}{space 3}0.570{col 54}{space 4}-.0024548{col 67}{space 3}  .004456
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} .0034154{col 26}{space 2} .0019604{col 37}{space 1}    1.74{col 46}{space 3}0.081{col 54}{space 4}-.0004269{col 67}{space 3} .0072578
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}  .004757{col 26}{space 2} .0021596{col 37}{space 1}    2.20{col 46}{space 3}0.028{col 54}{space 4} .0005242{col 67}{space 3} .0089898
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}  .007387{col 26}{space 2} .0024445{col 37}{space 1}    3.02{col 46}{space 3}0.003{col 54}{space 4} .0025958{col 67}{space 3} .0121781
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2} .0099216{col 26}{space 2} .0030115{col 37}{space 1}    3.29{col 46}{space 3}0.001{col 54}{space 4} .0040191{col 67}{space 3} .0158241
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} .0063394{col 26}{space 2} .0033394{col 37}{space 1}    1.90{col 46}{space 3}0.058{col 54}{space 4}-.0002056{col 67}{space 3} .0128845
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} .0030446{col 26}{space 2} .0039423{col 37}{space 1}    0.77{col 46}{space 3}0.440{col 54}{space 4}-.0046821{col 67}{space 3} .0107713
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2}-.0017368{col 26}{space 1} .0015724{col 38}  -1.10{col 46}{space 3}-.0060198{col 58}{space 3} .0025463
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} .0026616{col 26}{space 1} .0010946{col 38}   2.43{col 46}{space 3}-.0003199{col 58}{space 3} .0056431
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0054684{col 26}{space 1} .0037988{col 38}  -1.44{col 46}{space 3}-.0158157{col 58}{space 3} .0048789
{col 1}{text}        tm7{col 13}{c |}{result}{space 2}-.0033393{col 26}{space 1}  .002804{col 38}  -1.19{col 46}{space 3}-.0109769{col 58}{space 3} .0042983
{col 1}{text}        tm6{col 13}{c |}{result}{space 2}-.0023468{col 26}{space 1} .0022176{col 38}  -1.06{col 46}{space 3}-.0083873{col 58}{space 3} .0036936
{col 1}{text}        tm5{col 13}{c |}{result}{space 2}-.0012916{col 26}{space 1}  .001769{col 38}  -0.73{col 46}{space 3}-.0061101{col 58}{space 3}  .003527
{col 1}{text}        tm4{col 13}{c |}{result}{space 2}-.0002818{col 26}{space 1} .0016348{col 38}  -0.17{col 46}{space 3}-.0047348{col 58}{space 3} .0041711
{col 1}{text}        tm3{col 13}{c |}{result}{space 2}-.0002436{col 26}{space 1} .0014805{col 38}  -0.16{col 46}{space 3}-.0042763{col 58}{space 3} .0037891
{col 1}{text}        tm2{col 13}{c |}{result}{space 2} .0008141{col 26}{space 1}  .001526{col 38}   0.53{col 46}{space 3}-.0033424{col 58}{space 3} .0049706
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0029246{col 26}{space 1} .0013721{col 38}  -2.13{col 46}{space 3}-.0066621{col 58}{space 3} .0008129
{col 1}{text}        tp1{col 13}{c |}{result}{space 2} -.000987{col 26}{space 1} .0013846{col 38}  -0.71{col 46}{space 3}-.0047584{col 58}{space 3} .0027844
{col 1}{text}        tp2{col 13}{c |}{result}{space 2} .0005373{col 26}{space 1} .0016081{col 38}   0.33{col 46}{space 3}-.0038427{col 58}{space 3} .0049174
{col 1}{text}        tp3{col 13}{c |}{result}{space 2} .0005772{col 26}{space 1} .0016236{col 38}   0.36{col 46}{space 3}-.0038452{col 58}{space 3} .0049995
{col 1}{text}        tp4{col 13}{c |}{result}{space 2} -.001129{col 26}{space 1} .0018177{col 38}  -0.62{col 46}{space 3}-.0060801{col 58}{space 3}  .003822
{col 1}{text}        tp5{col 13}{c |}{result}{space 2} .0010006{col 26}{space 1} .0018641{col 38}   0.54{col 46}{space 3}-.0040769{col 58}{space 3} .0060781
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} .0034154{col 26}{space 1}  .001838{col 38}   1.86{col 46}{space 3} -.001591{col 58}{space 3} .0084218
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}  .004757{col 26}{space 1}  .002111{col 38}   2.25{col 46}{space 3} -.000993{col 58}{space 3}  .010507
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}  .007387{col 26}{space 1}   .00228{col 38}   3.24{col 46}{space 3} .0011767{col 58}{space 3} .0135972
{col 1}{text}        tp9{col 13}{c |}{result}{space 2} .0099216{col 26}{space 1} .0031738{col 38}   3.13{col 46}{space 3} .0012768{col 58}{space 3} .0185665
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} .0063394{col 26}{space 1} .0031762{col 38}   2.00{col 46}{space 3}-.0023119{col 58}{space 3} .0149907
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} .0030446{col 26}{space 1} .0040614{col 38}   0.75{col 46}{space 3} -.008018{col 58}{space 3} .0141072
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{err}Running event study for pila_independientes
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} -.164797{col 26}{space 2} .0061877{col 37}{space 1}  -26.63{col 46}{space 3}0.000{col 54}{space 4}-.1769247{col 67}{space 3}-.1526692
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} .1237188{col 26}{space 2}   .00592{col 37}{space 1}   20.90{col 46}{space 3}0.000{col 54}{space 4} .1121158{col 67}{space 3} .1353218
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.2442914{col 26}{space 2} .0136809{col 37}{space 1}  -17.86{col 46}{space 3}0.000{col 54}{space 4}-.2711055{col 67}{space 3}-.2174773
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2}-.2375506{col 26}{space 2} .0103009{col 37}{space 1}  -23.06{col 46}{space 3}0.000{col 54}{space 4}-.2577399{col 67}{space 3}-.2173613
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2}-.2018043{col 26}{space 2} .0084908{col 37}{space 1}  -23.77{col 46}{space 3}0.000{col 54}{space 4} -.218446{col 67}{space 3}-.1851627
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2}-.1692026{col 26}{space 2} .0076114{col 37}{space 1}  -22.23{col 46}{space 3}0.000{col 54}{space 4}-.1841207{col 67}{space 3}-.1542845
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2}-.1361698{col 26}{space 2} .0067895{col 37}{space 1}  -20.06{col 46}{space 3}0.000{col 54}{space 4}-.1494769{col 67}{space 3}-.1228627
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2}-.1038474{col 26}{space 2} .0060499{col 37}{space 1}  -17.17{col 46}{space 3}0.000{col 54}{space 4} -.115705{col 67}{space 3}-.0919898
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0607126{col 26}{space 2} .0047749{col 37}{space 1}  -12.71{col 46}{space 3}0.000{col 54}{space 4}-.0700712{col 67}{space 3}-.0513539
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0723029{col 26}{space 2} .0046844{col 37}{space 1}  -15.43{col 46}{space 3}0.000{col 54}{space 4}-.0814841{col 67}{space 3}-.0631216
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.2563878{col 26}{space 2} .0058291{col 37}{space 1}  -43.98{col 46}{space 3}0.000{col 54}{space 4}-.2678127{col 67}{space 3} -.244963
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.1682536{col 26}{space 2} .0062532{col 37}{space 1}  -26.91{col 46}{space 3}0.000{col 54}{space 4}-.1805097{col 67}{space 3}-.1559975
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2} .1343236{col 26}{space 2} .0066683{col 37}{space 1}   20.14{col 46}{space 3}0.000{col 54}{space 4}  .121254{col 67}{space 3} .1473932
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2} .2810334{col 26}{space 2} .0062508{col 37}{space 1}   44.96{col 46}{space 3}0.000{col 54}{space 4} .2687821{col 67}{space 3} .2932847
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2} .2660769{col 26}{space 2} .0063254{col 37}{space 1}   42.06{col 46}{space 3}0.000{col 54}{space 4} .2536792{col 67}{space 3} .2784745
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} .2540242{col 26}{space 2} .0068852{col 37}{space 1}   36.89{col 46}{space 3}0.000{col 54}{space 4} .2405294{col 67}{space 3} .2675189
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2} .2358256{col 26}{space 2} .0075952{col 37}{space 1}   31.05{col 46}{space 3}0.000{col 54}{space 4} .2209392{col 67}{space 3}  .250712
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2} .2207355{col 26}{space 2} .0088339{col 37}{space 1}   24.99{col 46}{space 3}0.000{col 54}{space 4} .2034213{col 67}{space 3} .2380496
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2} .1994371{col 26}{space 2} .0102351{col 37}{space 1}   19.49{col 46}{space 3}0.000{col 54}{space 4} .1793766{col 67}{space 3} .2194975
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} .1897026{col 26}{space 2}  .012697{col 37}{space 1}   14.94{col 46}{space 3}0.000{col 54}{space 4} .1648168{col 67}{space 3} .2145883
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} .2004115{col 26}{space 2}  .017474{col 37}{space 1}   11.47{col 46}{space 3}0.000{col 54}{space 4}  .166163{col 67}{space 3} .2346599
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} -.164797{col 26}{space 1} .0063748{col 38} -25.85{col 46}{space 3}-.1816572{col 58}{space 3}-.1479367
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} .1237188{col 26}{space 1} .0061476{col 38}  20.12{col 46}{space 3} .1074596{col 58}{space 3}  .139978
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.2442914{col 26}{space 1} .0129675{col 38} -18.84{col 46}{space 3}-.2785882{col 58}{space 3}-.2099946
{col 1}{text}        tm7{col 13}{c |}{result}{space 2}-.2375506{col 26}{space 1} .0103792{col 38} -22.89{col 46}{space 3}-.2650019{col 58}{space 3}-.2100993
{col 1}{text}        tm6{col 13}{c |}{result}{space 2}-.2018043{col 26}{space 1} .0081747{col 38} -24.69{col 46}{space 3}-.2234249{col 58}{space 3}-.1801838
{col 1}{text}        tm5{col 13}{c |}{result}{space 2}-.1692026{col 26}{space 1}  .007738{col 38} -21.87{col 46}{space 3}-.1896682{col 58}{space 3}-.1487371
{col 1}{text}        tm4{col 13}{c |}{result}{space 2}-.1361698{col 26}{space 1} .0069073{col 38} -19.71{col 46}{space 3}-.1544383{col 58}{space 3}-.1179013
{col 1}{text}        tm3{col 13}{c |}{result}{space 2}-.1038474{col 26}{space 1} .0057886{col 38} -17.94{col 46}{space 3}-.1191571{col 58}{space 3}-.0885376
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0607126{col 26}{space 1} .0048106{col 38} -12.62{col 46}{space 3}-.0734357{col 58}{space 3}-.0479894
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0723029{col 26}{space 1} .0046778{col 38} -15.46{col 46}{space 3}-.0846748{col 58}{space 3}-.0599309
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.2563878{col 26}{space 1} .0061167{col 38} -41.92{col 46}{space 3}-.2725655{col 58}{space 3}-.2402101
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.1682536{col 26}{space 1} .0061542{col 38} -27.34{col 46}{space 3}-.1845304{col 58}{space 3}-.1519768
{col 1}{text}        tp3{col 13}{c |}{result}{space 2} .1343236{col 26}{space 1} .0070681{col 38}  19.00{col 46}{space 3} .1156298{col 58}{space 3} .1530174
{col 1}{text}        tp4{col 13}{c |}{result}{space 2} .2810334{col 26}{space 1} .0063461{col 38}  44.28{col 46}{space 3}  .264249{col 58}{space 3} .2978178
{col 1}{text}        tp5{col 13}{c |}{result}{space 2} .2660769{col 26}{space 1} .0065031{col 38}  40.92{col 46}{space 3} .2488772{col 58}{space 3} .2832765
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} .2540242{col 26}{space 1} .0064296{col 38}  39.51{col 46}{space 3} .2370191{col 58}{space 3} .2710292
{col 1}{text}        tp7{col 13}{c |}{result}{space 2} .2358256{col 26}{space 1} .0077791{col 38}  30.32{col 46}{space 3} .2152514{col 58}{space 3} .2563998
{col 1}{text}        tp8{col 13}{c |}{result}{space 2} .2207355{col 26}{space 1} .0087819{col 38}  25.14{col 46}{space 3}  .197509{col 58}{space 3}  .243962
{col 1}{text}        tp9{col 13}{c |}{result}{space 2} .1994371{col 26}{space 1} .0096849{col 38}  20.59{col 46}{space 3} .1738221{col 58}{space 3}  .225052
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} .1897026{col 26}{space 1} .0130132{col 38}  14.58{col 46}{space 3}  .155285{col 58}{space 3} .2241202
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} .2004115{col 26}{space 1} .0190062{col 38}  10.54{col 46}{space 3} .1501436{col 58}{space 3} .2506794
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2}-.1628752{col 26}{space 2} .0062171{col 37}{space 1}  -26.20{col 46}{space 3}0.000{col 54}{space 4}-.1750604{col 67}{space 3}  -.15069
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} .1621578{col 26}{space 2} .0060312{col 37}{space 1}   26.89{col 46}{space 3}0.000{col 54}{space 4} .1503369{col 67}{space 3} .1739787
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.2418992{col 26}{space 2} .0137153{col 37}{space 1}  -17.64{col 46}{space 3}0.000{col 54}{space 4}-.2687806{col 67}{space 3}-.2150178
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2}-.2353779{col 26}{space 2}  .010338{col 37}{space 1}  -22.77{col 46}{space 3}0.000{col 54}{space 4}-.2556401{col 67}{space 3}-.2151157
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2}-.1995738{col 26}{space 2} .0085251{col 37}{space 1}  -23.41{col 46}{space 3}0.000{col 54}{space 4}-.2162828{col 67}{space 3}-.1828648
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2}-.1672535{col 26}{space 2} .0076442{col 37}{space 1}  -21.88{col 46}{space 3}0.000{col 54}{space 4}-.1822359{col 67}{space 3}-.1522712
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} -.133768{col 26}{space 2} .0068148{col 37}{space 1}  -19.63{col 46}{space 3}0.000{col 54}{space 4}-.1471247{col 67}{space 3}-.1204112
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2}-.1022875{col 26}{space 2}  .006064{col 37}{space 1}  -16.87{col 46}{space 3}0.000{col 54}{space 4}-.1141727{col 67}{space 3}-.0904023
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0599664{col 26}{space 2} .0047808{col 37}{space 1}  -12.54{col 46}{space 3}0.000{col 54}{space 4}-.0693366{col 67}{space 3}-.0505961
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0719329{col 26}{space 2} .0046912{col 37}{space 1}  -15.33{col 46}{space 3}0.000{col 54}{space 4}-.0811276{col 67}{space 3}-.0627383
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.2544404{col 26}{space 2} .0058477{col 37}{space 1}  -43.51{col 46}{space 3}0.000{col 54}{space 4}-.2659018{col 67}{space 3}-.2429791
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.1623635{col 26}{space 2} .0062865{col 37}{space 1}  -25.83{col 46}{space 3}0.000{col 54}{space 4}-.1746848{col 67}{space 3}-.1500423
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2} .1452951{col 26}{space 2} .0067093{col 37}{space 1}   21.66{col 46}{space 3}0.000{col 54}{space 4} .1321451{col 67}{space 3}  .158445
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2} .2987319{col 26}{space 2} .0062999{col 37}{space 1}   47.42{col 46}{space 3}0.000{col 54}{space 4} .2863843{col 67}{space 3} .3110795
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2} .2911922{col 26}{space 2} .0063873{col 37}{space 1}   45.59{col 46}{space 3}0.000{col 54}{space 4} .2786734{col 67}{space 3} .3037111
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} .2889271{col 26}{space 2} .0069832{col 37}{space 1}   41.37{col 46}{space 3}0.000{col 54}{space 4} .2752403{col 67}{space 3}  .302614
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2} .2822509{col 26}{space 2} .0077168{col 37}{space 1}   36.58{col 46}{space 3}0.000{col 54}{space 4} .2671263{col 67}{space 3} .2973755
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2} .2840875{col 26}{space 2} .0089816{col 37}{space 1}   31.63{col 46}{space 3}0.000{col 54}{space 4} .2664839{col 67}{space 3} .3016911
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2} .2762963{col 26}{space 2} .0104192{col 37}{space 1}   26.52{col 46}{space 3}0.000{col 54}{space 4} .2558749{col 67}{space 3} .2967176
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} .2754579{col 26}{space 2}  .012907{col 37}{space 1}   21.34{col 46}{space 3}0.000{col 54}{space 4} .2501606{col 67}{space 3} .3007552
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} .2923915{col 26}{space 2} .0177273{col 37}{space 1}   16.49{col 46}{space 3}0.000{col 54}{space 4} .2576466{col 67}{space 3} .3271363
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2}-.1628752{col 26}{space 1}  .005909{col 38} -27.56{col 46}{space 3}-.1782123{col 58}{space 3} -.147538
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} .1621578{col 26}{space 1} .0065401{col 38}  24.79{col 46}{space 3} .1451825{col 58}{space 3} .1791331
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.2418992{col 26}{space 1} .0144204{col 38} -16.77{col 46}{space 3}-.2793284{col 58}{space 3}-.2044701
{col 1}{text}        tm7{col 13}{c |}{result}{space 2}-.2353779{col 26}{space 1} .0104227{col 38} -22.58{col 46}{space 3}-.2624307{col 58}{space 3}-.2083251
{col 1}{text}        tm6{col 13}{c |}{result}{space 2}-.1995738{col 26}{space 1} .0086311{col 38} -23.12{col 46}{space 3}-.2219762{col 58}{space 3}-.1771714
{col 1}{text}        tm5{col 13}{c |}{result}{space 2}-.1672535{col 26}{space 1}  .007807{col 38} -21.42{col 46}{space 3}-.1875169{col 58}{space 3}-.1469901
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} -.133768{col 26}{space 1} .0067509{col 38} -19.81{col 46}{space 3}-.1512905{col 58}{space 3}-.1162455
{col 1}{text}        tm3{col 13}{c |}{result}{space 2}-.1022875{col 26}{space 1} .0064295{col 38} -15.91{col 46}{space 3}-.1189757{col 58}{space 3}-.0855993
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0599664{col 26}{space 1} .0048725{col 38} -12.31{col 46}{space 3}-.0726132{col 58}{space 3}-.0473196
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0719329{col 26}{space 1} .0048771{col 38} -14.75{col 46}{space 3}-.0845916{col 58}{space 3}-.0592742
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.2544404{col 26}{space 1} .0057196{col 38} -44.49{col 46}{space 3}-.2692861{col 58}{space 3}-.2395948
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.1623635{col 26}{space 1} .0064362{col 38} -25.23{col 46}{space 3}-.1790691{col 58}{space 3}-.1456579
{col 1}{text}        tp3{col 13}{c |}{result}{space 2} .1452951{col 26}{space 1} .0068136{col 38}  21.32{col 46}{space 3} .1276099{col 58}{space 3} .1629802
{col 1}{text}        tp4{col 13}{c |}{result}{space 2} .2987319{col 26}{space 1} .0060014{col 38}  49.78{col 46}{space 3}  .283155{col 58}{space 3} .3143088
{col 1}{text}        tp5{col 13}{c |}{result}{space 2} .2911922{col 26}{space 1} .0062361{col 38}  46.69{col 46}{space 3} .2750061{col 58}{space 3} .3073784
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} .2889271{col 26}{space 1} .0069401{col 38}  41.63{col 46}{space 3} .2709137{col 58}{space 3} .3069405
{col 1}{text}        tp7{col 13}{c |}{result}{space 2} .2822509{col 26}{space 1} .0075651{col 38}  37.31{col 46}{space 3} .2626151{col 58}{space 3} .3018867
{col 1}{text}        tp8{col 13}{c |}{result}{space 2} .2840875{col 26}{space 1} .0090753{col 38}  31.30{col 46}{space 3} .2605319{col 58}{space 3} .3076431
{col 1}{text}        tp9{col 13}{c |}{result}{space 2} .2762963{col 26}{space 1} .0107884{col 38}  25.61{col 46}{space 3} .2482944{col 58}{space 3} .3042982
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} .2754579{col 26}{space 1} .0128399{col 38}  21.45{col 46}{space 3} .2421313{col 58}{space 3} .3087846
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} .2923915{col 26}{space 1} .0194288{col 38}  15.05{col 46}{space 3} .2419629{col 58}{space 3}   .34282
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{err}Running event study for p_cotizaciones
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2}-.1752863{col 26}{space 2} .0062293{col 37}{space 1}  -28.14{col 46}{space 3}0.000{col 54}{space 4}-.1874955{col 67}{space 3}-.1630772
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} .0538241{col 26}{space 2} .0060431{col 37}{space 1}    8.91{col 46}{space 3}0.000{col 54}{space 4} .0419799{col 67}{space 3} .0656684
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.2326053{col 26}{space 2} .0133128{col 37}{space 1}  -17.47{col 46}{space 3}0.000{col 54}{space 4}-.2586979{col 67}{space 3}-.2065127
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2}-.2377262{col 26}{space 2} .0098086{col 37}{space 1}  -24.24{col 46}{space 3}0.000{col 54}{space 4}-.2569507{col 67}{space 3}-.2185018
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2}-.2210694{col 26}{space 2} .0080194{col 37}{space 1}  -27.57{col 46}{space 3}0.000{col 54}{space 4}-.2367872{col 67}{space 3}-.2053516
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2}-.2020611{col 26}{space 2} .0073122{col 37}{space 1}  -27.63{col 46}{space 3}0.000{col 54}{space 4}-.2163929{col 67}{space 3}-.1877294
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2}-.1631894{col 26}{space 2} .0067439{col 37}{space 1}  -24.20{col 46}{space 3}0.000{col 54}{space 4}-.1764072{col 67}{space 3}-.1499716
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2}-.1127749{col 26}{space 2} .0063102{col 37}{space 1}  -17.87{col 46}{space 3}0.000{col 54}{space 4}-.1251426{col 67}{space 3}-.1004072
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2} -.057578{col 26}{space 2} .0056153{col 37}{space 1}  -10.25{col 46}{space 3}0.000{col 54}{space 4}-.0685837{col 67}{space 3}-.0465722
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2} -.006972{col 26}{space 2} .0059175{col 37}{space 1}   -1.18{col 46}{space 3}0.239{col 54}{space 4}-.0185701{col 67}{space 3}  .004626
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.1543997{col 26}{space 2} .0062091{col 37}{space 1}  -24.87{col 46}{space 3}0.000{col 54}{space 4}-.1665693{col 67}{space 3}  -.14223
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2} -.072598{col 26}{space 2} .0065256{col 37}{space 1}  -11.13{col 46}{space 3}0.000{col 54}{space 4} -.085388{col 67}{space 3} -.059808
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2} .1466898{col 26}{space 2} .0065682{col 37}{space 1}   22.33{col 46}{space 3}0.000{col 54}{space 4} .1338164{col 67}{space 3} .1595633
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2} .1894697{col 26}{space 2} .0064772{col 37}{space 1}   29.25{col 46}{space 3}0.000{col 54}{space 4} .1767746{col 67}{space 3} .2021649
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2} .1419429{col 26}{space 2} .0066411{col 37}{space 1}   21.37{col 46}{space 3}0.000{col 54}{space 4} .1289266{col 67}{space 3} .1549592
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} .1203392{col 26}{space 2} .0072659{col 37}{space 1}   16.56{col 46}{space 3}0.000{col 54}{space 4} .1060982{col 67}{space 3} .1345802
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2} .0944869{col 26}{space 2} .0079919{col 37}{space 1}   11.82{col 46}{space 3}0.000{col 54}{space 4}  .078823{col 67}{space 3} .1101507
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2} .0767254{col 26}{space 2}  .009288{col 37}{space 1}    8.26{col 46}{space 3}0.000{col 54}{space 4} .0585213{col 67}{space 3} .0949294
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2} .0417949{col 26}{space 2} .0108224{col 37}{space 1}    3.86{col 46}{space 3}0.000{col 54}{space 4} .0205834{col 67}{space 3} .0630064
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} .0173667{col 26}{space 2} .0137091{col 37}{space 1}    1.27{col 46}{space 3}0.205{col 54}{space 4}-.0095026{col 67}{space 3} .0442361
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} .0510437{col 26}{space 2} .0183383{col 37}{space 1}    2.78{col 46}{space 3}0.005{col 54}{space 4} .0151012{col 67}{space 3} .0869862
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2}-.1752863{col 26}{space 1} .0060789{col 38} -28.84{col 46}{space 3}-.1917391{col 58}{space 3}-.1588335
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} .0538241{col 26}{space 1} .0060003{col 38}   8.97{col 46}{space 3} .0375843{col 58}{space 3}  .070064
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.2326053{col 26}{space 1} .0136931{col 38} -16.99{col 46}{space 3} -.269666{col 58}{space 3}-.1955445
{col 1}{text}        tm7{col 13}{c |}{result}{space 2}-.2377262{col 26}{space 1} .0102018{col 38} -23.30{col 46}{space 3}-.2653377{col 58}{space 3}-.2101148
{col 1}{text}        tm6{col 13}{c |}{result}{space 2}-.2210694{col 26}{space 1} .0079867{col 38} -27.68{col 46}{space 3}-.2426856{col 58}{space 3}-.1994532
{col 1}{text}        tm5{col 13}{c |}{result}{space 2}-.2020611{col 26}{space 1} .0072027{col 38} -28.05{col 46}{space 3}-.2215554{col 58}{space 3}-.1825669
{col 1}{text}        tm4{col 13}{c |}{result}{space 2}-.1631894{col 26}{space 1} .0069171{col 38} -23.59{col 46}{space 3}-.1819107{col 58}{space 3} -.144468
{col 1}{text}        tm3{col 13}{c |}{result}{space 2}-.1127749{col 26}{space 1} .0065031{col 38} -17.34{col 46}{space 3}-.1303756{col 58}{space 3}-.0951742
{col 1}{text}        tm2{col 13}{c |}{result}{space 2} -.057578{col 26}{space 1} .0055921{col 38} -10.30{col 46}{space 3} -.072713{col 58}{space 3}-.0424429
{col 1}{text}        tp0{col 13}{c |}{result}{space 2} -.006972{col 26}{space 1} .0057808{col 38}  -1.21{col 46}{space 3} -.022618{col 58}{space 3} .0086739
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.1543997{col 26}{space 1} .0061324{col 38} -25.18{col 46}{space 3}-.1709971{col 58}{space 3}-.1378022
{col 1}{text}        tp2{col 13}{c |}{result}{space 2} -.072598{col 26}{space 1} .0065878{col 38} -11.02{col 46}{space 3}-.0904281{col 58}{space 3}-.0547679
{col 1}{text}        tp3{col 13}{c |}{result}{space 2} .1466898{col 26}{space 1} .0061715{col 38}  23.77{col 46}{space 3} .1299865{col 58}{space 3} .1633932
{col 1}{text}        tp4{col 13}{c |}{result}{space 2} .1894697{col 26}{space 1} .0067507{col 38}  28.07{col 46}{space 3} .1711989{col 58}{space 3} .2077406
{col 1}{text}        tp5{col 13}{c |}{result}{space 2} .1419429{col 26}{space 1}  .006509{col 38}  21.81{col 46}{space 3} .1243262{col 58}{space 3} .1595596
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} .1203392{col 26}{space 1} .0072134{col 38}  16.68{col 46}{space 3} .1008161{col 58}{space 3} .1398623
{col 1}{text}        tp7{col 13}{c |}{result}{space 2} .0944869{col 26}{space 1} .0080672{col 38}  11.71{col 46}{space 3} .0726527{col 58}{space 3}  .116321
{col 1}{text}        tp8{col 13}{c |}{result}{space 2} .0767254{col 26}{space 1} .0094727{col 38}   8.10{col 46}{space 3} .0510874{col 58}{space 3} .1023634
{col 1}{text}        tp9{col 13}{c |}{result}{space 2} .0417949{col 26}{space 1} .0104615{col 38}   4.00{col 46}{space 3} .0134808{col 58}{space 3} .0701091
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} .0173667{col 26}{space 1} .0142652{col 38}   1.22{col 46}{space 3}-.0212424{col 58}{space 3} .0559759
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} .0510437{col 26}{space 1} .0184191{col 38}   2.77{col 46}{space 3}  .001192{col 58}{space 3} .1008954
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2}-.1762207{col 26}{space 2} .0062364{col 37}{space 1}  -28.26{col 46}{space 3}0.000{col 54}{space 4}-.1884438{col 67}{space 3}-.1639976
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} .1177733{col 26}{space 2} .0060712{col 37}{space 1}   19.40{col 46}{space 3}0.000{col 54}{space 4}  .105874{col 67}{space 3} .1296726
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.2355225{col 26}{space 2}  .013313{col 37}{space 1}  -17.69{col 46}{space 3}0.000{col 54}{space 4}-.2616156{col 67}{space 3}-.2094295
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2}-.2404111{col 26}{space 2} .0098169{col 37}{space 1}  -24.49{col 46}{space 3}0.000{col 54}{space 4}-.2596519{col 67}{space 3}-.2211702
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2}-.2216565{col 26}{space 2} .0080311{col 37}{space 1}  -27.60{col 46}{space 3}0.000{col 54}{space 4}-.2373972{col 67}{space 3}-.2059158
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2}-.2023202{col 26}{space 2} .0073266{col 37}{space 1}  -27.61{col 46}{space 3}0.000{col 54}{space 4}-.2166801{col 67}{space 3}-.1879603
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2}-.1626545{col 26}{space 2} .0067571{col 37}{space 1}  -24.07{col 46}{space 3}0.000{col 54}{space 4}-.1758982{col 67}{space 3}-.1494108
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2}-.1129188{col 26}{space 2} .0063146{col 37}{space 1}  -17.88{col 46}{space 3}0.000{col 54}{space 4}-.1252952{col 67}{space 3}-.1005423
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0580616{col 26}{space 2} .0056186{col 37}{space 1}  -10.33{col 46}{space 3}0.000{col 54}{space 4}-.0690738{col 67}{space 3}-.0470495
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0047734{col 26}{space 2} .0059241{col 37}{space 1}   -0.81{col 46}{space 3}0.420{col 54}{space 4}-.0163843{col 67}{space 3} .0068376
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.1477093{col 26}{space 2} .0062171{col 37}{space 1}  -23.76{col 46}{space 3}0.000{col 54}{space 4}-.1598945{col 67}{space 3} -.135524
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2} -.057689{col 26}{space 2} .0065412{col 37}{space 1}   -8.82{col 46}{space 3}0.000{col 54}{space 4}-.0705096{col 67}{space 3}-.0448685
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2} .1715598{col 26}{space 2} .0065699{col 37}{space 1}   26.11{col 46}{space 3}0.000{col 54}{space 4} .1586831{col 67}{space 3} .1844366
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2} .2269158{col 26}{space 2} .0064656{col 37}{space 1}   35.10{col 46}{space 3}0.000{col 54}{space 4} .2142433{col 67}{space 3} .2395882
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}  .189984{col 26}{space 2} .0066416{col 37}{space 1}   28.61{col 46}{space 3}0.000{col 54}{space 4} .1769667{col 67}{space 3} .2030012
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} .1838685{col 26}{space 2} .0072793{col 37}{space 1}   25.26{col 46}{space 3}0.000{col 54}{space 4} .1696013{col 67}{space 3} .1981357
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2} .1746167{col 26}{space 2} .0080135{col 37}{space 1}   21.79{col 46}{space 3}0.000{col 54}{space 4} .1589105{col 67}{space 3} .1903229
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2} .1803708{col 26}{space 2} .0093141{col 37}{space 1}   19.37{col 46}{space 3}0.000{col 54}{space 4} .1621155{col 67}{space 3} .1986261
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}   .16207{col 26}{space 2}  .010865{col 37}{space 1}   14.92{col 46}{space 3}0.000{col 54}{space 4} .1407749{col 67}{space 3} .1833651
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} .1499129{col 26}{space 2} .0137212{col 37}{space 1}   10.93{col 46}{space 3}0.000{col 54}{space 4}   .12302{col 67}{space 3} .1768059
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} .1841529{col 26}{space 2} .0183791{col 37}{space 1}   10.02{col 46}{space 3}0.000{col 54}{space 4} .1481306{col 67}{space 3} .2201753
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2}-.1762207{col 26}{space 1} .0062502{col 38} -28.19{col 46}{space 3}-.1938168{col 58}{space 3}-.1586247
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} .1177733{col 26}{space 1} .0058571{col 38}  20.11{col 46}{space 3} .1012839{col 58}{space 3} .1342628
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.2355225{col 26}{space 1}  .013079{col 38} -18.01{col 46}{space 3}-.2723435{col 58}{space 3}-.1987015
{col 1}{text}        tm7{col 13}{c |}{result}{space 2}-.2404111{col 26}{space 1} .0100182{col 38} -24.00{col 46}{space 3}-.2686152{col 58}{space 3}-.2122069
{col 1}{text}        tm6{col 13}{c |}{result}{space 2}-.2216565{col 26}{space 1} .0080993{col 38} -27.37{col 46}{space 3}-.2444582{col 58}{space 3}-.1988548
{col 1}{text}        tm5{col 13}{c |}{result}{space 2}-.2023202{col 26}{space 1} .0073338{col 38} -27.59{col 46}{space 3}-.2229668{col 58}{space 3}-.1816736
{col 1}{text}        tm4{col 13}{c |}{result}{space 2}-.1626545{col 26}{space 1} .0067314{col 38} -24.16{col 46}{space 3}-.1816053{col 58}{space 3}-.1437037
{col 1}{text}        tm3{col 13}{c |}{result}{space 2}-.1129188{col 26}{space 1} .0058551{col 38} -19.29{col 46}{space 3}-.1294024{col 58}{space 3}-.0964351
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0580616{col 26}{space 1} .0055986{col 38} -10.37{col 46}{space 3}-.0738233{col 58}{space 3}   -.0423
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0047734{col 26}{space 1} .0060061{col 38}  -0.79{col 46}{space 3}-.0216821{col 58}{space 3} .0121354
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.1477093{col 26}{space 1} .0059512{col 38} -24.82{col 46}{space 3}-.1644635{col 58}{space 3} -.130955
{col 1}{text}        tp2{col 13}{c |}{result}{space 2} -.057689{col 26}{space 1} .0062649{col 38}  -9.21{col 46}{space 3}-.0753266{col 58}{space 3}-.0400515
{col 1}{text}        tp3{col 13}{c |}{result}{space 2} .1715598{col 26}{space 1} .0062884{col 38}  27.28{col 46}{space 3} .1538563{col 58}{space 3} .1892634
{col 1}{text}        tp4{col 13}{c |}{result}{space 2} .2269158{col 26}{space 1}  .006177{col 38}  36.74{col 46}{space 3} .2095257{col 58}{space 3} .2443058
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}  .189984{col 26}{space 1} .0069119{col 38}  27.49{col 46}{space 3} .1705251{col 58}{space 3} .2094428
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} .1838685{col 26}{space 1} .0072555{col 38}  25.34{col 46}{space 3} .1634421{col 58}{space 3} .2042949
{col 1}{text}        tp7{col 13}{c |}{result}{space 2} .1746167{col 26}{space 1} .0080162{col 38}  21.78{col 46}{space 3} .1520488{col 58}{space 3} .1971847
{col 1}{text}        tp8{col 13}{c |}{result}{space 2} .1803708{col 26}{space 1}  .008982{col 38}  20.08{col 46}{space 3} .1550841{col 58}{space 3} .2056575
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}   .16207{col 26}{space 1} .0104999{col 38}  15.44{col 46}{space 3} .1325098{col 58}{space 3} .1916302
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} .1499129{col 26}{space 1} .0139063{col 38}  10.78{col 46}{space 3} .1107628{col 58}{space 3} .1890631
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} .1841529{col 26}{space 1} .0190178{col 38}   9.68{col 46}{space 3} .1306126{col 58}{space 3} .2376933
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{err}Running event study for pila_salario_r
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} -1328311{col 26}{space 2} 29455.05{col 37}{space 1}  -45.10{col 46}{space 3}0.000{col 54}{space 4} -1386042{col 67}{space 3} -1270581
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}  4468471{col 26}{space 2} 75015.15{col 37}{space 1}   59.57{col 46}{space 3}0.000{col 54}{space 4}  4321444{col 67}{space 3}  4615498
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2} -1775117{col 26}{space 2} 64314.71{col 37}{space 1}  -27.60{col 46}{space 3}0.000{col 54}{space 4} -1901172{col 67}{space 3} -1649063
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} -1856225{col 26}{space 2} 49038.12{col 37}{space 1}  -37.85{col 46}{space 3}0.000{col 54}{space 4} -1952338{col 67}{space 3} -1760112
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} -1693934{col 26}{space 2} 39670.91{col 37}{space 1}  -42.70{col 46}{space 3}0.000{col 54}{space 4} -1771688{col 67}{space 3} -1616181
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} -1538958{col 26}{space 2} 34408.74{col 37}{space 1}  -44.73{col 46}{space 3}0.000{col 54}{space 4} -1606398{col 67}{space 3} -1471518
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} -1223860{col 26}{space 2} 31808.05{col 37}{space 1}  -38.48{col 46}{space 3}0.000{col 54}{space 4} -1286203{col 67}{space 3} -1161518
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2}-839601.4{col 26}{space 2} 28877.17{col 37}{space 1}  -29.07{col 46}{space 3}0.000{col 54}{space 4}-896199.6{col 67}{space 3}-783003.2
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-370483.4{col 26}{space 2}    21871{col 37}{space 1}  -16.94{col 46}{space 3}0.000{col 54}{space 4}-413349.8{col 67}{space 3}-327617.1
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2} -2073969{col 26}{space 2} 25008.55{col 37}{space 1}  -82.93{col 46}{space 3}0.000{col 54}{space 4} -2122985{col 67}{space 3} -2024953
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2} -2952802{col 26}{space 2} 30689.75{col 37}{space 1}  -96.21{col 46}{space 3}0.000{col 54}{space 4} -3012952{col 67}{space 3} -2892651
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2} -2542509{col 26}{space 2} 39122.52{col 37}{space 1}  -64.99{col 46}{space 3}0.000{col 54}{space 4} -2619188{col 67}{space 3} -2465831
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-92756.18{col 26}{space 2}    60078{col 37}{space 1}   -1.54{col 46}{space 3}0.123{col 54}{space 4}-210506.9{col 67}{space 3} 24994.53
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}  4309381{col 26}{space 2} 75180.39{col 37}{space 1}   57.32{col 46}{space 3}0.000{col 54}{space 4}  4162030{col 67}{space 3}  4456731
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}  6262988{col 26}{space 2} 79885.82{col 37}{space 1}   78.40{col 46}{space 3}0.000{col 54}{space 4}  6106415{col 67}{space 3}  6419561
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}  6982175{col 26}{space 2} 95260.97{col 37}{space 1}   73.30{col 46}{space 3}0.000{col 54}{space 4}  6795467{col 67}{space 3}  7168883
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}  7504345{col 26}{space 2} 115071.4{col 37}{space 1}   65.21{col 46}{space 3}0.000{col 54}{space 4}  7278810{col 67}{space 3}  7729881
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}  8085319{col 26}{space 2} 140474.9{col 37}{space 1}   57.56{col 46}{space 3}0.000{col 54}{space 4}  7809993{col 67}{space 3}  8360645
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}  8538850{col 26}{space 2} 169520.9{col 37}{space 1}   50.37{col 46}{space 3}0.000{col 54}{space 4}  8206595{col 67}{space 3}  8871105
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2}  9523219{col 26}{space 2} 235049.2{col 37}{space 1}   40.52{col 46}{space 3}0.000{col 54}{space 4}  9062531{col 67}{space 3}  9983907
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} 1.01e+07{col 26}{space 2} 338445.6{col 37}{space 1}   29.78{col 46}{space 3}0.000{col 54}{space 4}  9414066{col 67}{space 3} 1.07e+07
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} -1328311{col 26}{space 1} 30865.23{col 38} -43.04{col 46}{space 3} -1411407{col 58}{space 3} -1245215
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2}  4468471{col 26}{space 1}  74845.4{col 38}  59.70{col 46}{space 3}  4266970{col 58}{space 3}  4669971
{col 1}{text}        tm8{col 13}{c |}{result}{space 2} -1775117{col 26}{space 1} 65467.68{col 38} -27.11{col 46}{space 3} -1951371{col 58}{space 3} -1598864
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} -1856225{col 26}{space 1} 53109.02{col 38} -34.95{col 46}{space 3} -1999206{col 58}{space 3} -1713244
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} -1693934{col 26}{space 1} 38832.16{col 38} -43.62{col 46}{space 3} -1798479{col 58}{space 3} -1589389
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} -1538958{col 26}{space 1} 34738.18{col 38} -44.30{col 46}{space 3} -1632481{col 58}{space 3} -1445435
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} -1223860{col 26}{space 1} 30626.78{col 38} -39.96{col 46}{space 3} -1306314{col 58}{space 3} -1141406
{col 1}{text}        tm3{col 13}{c |}{result}{space 2}-839601.4{col 26}{space 1} 27164.28{col 38} -30.91{col 46}{space 3}-912733.7{col 58}{space 3}-766469.1
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-370483.4{col 26}{space 1} 21569.13{col 38} -17.18{col 46}{space 3}-428552.3{col 58}{space 3}-312414.5
{col 1}{text}        tp0{col 13}{c |}{result}{space 2} -2073969{col 26}{space 1} 25675.84{col 38} -80.78{col 46}{space 3} -2143094{col 58}{space 3} -2004844
{col 1}{text}        tp1{col 13}{c |}{result}{space 2} -2952802{col 26}{space 1} 31289.82{col 38} -94.37{col 46}{space 3} -3037041{col 58}{space 3} -2868562
{col 1}{text}        tp2{col 13}{c |}{result}{space 2} -2542509{col 26}{space 1}  40823.9{col 38} -62.28{col 46}{space 3} -2652416{col 58}{space 3} -2432603
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-92756.18{col 26}{space 1} 59507.23{col 38}  -1.56{col 46}{space 3}-252962.9{col 58}{space 3} 67450.49
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}  4309381{col 26}{space 1} 73580.55{col 38}  58.57{col 46}{space 3}  4111285{col 58}{space 3}  4507476
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}  6262988{col 26}{space 1} 79092.64{col 38}  79.19{col 46}{space 3}  6050053{col 58}{space 3}  6475923
{col 1}{text}        tp6{col 13}{c |}{result}{space 2}  6982175{col 26}{space 1} 95584.08{col 38}  73.05{col 46}{space 3}  6724841{col 58}{space 3}  7239508
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}  7504345{col 26}{space 1} 110495.1{col 38}  67.92{col 46}{space 3}  7206868{col 58}{space 3}  7801823
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}  8085319{col 26}{space 1} 137257.2{col 38}  58.91{col 46}{space 3}  7715792{col 58}{space 3}  8454846
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}  8538850{col 26}{space 1} 169115.6{col 38}  50.49{col 46}{space 3}  8083553{col 58}{space 3}  8994147
{col 1}{text}       tp10{col 13}{c |}{result}{space 2}  9523219{col 26}{space 1} 236719.2{col 38}  40.23{col 46}{space 3}  8885918{col 58}{space 3} 1.02e+07
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} 1.01e+07{col 26}{space 1} 341133.6{col 38}  29.54{col 46}{space 3}  9159000{col 58}{space 3} 1.10e+07
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} -1229992{col 26}{space 2} 30038.96{col 37}{space 1}  -40.95{col 46}{space 3}0.000{col 54}{space 4} -1288868{col 67}{space 3} -1171117
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}  4679065{col 26}{space 2} 75732.11{col 37}{space 1}   61.78{col 46}{space 3}0.000{col 54}{space 4}  4530632{col 67}{space 3}  4827497
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2} -1682433{col 26}{space 2} 65045.56{col 37}{space 1}  -25.87{col 46}{space 3}0.000{col 54}{space 4} -1809920{col 67}{space 3} -1554946
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} -1736790{col 26}{space 2} 49784.51{col 37}{space 1}  -34.89{col 46}{space 3}0.000{col 54}{space 4} -1834365{col 67}{space 3} -1639214
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} -1568562{col 26}{space 2} 40174.83{col 37}{space 1}  -39.04{col 46}{space 3}0.000{col 54}{space 4} -1647303{col 67}{space 3} -1489821
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} -1416839{col 26}{space 2} 34971.06{col 37}{space 1}  -40.51{col 46}{space 3}0.000{col 54}{space 4} -1485381{col 67}{space 3} -1348297
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} -1109246{col 26}{space 2}  32265.6{col 37}{space 1}  -34.38{col 46}{space 3}0.000{col 54}{space 4} -1172486{col 67}{space 3} -1046007
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2}-764165.9{col 26}{space 2} 29060.93{col 37}{space 1}  -26.30{col 46}{space 3}0.000{col 54}{space 4}-821124.3{col 67}{space 3}-707207.6
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-331910.5{col 26}{space 2} 21919.19{col 37}{space 1}  -15.14{col 46}{space 3}0.000{col 54}{space 4}-374871.3{col 67}{space 3}-288949.7
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2} -2097694{col 26}{space 2}    25000{col 37}{space 1}  -83.91{col 46}{space 3}0.000{col 54}{space 4} -2146693{col 67}{space 3} -2048695
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2} -2993369{col 26}{space 2} 30700.17{col 37}{space 1}  -97.50{col 46}{space 3}0.000{col 54}{space 4} -3053540{col 67}{space 3} -2933198
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2} -2562216{col 26}{space 2} 39247.32{col 37}{space 1}  -65.28{col 46}{space 3}0.000{col 54}{space 4} -2639140{col 67}{space 3} -2485293
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-74892.87{col 26}{space 2}  60292.4{col 37}{space 1}   -1.24{col 46}{space 3}0.214{col 54}{space 4}-193063.8{col 67}{space 3} 43278.06
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}  4393675{col 26}{space 2} 75531.37{col 37}{space 1}   58.17{col 46}{space 3}0.000{col 54}{space 4}  4245636{col 67}{space 3}  4541714
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}  6415986{col 26}{space 2} 80292.28{col 37}{space 1}   79.91{col 46}{space 3}0.000{col 54}{space 4}  6258616{col 67}{space 3}  6573356
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}  7203215{col 26}{space 2}    95873{col 37}{space 1}   75.13{col 46}{space 3}0.000{col 54}{space 4}  7015308{col 67}{space 3}  7391123
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}  7787616{col 26}{space 2} 115792.9{col 37}{space 1}   67.25{col 46}{space 3}0.000{col 54}{space 4}  7560666{col 67}{space 3}  8014566
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}  8465130{col 26}{space 2} 141260.3{col 37}{space 1}   59.93{col 46}{space 3}0.000{col 54}{space 4}  8188265{col 67}{space 3}  8741995
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}  8990768{col 26}{space 2}   170551{col 37}{space 1}   52.72{col 46}{space 3}0.000{col 54}{space 4}  8656495{col 67}{space 3}  9325042
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} 1.00e+07{col 26}{space 2} 235745.1{col 37}{space 1}   42.46{col 46}{space 3}0.000{col 54}{space 4}  9547757{col 67}{space 3} 1.05e+07
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} 1.06e+07{col 26}{space 2} 339108.6{col 37}{space 1}   31.29{col 46}{space 3}0.000{col 54}{space 4}  9946107{col 67}{space 3} 1.13e+07
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} -1229992{col 26}{space 1} 29251.02{col 38} -42.05{col 46}{space 3} -1307935{col 58}{space 3} -1152050
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2}  4679065{col 26}{space 1} 74845.01{col 38}  62.52{col 46}{space 3}  4479631{col 58}{space 3}  4878498
{col 1}{text}        tm8{col 13}{c |}{result}{space 2} -1682433{col 26}{space 1} 65143.45{col 38} -25.83{col 46}{space 3} -1856015{col 58}{space 3} -1508850
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} -1736790{col 26}{space 1} 50542.54{col 38} -34.36{col 46}{space 3} -1871466{col 58}{space 3} -1602113
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} -1568562{col 26}{space 1} 40806.19{col 38} -38.44{col 46}{space 3} -1677295{col 58}{space 3} -1459829
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} -1416839{col 26}{space 1} 34357.04{col 38} -41.24{col 46}{space 3} -1508387{col 58}{space 3} -1325291
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} -1109246{col 26}{space 1} 31595.84{col 38} -35.11{col 46}{space 3} -1193437{col 58}{space 3} -1025056
{col 1}{text}        tm3{col 13}{c |}{result}{space 2}-764165.9{col 26}{space 1} 29090.75{col 38} -26.27{col 46}{space 3}-841681.6{col 58}{space 3}-686650.3
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-331910.5{col 26}{space 1} 21769.29{col 38} -15.25{col 46}{space 3}-389917.3{col 58}{space 3}-273903.8
{col 1}{text}        tp0{col 13}{c |}{result}{space 2} -2097694{col 26}{space 1} 25328.83{col 38} -82.82{col 46}{space 3} -2165186{col 58}{space 3} -2030203
{col 1}{text}        tp1{col 13}{c |}{result}{space 2} -2993369{col 26}{space 1} 31557.27{col 38} -94.86{col 46}{space 3} -3077457{col 58}{space 3} -2909281
{col 1}{text}        tp2{col 13}{c |}{result}{space 2} -2562216{col 26}{space 1}    40298{col 38} -63.58{col 46}{space 3} -2669595{col 58}{space 3} -2454838
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-74892.87{col 26}{space 1} 61649.12{col 38}  -1.21{col 46}{space 3}-239164.1{col 58}{space 3} 89378.32
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}  4393675{col 26}{space 1} 75636.22{col 38}  58.09{col 46}{space 3}  4192134{col 58}{space 3}  4595217
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}  6415986{col 26}{space 1} 81132.93{col 38}  79.08{col 46}{space 3}  6199798{col 58}{space 3}  6632174
{col 1}{text}        tp6{col 13}{c |}{result}{space 2}  7203215{col 26}{space 1} 99729.77{col 38}  72.23{col 46}{space 3}  6937474{col 58}{space 3}  7468957
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}  7787616{col 26}{space 1} 122845.7{col 38}  63.39{col 46}{space 3}  7460279{col 58}{space 3}  8114952
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}  8465130{col 26}{space 1} 138696.5{col 38}  61.03{col 46}{space 3}  8095557{col 58}{space 3}  8834703
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}  8990768{col 26}{space 1} 177240.8{col 38}  50.73{col 46}{space 3}  8518490{col 58}{space 3}  9463047
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} 1.00e+07{col 26}{space 1} 227536.3{col 38}  43.99{col 46}{space 3}  9403513{col 58}{space 3} 1.06e+07
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} 1.06e+07{col 26}{space 1} 350490.7{col 38}  30.27{col 46}{space 3}  9676825{col 58}{space 3} 1.15e+07
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{err}Running event study for sal_dias_cot
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} -10.7357{col 26}{space 2} .1582381{col 37}{space 1}  -67.85{col 46}{space 3}0.000{col 54}{space 4}-11.04584{col 67}{space 3}-10.42556
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}-3.273548{col 26}{space 2} .1378601{col 37}{space 1}  -23.75{col 46}{space 3}0.000{col 54}{space 4}-3.543749{col 67}{space 3}-3.003347
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-14.43993{col 26}{space 2} .3445931{col 37}{space 1}  -41.90{col 46}{space 3}0.000{col 54}{space 4}-15.11532{col 67}{space 3}-13.76454
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2}-15.11258{col 26}{space 2} .2565885{col 37}{space 1}  -58.90{col 46}{space 3}0.000{col 54}{space 4}-15.61548{col 67}{space 3}-14.60967
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2}-13.37185{col 26}{space 2} .2241193{col 37}{space 1}  -59.66{col 46}{space 3}0.000{col 54}{space 4}-13.81111{col 67}{space 3}-12.93258
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2}-12.19369{col 26}{space 2} .2057086{col 37}{space 1}  -59.28{col 46}{space 3}0.000{col 54}{space 4}-12.59687{col 67}{space 3}-11.79051
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2}-9.786615{col 26}{space 2} .1882385{col 37}{space 1}  -51.99{col 46}{space 3}0.000{col 54}{space 4}-10.15556{col 67}{space 3}-9.417674
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2}-6.880015{col 26}{space 2} .1664999{col 37}{space 1}  -41.32{col 46}{space 3}0.000{col 54}{space 4}-7.206349{col 67}{space 3}-6.553681
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-3.365198{col 26}{space 2} .1281017{col 37}{space 1}  -26.27{col 46}{space 3}0.000{col 54}{space 4}-3.616273{col 67}{space 3}-3.114124
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2} 2.001063{col 26}{space 2} .1051207{col 37}{space 1}   19.04{col 46}{space 3}0.000{col 54}{space 4}  1.79503{col 67}{space 3} 2.207095
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2} 2.169921{col 26}{space 2} .1126802{col 37}{space 1}   19.26{col 46}{space 3}0.000{col 54}{space 4} 1.949072{col 67}{space 3}  2.39077
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2} 1.336619{col 26}{space 2} .1154329{col 37}{space 1}   11.58{col 46}{space 3}0.000{col 54}{space 4} 1.110375{col 67}{space 3} 1.562863
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0869764{col 26}{space 2} .1195393{col 37}{space 1}   -0.73{col 46}{space 3}0.467{col 54}{space 4}-.3212691{col 67}{space 3} .1473164
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-1.703086{col 26}{space 2} .1247509{col 37}{space 1}  -13.65{col 46}{space 3}0.000{col 54}{space 4}-1.947594{col 67}{space 3}-1.458579
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-3.127749{col 26}{space 2} .1269032{col 37}{space 1}  -24.65{col 46}{space 3}0.000{col 54}{space 4}-3.376475{col 67}{space 3}-2.879024
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} -4.02724{col 26}{space 2} .1425597{col 37}{space 1}  -28.25{col 46}{space 3}0.000{col 54}{space 4}-4.306652{col 67}{space 3}-3.747828
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}-4.863498{col 26}{space 2} .1617178{col 37}{space 1}  -30.07{col 46}{space 3}0.000{col 54}{space 4}-5.180459{col 67}{space 3}-4.546537
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-6.503107{col 26}{space 2} .1832776{col 37}{space 1}  -35.48{col 46}{space 3}0.000{col 54}{space 4}-6.862325{col 67}{space 3} -6.14389
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-7.391078{col 26}{space 2}  .217582{col 37}{space 1}  -33.97{col 46}{space 3}0.000{col 54}{space 4}-7.817531{col 67}{space 3}-6.964625
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2}-8.219438{col 26}{space 2} .2753629{col 37}{space 1}  -29.85{col 46}{space 3}0.000{col 54}{space 4}-8.759139{col 67}{space 3}-7.679736
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2}-8.868008{col 26}{space 2} .3816716{col 37}{space 1}  -23.23{col 46}{space 3}0.000{col 54}{space 4} -9.61607{col 67}{space 3}-8.119945
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} -10.7357{col 26}{space 1} .1579242{col 38} -67.98{col 46}{space 3}-11.15449{col 58}{space 3}-10.31691
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2}-3.273548{col 26}{space 1} .1267371{col 38} -25.83{col 46}{space 3}-3.609636{col 58}{space 3} -2.93746
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-14.43993{col 26}{space 1} .3416371{col 38} -42.27{col 46}{space 3} -15.3459{col 58}{space 3}-13.53396
{col 1}{text}        tm7{col 13}{c |}{result}{space 2}-15.11258{col 26}{space 1} .2499286{col 38} -60.47{col 46}{space 3}-15.77535{col 58}{space 3}-14.44981
{col 1}{text}        tm6{col 13}{c |}{result}{space 2}-13.37185{col 26}{space 1} .2151211{col 38} -62.16{col 46}{space 3}-13.94232{col 58}{space 3}-12.80138
{col 1}{text}        tm5{col 13}{c |}{result}{space 2}-12.19369{col 26}{space 1} .2019002{col 38} -60.39{col 46}{space 3} -12.7291{col 58}{space 3}-11.65828
{col 1}{text}        tm4{col 13}{c |}{result}{space 2}-9.786615{col 26}{space 1} .1853043{col 38} -52.81{col 46}{space 3}-10.27801{col 58}{space 3}-9.295216
{col 1}{text}        tm3{col 13}{c |}{result}{space 2}-6.880015{col 26}{space 1} .1619409{col 38} -42.48{col 46}{space 3}-7.309458{col 58}{space 3}-6.450572
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-3.365198{col 26}{space 1} .1251397{col 38} -26.89{col 46}{space 3} -3.69705{col 58}{space 3}-3.033347
{col 1}{text}        tp0{col 13}{c |}{result}{space 2} 2.001063{col 26}{space 1} .1042348{col 38}  19.20{col 46}{space 3} 1.724648{col 58}{space 3} 2.277478
{col 1}{text}        tp1{col 13}{c |}{result}{space 2} 2.169921{col 26}{space 1} .1036355{col 38}  20.94{col 46}{space 3} 1.895095{col 58}{space 3} 2.444746
{col 1}{text}        tp2{col 13}{c |}{result}{space 2} 1.336619{col 26}{space 1} .1054453{col 38}  12.68{col 46}{space 3} 1.056994{col 58}{space 3} 1.616244
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0869764{col 26}{space 1} .1146972{col 38}  -0.76{col 46}{space 3}-.3911362{col 58}{space 3} .2171834
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-1.703086{col 26}{space 1} .1169584{col 38} -14.56{col 46}{space 3}-2.013242{col 58}{space 3} -1.39293
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-3.127749{col 26}{space 1} .1224508{col 38} -25.54{col 46}{space 3}-3.452471{col 58}{space 3}-2.803028
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} -4.02724{col 26}{space 1} .1407359{col 38} -28.62{col 46}{space 3} -4.40045{col 58}{space 3}-3.654029
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}-4.863498{col 26}{space 1} .1522904{col 38} -31.94{col 46}{space 3}-5.267349{col 58}{space 3}-4.459647
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-6.503107{col 26}{space 1} .1769865{col 38} -36.74{col 46}{space 3}-6.972449{col 58}{space 3}-6.033766
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}-7.391078{col 26}{space 1} .2095222{col 38} -35.28{col 46}{space 3}  -7.9467{col 58}{space 3}-6.835457
{col 1}{text}       tp10{col 13}{c |}{result}{space 2}-8.219438{col 26}{space 1} .2815791{col 38} -29.19{col 46}{space 3}-8.966143{col 58}{space 3}-7.472732
{col 1}{text}       tp11{col 13}{c |}{result}{space 2}-8.868008{col 26}{space 1} .3652611{col 38} -24.28{col 46}{space 3}-9.836625{col 58}{space 3} -7.89939
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} -10.6886{col 26}{space 2} .1572892{col 37}{space 1}  -67.96{col 46}{space 3}0.000{col 54}{space 4}-10.99688{col 67}{space 3}-10.38032
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} .0276774{col 26}{space 2} .1368817{col 37}{space 1}    0.20{col 46}{space 3}0.840{col 54}{space 4}-.2406057{col 67}{space 3} .2959605
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-14.38251{col 26}{space 2} .3434105{col 37}{space 1}  -41.88{col 46}{space 3}0.000{col 54}{space 4}-15.05558{col 67}{space 3}-13.70944
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2}-15.05426{col 26}{space 2} .2552106{col 37}{space 1}  -58.99{col 46}{space 3}0.000{col 54}{space 4}-15.55446{col 67}{space 3}-14.55406
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2}-13.28779{col 26}{space 2} .2235821{col 37}{space 1}  -59.43{col 46}{space 3}0.000{col 54}{space 4}  -13.726{col 67}{space 3}-12.84958
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2}-12.12121{col 26}{space 2} .2048073{col 37}{space 1}  -59.18{col 46}{space 3}0.000{col 54}{space 4}-12.52262{col 67}{space 3}-11.71979
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2}-9.730934{col 26}{space 2} .1873836{col 37}{space 1}  -51.93{col 46}{space 3}0.000{col 54}{space 4} -10.0982{col 67}{space 3}-9.363669
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2}-6.875335{col 26}{space 2} .1658325{col 37}{space 1}  -41.46{col 46}{space 3}0.000{col 54}{space 4}-7.200361{col 67}{space 3}-6.550309
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-3.368193{col 26}{space 2} .1278066{col 37}{space 1}  -26.35{col 46}{space 3}0.000{col 54}{space 4}-3.618689{col 67}{space 3}-3.117697
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2} 2.110918{col 26}{space 2} .1049279{col 37}{space 1}   20.12{col 46}{space 3}0.000{col 54}{space 4} 1.905263{col 67}{space 3} 2.316573
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2} 2.454629{col 26}{space 2} .1121684{col 37}{space 1}   21.88{col 46}{space 3}0.000{col 54}{space 4} 2.234783{col 67}{space 3} 2.674475
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2} 1.938057{col 26}{space 2} .1144293{col 37}{space 1}   16.94{col 46}{space 3}0.000{col 54}{space 4} 1.713779{col 67}{space 3} 2.162334
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}  .946543{col 26}{space 2} .1178634{col 37}{space 1}    8.03{col 46}{space 3}0.000{col 54}{space 4} .7155349{col 67}{space 3} 1.177551
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.1400373{col 26}{space 2} .1225599{col 37}{space 1}   -1.14{col 46}{space 3}0.253{col 54}{space 4}-.3802504{col 67}{space 3} .1001758
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.9510936{col 26}{space 2} .1246245{col 37}{space 1}   -7.63{col 46}{space 3}0.000{col 54}{space 4}-1.195353{col 67}{space 3} -.706834
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}-1.023423{col 26}{space 2} .1395674{col 37}{space 1}   -7.33{col 46}{space 3}0.000{col 54}{space 4} -1.29697{col 67}{space 3} -.749876
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2} -1.01093{col 26}{space 2} .1578651{col 37}{space 1}   -6.40{col 46}{space 3}0.000{col 54}{space 4} -1.32034{col 67}{space 3}-.7015202
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-1.291349{col 26}{space 2} .1842118{col 37}{space 1}   -7.01{col 46}{space 3}0.000{col 54}{space 4}-1.652398{col 67}{space 3}-.9303009
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-1.093964{col 26}{space 2} .2194549{col 37}{space 1}   -4.98{col 46}{space 3}0.000{col 54}{space 4}-1.524087{col 67}{space 3}  -.66384
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} -1.02712{col 26}{space 2} .2754057{col 37}{space 1}   -3.73{col 46}{space 3}0.000{col 54}{space 4}-1.566905{col 67}{space 3}-.4873343
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2}-.5801009{col 26}{space 2} .3834265{col 37}{space 1}   -1.51{col 46}{space 3}0.130{col 54}{space 4}-1.331603{col 67}{space 3} .1714012
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} -10.6886{col 26}{space 1} .1577884{col 38} -67.74{col 46}{space 3}-11.10417{col 58}{space 3}-10.27304
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} .0276774{col 26}{space 1} .1407618{col 38}   0.20{col 46}{space 3}-.3430418{col 58}{space 3} .3983966
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-14.38251{col 26}{space 1} .3623998{col 38} -39.69{col 46}{space 3}-15.33695{col 58}{space 3}-13.42807
{col 1}{text}        tm7{col 13}{c |}{result}{space 2}-15.05426{col 26}{space 1}  .249225{col 38} -60.40{col 46}{space 3}-15.71063{col 58}{space 3}-14.39788
{col 1}{text}        tm6{col 13}{c |}{result}{space 2}-13.28779{col 26}{space 1} .2109037{col 38} -63.00{col 46}{space 3}-13.84324{col 58}{space 3}-12.73234
{col 1}{text}        tm5{col 13}{c |}{result}{space 2}-12.12121{col 26}{space 1} .2000412{col 38} -60.59{col 46}{space 3}-12.64805{col 58}{space 3}-11.59437
{col 1}{text}        tm4{col 13}{c |}{result}{space 2}-9.730934{col 26}{space 1} .1882602{col 38} -51.69{col 46}{space 3}-10.22675{col 58}{space 3} -9.23512
{col 1}{text}        tm3{col 13}{c |}{result}{space 2}-6.875335{col 26}{space 1} .1548771{col 38} -44.39{col 46}{space 3}-7.283229{col 58}{space 3}-6.467441
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-3.368193{col 26}{space 1} .1243591{col 38} -27.08{col 46}{space 3}-3.695713{col 58}{space 3}-3.040673
{col 1}{text}        tp0{col 13}{c |}{result}{space 2} 2.110918{col 26}{space 1} .1036142{col 38}  20.37{col 46}{space 3} 1.838033{col 58}{space 3} 2.383803
{col 1}{text}        tp1{col 13}{c |}{result}{space 2} 2.454629{col 26}{space 1} .1130503{col 38}  21.71{col 46}{space 3} 2.156893{col 58}{space 3} 2.752366
{col 1}{text}        tp2{col 13}{c |}{result}{space 2} 1.938057{col 26}{space 1}  .115343{col 38}  16.80{col 46}{space 3} 1.634282{col 58}{space 3} 2.241831
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}  .946543{col 26}{space 1} .1176923{col 38}   8.04{col 46}{space 3} .6365811{col 58}{space 3} 1.256505
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.1400373{col 26}{space 1} .1258035{col 38}  -1.11{col 46}{space 3}-.4713615{col 58}{space 3} .1912869
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.9510936{col 26}{space 1} .1198231{col 38}  -7.94{col 46}{space 3}-1.266667{col 58}{space 3}  -.63552
{col 1}{text}        tp6{col 13}{c |}{result}{space 2}-1.023423{col 26}{space 1} .1386424{col 38}  -7.38{col 46}{space 3}-1.388561{col 58}{space 3}-.6582856
{col 1}{text}        tp7{col 13}{c |}{result}{space 2} -1.01093{col 26}{space 1} .1526577{col 38}  -6.62{col 46}{space 3}-1.412979{col 58}{space 3}-.6088811
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-1.291349{col 26}{space 1}  .187071{col 38}  -6.90{col 46}{space 3}-1.784031{col 58}{space 3}-.7986675
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}-1.093964{col 26}{space 1} .2329878{col 38}  -4.70{col 46}{space 3}-1.707575{col 58}{space 3}-.4803523
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} -1.02712{col 26}{space 1} .2945851{col 38}  -3.49{col 46}{space 3}-1.802958{col 58}{space 3}-.2512815
{col 1}{text}       tp11{col 13}{c |}{result}{space 2}-.5801009{col 26}{space 1} .3767927{col 38}  -1.54{col 46}{space 3}-1.572446{col 58}{space 3} .4122444
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
(72,128 observations deleted)
{err}Running event study for service_mental
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0009936{col 26}{space 2} .0014596{col 37}{space 1}    0.68{col 46}{space 3}0.496{col 54}{space 4}-.0018672{col 67}{space 3} .0038544
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}-.0112179{col 26}{space 2} .0012748{col 37}{space 1}   -8.80{col 46}{space 3}0.000{col 54}{space 4}-.0137165{col 67}{space 3}-.0087193
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0015481{col 26}{space 2} .0035029{col 37}{space 1}   -0.44{col 46}{space 3}0.659{col 54}{space 4}-.0084137{col 67}{space 3} .0053175
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0008384{col 26}{space 2}  .002445{col 37}{space 1}    0.34{col 46}{space 3}0.732{col 54}{space 4}-.0039537{col 67}{space 3} .0056304
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0025082{col 26}{space 2} .0020915{col 37}{space 1}    1.20{col 46}{space 3}0.230{col 54}{space 4}-.0015911{col 67}{space 3} .0066076
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0022458{col 26}{space 2} .0017743{col 37}{space 1}    1.27{col 46}{space 3}0.206{col 54}{space 4}-.0012318{col 67}{space 3} .0057234
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0017649{col 26}{space 2} .0015847{col 37}{space 1}    1.11{col 46}{space 3}0.265{col 54}{space 4}-.0013409{col 67}{space 3} .0048708
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2}  .001374{col 26}{space 2} .0014353{col 37}{space 1}    0.96{col 46}{space 3}0.338{col 54}{space 4}-.0014391{col 67}{space 3} .0041871
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2} -.000228{col 26}{space 2} .0012672{col 37}{space 1}   -0.18{col 46}{space 3}0.857{col 54}{space 4}-.0027117{col 67}{space 3} .0022557
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}  .000236{col 26}{space 2} .0013319{col 37}{space 1}    0.18{col 46}{space 3}0.859{col 54}{space 4}-.0023745{col 67}{space 3} .0028465
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.0009227{col 26}{space 2} .0014866{col 37}{space 1}   -0.62{col 46}{space 3}0.535{col 54}{space 4}-.0038363{col 67}{space 3} .0019909
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.0017886{col 26}{space 2} .0015975{col 37}{space 1}   -1.12{col 46}{space 3}0.263{col 54}{space 4}-.0049197{col 67}{space 3} .0013425
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0064732{col 26}{space 2} .0016055{col 37}{space 1}   -4.03{col 46}{space 3}0.000{col 54}{space 4}  -.00962{col 67}{space 3}-.0033264
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0119374{col 26}{space 2} .0016482{col 37}{space 1}   -7.24{col 46}{space 3}0.000{col 54}{space 4}-.0151678{col 67}{space 3}-.0087069
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0147044{col 26}{space 2}  .001656{col 37}{space 1}   -8.88{col 46}{space 3}0.000{col 54}{space 4}  -.01795{col 67}{space 3}-.0114588
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}-.0134073{col 26}{space 2} .0018912{col 37}{space 1}   -7.09{col 46}{space 3}0.000{col 54}{space 4} -.017114{col 67}{space 3}-.0097006
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2} -.014668{col 26}{space 2} .0021503{col 37}{space 1}   -6.82{col 46}{space 3}0.000{col 54}{space 4}-.0188825{col 67}{space 3}-.0104534
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0187754{col 26}{space 2} .0023317{col 37}{space 1}   -8.05{col 46}{space 3}0.000{col 54}{space 4}-.0233455{col 67}{space 3}-.0142052
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-.0196493{col 26}{space 2} .0027868{col 37}{space 1}   -7.05{col 46}{space 3}0.000{col 54}{space 4}-.0251112{col 67}{space 3}-.0141873
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2}-.0163193{col 26}{space 2} .0037319{col 37}{space 1}   -4.37{col 46}{space 3}0.000{col 54}{space 4}-.0236338{col 67}{space 3}-.0090048
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2}-.0162055{col 26}{space 2} .0045795{col 37}{space 1}   -3.54{col 46}{space 3}0.000{col 54}{space 4}-.0251811{col 67}{space 3}-.0072298
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0009936{col 26}{space 1} .0014362{col 38}   0.69{col 46}{space 3}-.0029914{col 58}{space 3} .0049786
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2}-.0112179{col 26}{space 1}  .001267{col 38}  -8.85{col 46}{space 3}-.0147336{col 58}{space 3}-.0077022
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0015481{col 26}{space 1} .0035545{col 38}  -0.44{col 46}{space 3}-.0114111{col 58}{space 3} .0083148
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0008384{col 26}{space 1} .0023557{col 38}   0.36{col 46}{space 3} -.005698{col 58}{space 3} .0073748
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0025082{col 26}{space 1} .0019525{col 38}   1.28{col 46}{space 3}-.0029095{col 58}{space 3}  .007926
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0022458{col 26}{space 1}  .001679{col 38}   1.34{col 46}{space 3}-.0024129{col 58}{space 3} .0069045
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0017649{col 26}{space 1} .0015651{col 38}   1.13{col 46}{space 3}-.0025779{col 58}{space 3} .0061077
{col 1}{text}        tm3{col 13}{c |}{result}{space 2}  .001374{col 26}{space 1} .0014395{col 38}   0.95{col 46}{space 3}-.0026203{col 58}{space 3} .0053682
{col 1}{text}        tm2{col 13}{c |}{result}{space 2} -.000228{col 26}{space 1} .0012718{col 38}  -0.18{col 46}{space 3}-.0037569{col 58}{space 3} .0033009
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}  .000236{col 26}{space 1}  .001391{col 38}   0.17{col 46}{space 3}-.0036237{col 58}{space 3} .0040957
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.0009227{col 26}{space 1} .0015465{col 38}  -0.60{col 46}{space 3}-.0052138{col 58}{space 3} .0033683
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.0017886{col 26}{space 1} .0016666{col 38}  -1.07{col 46}{space 3}-.0064131{col 58}{space 3} .0028359
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0064732{col 26}{space 1}  .001639{col 38}  -3.95{col 46}{space 3}-.0110209{col 58}{space 3}-.0019255
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0119374{col 26}{space 1} .0017307{col 38}  -6.90{col 46}{space 3}-.0167397{col 58}{space 3} -.007135
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0147044{col 26}{space 1} .0018107{col 38}  -8.12{col 46}{space 3}-.0197288{col 58}{space 3}  -.00968
{col 1}{text}        tp6{col 13}{c |}{result}{space 2}-.0134073{col 26}{space 1}  .001845{col 38}  -7.27{col 46}{space 3}-.0185268{col 58}{space 3}-.0082879
{col 1}{text}        tp7{col 13}{c |}{result}{space 2} -.014668{col 26}{space 1} .0022073{col 38}  -6.65{col 46}{space 3}-.0207927{col 58}{space 3}-.0085432
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0187754{col 26}{space 1} .0023375{col 38}  -8.03{col 46}{space 3}-.0252614{col 58}{space 3}-.0122893
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}-.0196493{col 26}{space 1} .0026941{col 38}  -7.29{col 46}{space 3}-.0271247{col 58}{space 3}-.0121738
{col 1}{text}       tp10{col 13}{c |}{result}{space 2}-.0163193{col 26}{space 1} .0035257{col 38}  -4.63{col 46}{space 3}-.0261023{col 58}{space 3}-.0065363
{col 1}{text}       tp11{col 13}{c |}{result}{space 2}-.0162055{col 26}{space 1} .0046316{col 38}  -3.50{col 46}{space 3} -.029057{col 58}{space 3} -.003354
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0001046{col 26}{space 2} .0014693{col 37}{space 1}    0.07{col 46}{space 3}0.943{col 54}{space 4}-.0027752{col 67}{space 3} .0029844
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} -.004766{col 26}{space 2} .0013132{col 37}{space 1}   -3.63{col 46}{space 3}0.000{col 54}{space 4}-.0073398{col 67}{space 3}-.0021921
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0031173{col 26}{space 2} .0035143{col 37}{space 1}   -0.89{col 46}{space 3}0.375{col 54}{space 4}-.0100052{col 67}{space 3} .0037705
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2}-.0003821{col 26}{space 2} .0024573{col 37}{space 1}   -0.16{col 46}{space 3}0.876{col 54}{space 4}-.0051983{col 67}{space 3} .0044341
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0015996{col 26}{space 2} .0021034{col 37}{space 1}    0.76{col 46}{space 3}0.447{col 54}{space 4} -.002523{col 67}{space 3} .0057222
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0013846{col 26}{space 2}  .001787{col 37}{space 1}    0.77{col 46}{space 3}0.438{col 54}{space 4}-.0021179{col 67}{space 3} .0048871
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0010475{col 26}{space 2} .0015941{col 37}{space 1}    0.66{col 46}{space 3}0.511{col 54}{space 4}-.0020769{col 67}{space 3} .0041719
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0008145{col 26}{space 2} .0014409{col 37}{space 1}    0.57{col 46}{space 3}0.572{col 54}{space 4}-.0020096{col 67}{space 3} .0036386
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0006146{col 26}{space 2} .0012704{col 37}{space 1}   -0.48{col 46}{space 3}0.629{col 54}{space 4}-.0031045{col 67}{space 3} .0018753
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2} .0007034{col 26}{space 2} .0013344{col 37}{space 1}    0.53{col 46}{space 3}0.598{col 54}{space 4} -.001912{col 67}{space 3} .0033188
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2} .0001475{col 26}{space 2}  .001491{col 37}{space 1}    0.10{col 46}{space 3}0.921{col 54}{space 4}-.0027749{col 67}{space 3} .0030698
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2} .0001857{col 26}{space 2} .0016047{col 37}{space 1}    0.12{col 46}{space 3}0.908{col 54}{space 4}-.0029595{col 67}{space 3} .0033309
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0035747{col 26}{space 2}  .001615{col 37}{space 1}   -2.21{col 46}{space 3}0.027{col 54}{space 4}  -.00674{col 67}{space 3}-.0004094
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0077322{col 26}{space 2} .0016605{col 37}{space 1}   -4.66{col 46}{space 3}0.000{col 54}{space 4}-.0109868{col 67}{space 3}-.0044775
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0093929{col 26}{space 2} .0016724{col 37}{space 1}   -5.62{col 46}{space 3}0.000{col 54}{space 4}-.0126709{col 67}{space 3} -.006115
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}-.0065168{col 26}{space 2} .0019164{col 37}{space 1}   -3.40{col 46}{space 3}0.001{col 54}{space 4}-.0102728{col 67}{space 3}-.0027607
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}-.0063963{col 26}{space 2} .0021861{col 37}{space 1}   -2.93{col 46}{space 3}0.003{col 54}{space 4}-.0106809{col 67}{space 3}-.0021116
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0085349{col 26}{space 2} .0023886{col 37}{space 1}   -3.57{col 46}{space 3}0.000{col 54}{space 4}-.0132164{col 67}{space 3}-.0038533
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-.0083067{col 26}{space 2} .0028538{col 37}{space 1}   -2.91{col 46}{space 3}0.004{col 54}{space 4}-.0139001{col 67}{space 3}-.0027134
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2}-.0037734{col 26}{space 2} .0038054{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4}-.0112318{col 67}{space 3}  .003685
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2}-.0040002{col 26}{space 2} .0046751{col 37}{space 1}   -0.86{col 46}{space 3}0.392{col 54}{space 4}-.0131632{col 67}{space 3} .0051627
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0001046{col 26}{space 1} .0014116{col 38}   0.07{col 46}{space 3}-.0037817{col 58}{space 3} .0039909
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} -.004766{col 26}{space 1}  .001336{col 38}  -3.57{col 46}{space 3}-.0084442{col 58}{space 3}-.0010877
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0031173{col 26}{space 1} .0035161{col 38}  -0.89{col 46}{space 3}-.0127978{col 58}{space 3} .0065631
{col 1}{text}        tm7{col 13}{c |}{result}{space 2}-.0003821{col 26}{space 1} .0024584{col 38}  -0.16{col 46}{space 3}-.0071506{col 58}{space 3} .0063864
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0015996{col 26}{space 1} .0021232{col 38}   0.75{col 46}{space 3} -.004246{col 58}{space 3} .0074452
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0013846{col 26}{space 1} .0018161{col 38}   0.76{col 46}{space 3}-.0036153{col 58}{space 3} .0063846
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0010475{col 26}{space 1} .0016556{col 38}   0.63{col 46}{space 3}-.0035108{col 58}{space 3} .0056058
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0008145{col 26}{space 1} .0015079{col 38}   0.54{col 46}{space 3}-.0033371{col 58}{space 3} .0049661
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0006146{col 26}{space 1} .0012327{col 38}  -0.50{col 46}{space 3}-.0040085{col 58}{space 3} .0027794
{col 1}{text}        tp0{col 13}{c |}{result}{space 2} .0007034{col 26}{space 1} .0013447{col 38}   0.52{col 46}{space 3}-.0029987{col 58}{space 3} .0044056
{col 1}{text}        tp1{col 13}{c |}{result}{space 2} .0001475{col 26}{space 1} .0015465{col 38}   0.10{col 46}{space 3}-.0041102{col 58}{space 3} .0044052
{col 1}{text}        tp2{col 13}{c |}{result}{space 2} .0001857{col 26}{space 1} .0015665{col 38}   0.12{col 46}{space 3}-.0041271{col 58}{space 3} .0044984
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0035747{col 26}{space 1} .0016025{col 38}  -2.23{col 46}{space 3}-.0079865{col 58}{space 3} .0008372
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0077322{col 26}{space 1} .0017504{col 38}  -4.42{col 46}{space 3}-.0125514{col 58}{space 3}-.0029129
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0093929{col 26}{space 1} .0016232{col 38}  -5.79{col 46}{space 3} -.013862{col 58}{space 3}-.0049239
{col 1}{text}        tp6{col 13}{c |}{result}{space 2}-.0065168{col 26}{space 1} .0018462{col 38}  -3.53{col 46}{space 3}-.0115997{col 58}{space 3}-.0014339
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}-.0063963{col 26}{space 1} .0022789{col 38}  -2.81{col 46}{space 3}-.0126705{col 58}{space 3} -.000122
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0085349{col 26}{space 1} .0024707{col 38}  -3.45{col 46}{space 3} -.015337{col 58}{space 3}-.0017327
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}-.0083067{col 26}{space 1} .0028263{col 38}  -2.94{col 46}{space 3} -.016088{col 58}{space 3}-.0005254
{col 1}{text}       tp10{col 13}{c |}{result}{space 2}-.0037734{col 26}{space 1}  .004047{col 38}  -0.93{col 46}{space 3}-.0149156{col 58}{space 3} .0073687
{col 1}{text}       tp11{col 13}{c |}{result}{space 2}-.0040002{col 26}{space 1}   .00469{col 38}  -0.85{col 46}{space 3}-.0169125{col 58}{space 3} .0089121
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{err}Running event study for service_mental2
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0007807{col 26}{space 2} .0013512{col 37}{space 1}    0.58{col 46}{space 3}0.563{col 54}{space 4}-.0018675{col 67}{space 3} .0034289
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}-.0116517{col 26}{space 2}  .001178{col 37}{space 1}   -9.89{col 46}{space 3}0.000{col 54}{space 4}-.0139606{col 67}{space 3}-.0093428
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0012713{col 26}{space 2} .0032184{col 37}{space 1}   -0.40{col 46}{space 3}0.693{col 54}{space 4}-.0075792{col 67}{space 3} .0050366
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0006111{col 26}{space 2}  .002284{col 37}{space 1}    0.27{col 46}{space 3}0.789{col 54}{space 4}-.0038654{col 67}{space 3} .0050876
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0019299{col 26}{space 2} .0019547{col 37}{space 1}    0.99{col 46}{space 3}0.323{col 54}{space 4}-.0019012{col 67}{space 3} .0057609
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0011547{col 26}{space 2} .0016074{col 37}{space 1}    0.72{col 46}{space 3}0.473{col 54}{space 4}-.0019957{col 67}{space 3}  .004305
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0012738{col 26}{space 2} .0014699{col 37}{space 1}    0.87{col 46}{space 3}0.386{col 54}{space 4}-.0016072{col 67}{space 3} .0041548
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0015404{col 26}{space 2} .0013413{col 37}{space 1}    1.15{col 46}{space 3}0.251{col 54}{space 4}-.0010884{col 67}{space 3} .0041693
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2} .0002263{col 26}{space 2} .0012038{col 37}{space 1}    0.19{col 46}{space 3}0.851{col 54}{space 4}-.0021332{col 67}{space 3} .0025857
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0007942{col 26}{space 2} .0012046{col 37}{space 1}   -0.66{col 46}{space 3}0.510{col 54}{space 4}-.0031552{col 67}{space 3} .0015668
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.0013754{col 26}{space 2} .0013772{col 37}{space 1}   -1.00{col 46}{space 3}0.318{col 54}{space 4}-.0040746{col 67}{space 3} .0013238
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.0019086{col 26}{space 2} .0014998{col 37}{space 1}   -1.27{col 46}{space 3}0.203{col 54}{space 4}-.0048481{col 67}{space 3} .0010309
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0057957{col 26}{space 2} .0015182{col 37}{space 1}   -3.82{col 46}{space 3}0.000{col 54}{space 4}-.0087712{col 67}{space 3}-.0028201
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0115724{col 26}{space 2} .0015457{col 37}{space 1}   -7.49{col 46}{space 3}0.000{col 54}{space 4}-.0146018{col 67}{space 3} -.008543
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0138381{col 26}{space 2} .0015527{col 37}{space 1}   -8.91{col 46}{space 3}0.000{col 54}{space 4}-.0168814{col 67}{space 3}-.0107948
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} -.014561{col 26}{space 2} .0017243{col 37}{space 1}   -8.44{col 46}{space 3}0.000{col 54}{space 4}-.0179404{col 67}{space 3}-.0111815
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}-.0149574{col 26}{space 2} .0019892{col 37}{space 1}   -7.52{col 46}{space 3}0.000{col 54}{space 4}-.0188561{col 67}{space 3}-.0110587
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0176267{col 26}{space 2} .0021578{col 37}{space 1}   -8.17{col 46}{space 3}0.000{col 54}{space 4}-.0218559{col 67}{space 3}-.0133975
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-.0213794{col 26}{space 2} .0024975{col 37}{space 1}   -8.56{col 46}{space 3}0.000{col 54}{space 4}-.0262744{col 67}{space 3}-.0164844
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2}-.0169586{col 26}{space 2} .0033659{col 37}{space 1}   -5.04{col 46}{space 3}0.000{col 54}{space 4}-.0235558{col 67}{space 3}-.0103615
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2}-.0190533{col 26}{space 2} .0038989{col 37}{space 1}   -4.89{col 46}{space 3}0.000{col 54}{space 4}-.0266951{col 67}{space 3}-.0114115
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0007807{col 26}{space 1} .0013448{col 38}   0.58{col 46}{space 3}-.0028115{col 58}{space 3} .0043729
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2}-.0116517{col 26}{space 1} .0012016{col 38}  -9.70{col 46}{space 3}-.0148612{col 58}{space 3}-.0084423
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0012713{col 26}{space 1} .0032941{col 38}  -0.39{col 46}{space 3}-.0100701{col 58}{space 3} .0075276
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0006111{col 26}{space 1} .0022542{col 38}   0.27{col 46}{space 3}-.0054101{col 58}{space 3} .0066323
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0019299{col 26}{space 1} .0019001{col 38}   1.02{col 46}{space 3}-.0031456{col 58}{space 3} .0070053
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0011547{col 26}{space 1} .0016582{col 38}   0.70{col 46}{space 3}-.0032744{col 58}{space 3} .0055837
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0012738{col 26}{space 1} .0014685{col 38}   0.87{col 46}{space 3}-.0026488{col 58}{space 3} .0051964
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0015404{col 26}{space 1} .0012606{col 38}   1.22{col 46}{space 3}-.0018267{col 58}{space 3} .0049075
{col 1}{text}        tm2{col 13}{c |}{result}{space 2} .0002263{col 26}{space 1} .0012354{col 38}   0.18{col 46}{space 3}-.0030736{col 58}{space 3} .0035262
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0007942{col 26}{space 1} .0011841{col 38}  -0.67{col 46}{space 3} -.003957{col 58}{space 3} .0023686
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.0013754{col 26}{space 1} .0013684{col 38}  -1.01{col 46}{space 3}-.0050305{col 58}{space 3} .0022797
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.0019086{col 26}{space 1} .0015358{col 38}  -1.24{col 46}{space 3} -.006011{col 58}{space 3} .0021938
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0057957{col 26}{space 1} .0015569{col 38}  -3.72{col 46}{space 3}-.0099542{col 58}{space 3}-.0016371
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0115724{col 26}{space 1} .0015928{col 38}  -7.27{col 46}{space 3} -.015827{col 58}{space 3}-.0073178
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0138381{col 26}{space 1} .0015237{col 38}  -9.08{col 46}{space 3}-.0179079{col 58}{space 3}-.0097682
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} -.014561{col 26}{space 1}  .001751{col 38}  -8.32{col 46}{space 3}-.0192381{col 58}{space 3}-.0098838
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}-.0149574{col 26}{space 1}  .002047{col 38}  -7.31{col 46}{space 3}-.0204251{col 58}{space 3}-.0094897
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0176267{col 26}{space 1} .0022007{col 38}  -8.01{col 46}{space 3}-.0235049{col 58}{space 3}-.0117485
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}-.0213794{col 26}{space 1}  .002516{col 38}  -8.50{col 46}{space 3}-.0280998{col 58}{space 3}-.0146589
{col 1}{text}       tp10{col 13}{c |}{result}{space 2}-.0169586{col 26}{space 1} .0036333{col 38}  -4.67{col 46}{space 3}-.0266635{col 58}{space 3}-.0072538
{col 1}{text}       tp11{col 13}{c |}{result}{space 2}-.0190533{col 26}{space 1} .0040701{col 38}  -4.68{col 46}{space 3}-.0299248{col 58}{space 3}-.0081818
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0001121{col 26}{space 2} .0013602{col 37}{space 1}    0.08{col 46}{space 3}0.934{col 54}{space 4}-.0025539{col 67}{space 3} .0027781
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}-.0057202{col 26}{space 2} .0012154{col 37}{space 1}   -4.71{col 46}{space 3}0.000{col 54}{space 4}-.0081023{col 67}{space 3}-.0033381
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0025254{col 26}{space 2}  .003229{col 37}{space 1}   -0.78{col 46}{space 3}0.434{col 54}{space 4}-.0088541{col 67}{space 3} .0038033
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} -.000299{col 26}{space 2} .0022954{col 37}{space 1}   -0.13{col 46}{space 3}0.896{col 54}{space 4}-.0047979{col 67}{space 3}    .0042
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0012629{col 26}{space 2} .0019662{col 37}{space 1}    0.64{col 46}{space 3}0.521{col 54}{space 4}-.0025908{col 67}{space 3} .0051167
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0005062{col 26}{space 2} .0016198{col 37}{space 1}    0.31{col 46}{space 3}0.755{col 54}{space 4}-.0026685{col 67}{space 3}  .003681
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0007632{col 26}{space 2} .0014789{col 37}{space 1}    0.52{col 46}{space 3}0.606{col 54}{space 4}-.0021355{col 67}{space 3} .0036619
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0011361{col 26}{space 2} .0013465{col 37}{space 1}    0.84{col 46}{space 3}0.399{col 54}{space 4}-.0015029{col 67}{space 3} .0037751
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0000596{col 26}{space 2} .0012066{col 37}{space 1}   -0.05{col 46}{space 3}0.961{col 54}{space 4}-.0024245{col 67}{space 3} .0023053
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0003969{col 26}{space 2}  .001207{col 37}{space 1}   -0.33{col 46}{space 3}0.742{col 54}{space 4}-.0027626{col 67}{space 3} .0019689
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.0004582{col 26}{space 2} .0013818{col 37}{space 1}   -0.33{col 46}{space 3}0.740{col 54}{space 4}-.0031665{col 67}{space 3} .0022501
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.0001414{col 26}{space 2} .0015069{col 37}{space 1}   -0.09{col 46}{space 3}0.925{col 54}{space 4}-.0030948{col 67}{space 3} .0028121
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2} -.003161{col 26}{space 2} .0015275{col 37}{space 1}   -2.07{col 46}{space 3}0.039{col 54}{space 4}-.0061547{col 67}{space 3}-.0001672
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0077674{col 26}{space 2} .0015581{col 37}{space 1}   -4.99{col 46}{space 3}0.000{col 54}{space 4}-.0108211{col 67}{space 3}-.0047137
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0089652{col 26}{space 2} .0015694{col 37}{space 1}   -5.71{col 46}{space 3}0.000{col 54}{space 4}-.0120413{col 67}{space 3}-.0058892
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}-.0081951{col 26}{space 2} .0017499{col 37}{space 1}   -4.68{col 46}{space 3}0.000{col 54}{space 4}-.0116248{col 67}{space 3}-.0047655
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}-.0073005{col 26}{space 2} .0020249{col 37}{space 1}   -3.61{col 46}{space 3}0.000{col 54}{space 4}-.0112693{col 67}{space 3}-.0033316
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2} -.008081{col 26}{space 2} .0022131{col 37}{space 1}   -3.65{col 46}{space 3}0.000{col 54}{space 4}-.0124186{col 67}{space 3}-.0037434
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-.0109041{col 26}{space 2} .0025638{col 37}{space 1}   -4.25{col 46}{space 3}0.000{col 54}{space 4}-.0159291{col 67}{space 3}-.0058791
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2}-.0055866{col 26}{space 2} .0034393{col 37}{space 1}   -1.62{col 46}{space 3}0.104{col 54}{space 4}-.0123275{col 67}{space 3} .0011542
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} -.007685{col 26}{space 2} .0039958{col 37}{space 1}   -1.92{col 46}{space 3}0.054{col 54}{space 4}-.0155167{col 67}{space 3} .0001466
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0001121{col 26}{space 1} .0013707{col 38}   0.08{col 46}{space 3}-.0035028{col 58}{space 3} .0037269
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2}-.0057202{col 26}{space 1} .0011729{col 38}  -4.88{col 46}{space 3}-.0088135{col 58}{space 3}-.0026269
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0025254{col 26}{space 1} .0031874{col 38}  -0.79{col 46}{space 3}-.0109311{col 58}{space 3} .0058804
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} -.000299{col 26}{space 1} .0023199{col 38}  -0.13{col 46}{space 3} -.006417{col 58}{space 3}  .005819
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0012629{col 26}{space 1} .0019624{col 38}   0.64{col 46}{space 3}-.0039122{col 58}{space 3}  .006438
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0005062{col 26}{space 1} .0016034{col 38}   0.32{col 46}{space 3}-.0037221{col 58}{space 3} .0047346
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0007632{col 26}{space 1} .0014955{col 38}   0.51{col 46}{space 3}-.0031806{col 58}{space 3} .0047071
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0011361{col 26}{space 1} .0013254{col 38}   0.86{col 46}{space 3}-.0023593{col 58}{space 3} .0046314
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0000596{col 26}{space 1} .0012199{col 38}  -0.05{col 46}{space 3}-.0032768{col 58}{space 3} .0031576
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0003969{col 26}{space 1} .0011993{col 38}  -0.33{col 46}{space 3}-.0035597{col 58}{space 3}  .002766
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.0004582{col 26}{space 1} .0014636{col 38}  -0.31{col 46}{space 3} -.004318{col 58}{space 3} .0034016
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.0001414{col 26}{space 1} .0014724{col 38}  -0.10{col 46}{space 3}-.0040245{col 58}{space 3} .0037417
{col 1}{text}        tp3{col 13}{c |}{result}{space 2} -.003161{col 26}{space 1} .0014516{col 38}  -2.18{col 46}{space 3}-.0069891{col 58}{space 3} .0006671
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0077674{col 26}{space 1} .0015638{col 38}  -4.97{col 46}{space 3}-.0118914{col 58}{space 3}-.0036434
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0089652{col 26}{space 1} .0014863{col 38}  -6.03{col 46}{space 3}-.0128848{col 58}{space 3}-.0050457
{col 1}{text}        tp6{col 13}{c |}{result}{space 2}-.0081951{col 26}{space 1} .0017456{col 38}  -4.69{col 46}{space 3}-.0127987{col 58}{space 3}-.0035916
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}-.0073005{col 26}{space 1} .0021078{col 38}  -3.46{col 46}{space 3} -.012859{col 58}{space 3}-.0017419
{col 1}{text}        tp8{col 13}{c |}{result}{space 2} -.008081{col 26}{space 1} .0022143{col 38}  -3.65{col 46}{space 3}-.0139206{col 58}{space 3}-.0022415
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}-.0109041{col 26}{space 1} .0025561{col 38}  -4.27{col 46}{space 3} -.017645{col 58}{space 3}-.0041631
{col 1}{text}       tp10{col 13}{c |}{result}{space 2}-.0055866{col 26}{space 1} .0034676{col 38}  -1.61{col 46}{space 3}-.0147314{col 58}{space 3} .0035582
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} -.007685{col 26}{space 1} .0040037{col 38}  -1.92{col 46}{space 3}-.0182435{col 58}{space 3} .0028734
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{err}Running event study for service_mental3
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0003294{col 26}{space 2} .0005536{col 37}{space 1}    0.60{col 46}{space 3}0.552{col 54}{space 4}-.0007556{col 67}{space 3} .0014144
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} .0003033{col 26}{space 2} .0005023{col 37}{space 1}    0.60{col 46}{space 3}0.546{col 54}{space 4}-.0006813{col 67}{space 3} .0012878
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0001078{col 26}{space 2} .0013868{col 37}{space 1}   -0.08{col 46}{space 3}0.938{col 54}{space 4}-.0028259{col 67}{space 3} .0026103
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0003703{col 26}{space 2} .0009888{col 37}{space 1}    0.37{col 46}{space 3}0.708{col 54}{space 4}-.0015678{col 67}{space 3} .0023084
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2}    .0007{col 26}{space 2} .0007443{col 37}{space 1}    0.94{col 46}{space 3}0.347{col 54}{space 4}-.0007588{col 67}{space 3} .0021587
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0013502{col 26}{space 2} .0008385{col 37}{space 1}    1.61{col 46}{space 3}0.107{col 54}{space 4}-.0002933{col 67}{space 3} .0029937
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0004275{col 26}{space 2} .0006367{col 37}{space 1}    0.67{col 46}{space 3}0.502{col 54}{space 4}-.0008205{col 67}{space 3} .0016755
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2}-3.82e-06{col 26}{space 2} .0005496{col 37}{space 1}   -0.01{col 46}{space 3}0.994{col 54}{space 4} -.001081{col 67}{space 3} .0010734
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0004306{col 26}{space 2} .0004453{col 37}{space 1}   -0.97{col 46}{space 3}0.333{col 54}{space 4}-.0013034{col 67}{space 3} .0004421
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}  .000862{col 26}{space 2} .0005952{col 37}{space 1}    1.45{col 46}{space 3}0.148{col 54}{space 4}-.0003045{col 67}{space 3} .0020286
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2} .0003244{col 26}{space 2} .0005962{col 37}{space 1}    0.54{col 46}{space 3}0.586{col 54}{space 4}-.0008442{col 67}{space 3}  .001493
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2} .0001066{col 26}{space 2} .0005889{col 37}{space 1}    0.18{col 46}{space 3}0.856{col 54}{space 4}-.0010476{col 67}{space 3} .0012609
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0007584{col 26}{space 2} .0005993{col 37}{space 1}   -1.27{col 46}{space 3}0.206{col 54}{space 4} -.001933{col 67}{space 3} .0004162
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0005091{col 26}{space 2} .0006589{col 37}{space 1}   -0.77{col 46}{space 3}0.440{col 54}{space 4}-.0018007{col 67}{space 3} .0007824
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0011287{col 26}{space 2} .0006364{col 37}{space 1}   -1.77{col 46}{space 3}0.076{col 54}{space 4} -.002376{col 67}{space 3} .0001185
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} .0007305{col 26}{space 2} .0008363{col 37}{space 1}    0.87{col 46}{space 3}0.382{col 54}{space 4}-.0009085{col 67}{space 3} .0023696
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2} .0001521{col 26}{space 2} .0008979{col 37}{space 1}    0.17{col 46}{space 3}0.865{col 54}{space 4}-.0016077{col 67}{space 3} .0019119
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0008309{col 26}{space 2} .0010093{col 37}{space 1}   -0.82{col 46}{space 3}0.410{col 54}{space 4}-.0028091{col 67}{space 3} .0011472
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}  .001552{col 26}{space 2} .0013728{col 37}{space 1}    1.13{col 46}{space 3}0.258{col 54}{space 4}-.0011386{col 67}{space 3} .0042425
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} .0006292{col 26}{space 2} .0016768{col 37}{space 1}    0.38{col 46}{space 3}0.707{col 54}{space 4}-.0026573{col 67}{space 3} .0039158
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} .0025097{col 26}{space 2}  .002415{col 37}{space 1}    1.04{col 46}{space 3}0.299{col 54}{space 4}-.0022237{col 67}{space 3}  .007243
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0003294{col 26}{space 1} .0005685{col 38}   0.58{col 46}{space 3}-.0012161{col 58}{space 3} .0018749
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} .0003033{col 26}{space 1} .0004877{col 38}   0.62{col 46}{space 3}-.0010227{col 58}{space 3} .0016292
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0001078{col 26}{space 1} .0012068{col 38}  -0.09{col 46}{space 3}-.0033887{col 58}{space 3} .0031731
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0003703{col 26}{space 1} .0010304{col 38}   0.36{col 46}{space 3}-.0024308{col 58}{space 3} .0031715
{col 1}{text}        tm6{col 13}{c |}{result}{space 2}    .0007{col 26}{space 1}  .000745{col 38}   0.94{col 46}{space 3}-.0013253{col 58}{space 3} .0027252
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0013502{col 26}{space 1} .0008505{col 38}   1.59{col 46}{space 3}-.0009619{col 58}{space 3} .0036624
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0004275{col 26}{space 1}   .00064{col 38}   0.67{col 46}{space 3}-.0013123{col 58}{space 3} .0021673
{col 1}{text}        tm3{col 13}{c |}{result}{space 2}-3.82e-06{col 26}{space 1} .0005781{col 38}  -0.01{col 46}{space 3}-.0015754{col 58}{space 3} .0015677
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0004306{col 26}{space 1} .0004937{col 38}  -0.87{col 46}{space 3}-.0017729{col 58}{space 3} .0009116
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}  .000862{col 26}{space 1} .0006017{col 38}   1.43{col 46}{space 3}-.0007738{col 58}{space 3} .0024978
{col 1}{text}        tp1{col 13}{c |}{result}{space 2} .0003244{col 26}{space 1} .0006293{col 38}   0.52{col 46}{space 3}-.0013866{col 58}{space 3} .0020353
{col 1}{text}        tp2{col 13}{c |}{result}{space 2} .0001066{col 26}{space 1} .0006087{col 38}   0.18{col 46}{space 3}-.0015483{col 58}{space 3} .0017616
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0007584{col 26}{space 1} .0005707{col 38}  -1.33{col 46}{space 3}  -.00231{col 58}{space 3} .0007932
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0005091{col 26}{space 1} .0006527{col 38}  -0.78{col 46}{space 3}-.0022835{col 58}{space 3} .0012652
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0011287{col 26}{space 1} .0006535{col 38}  -1.73{col 46}{space 3}-.0029053{col 58}{space 3} .0006478
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} .0007305{col 26}{space 1} .0008246{col 38}   0.89{col 46}{space 3}-.0015114{col 58}{space 3} .0029724
{col 1}{text}        tp7{col 13}{c |}{result}{space 2} .0001521{col 26}{space 1} .0008674{col 38}   0.18{col 46}{space 3}-.0022061{col 58}{space 3} .0025103
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0008309{col 26}{space 1} .0009809{col 38}  -0.85{col 46}{space 3}-.0034975{col 58}{space 3} .0018357
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}  .001552{col 26}{space 1} .0013178{col 38}   1.18{col 46}{space 3}-.0020306{col 58}{space 3} .0051346
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} .0006292{col 26}{space 1} .0015683{col 38}   0.40{col 46}{space 3}-.0036345{col 58}{space 3} .0048929
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} .0025097{col 26}{space 1} .0025699{col 38}   0.98{col 46}{space 3}-.0044769{col 58}{space 3} .0094963
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0001112{col 26}{space 2} .0005583{col 37}{space 1}    0.20{col 46}{space 3}0.842{col 54}{space 4} -.000983{col 67}{space 3} .0012054
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} .0008792{col 26}{space 2}  .000514{col 37}{space 1}    1.71{col 46}{space 3}0.087{col 54}{space 4}-.0001282{col 67}{space 3} .0018866
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0004056{col 26}{space 2} .0013926{col 37}{space 1}   -0.29{col 46}{space 3}0.771{col 54}{space 4}-.0031351{col 67}{space 3} .0023239
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2}  .000075{col 26}{space 2} .0009941{col 37}{space 1}    0.08{col 46}{space 3}0.940{col 54}{space 4}-.0018733{col 67}{space 3} .0020233
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0004518{col 26}{space 2} .0007493{col 37}{space 1}    0.60{col 46}{space 3}0.547{col 54}{space 4}-.0010168{col 67}{space 3} .0019204
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0011313{col 26}{space 2} .0008426{col 37}{space 1}    1.34{col 46}{space 3}0.179{col 54}{space 4}-.0005202{col 67}{space 3} .0027828
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0002114{col 26}{space 2} .0006407{col 37}{space 1}    0.33{col 46}{space 3}0.741{col 54}{space 4}-.0010443{col 67}{space 3} .0014672
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} -.000156{col 26}{space 2} .0005523{col 37}{space 1}   -0.28{col 46}{space 3}0.778{col 54}{space 4}-.0012385{col 67}{space 3} .0009266
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0005294{col 26}{space 2}  .000447{col 37}{space 1}   -1.18{col 46}{space 3}0.236{col 54}{space 4}-.0014055{col 67}{space 3} .0003466
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2} .0009354{col 26}{space 2}  .000596{col 37}{space 1}    1.57{col 46}{space 3}0.117{col 54}{space 4}-.0002328{col 67}{space 3} .0021036
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2} .0004958{col 26}{space 2} .0005979{col 37}{space 1}    0.83{col 46}{space 3}0.407{col 54}{space 4}-.0006761{col 67}{space 3} .0016676
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2} .0003323{col 26}{space 2} .0005915{col 37}{space 1}    0.56{col 46}{space 3}0.574{col 54}{space 4} -.000827{col 67}{space 3} .0014916
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0004637{col 26}{space 2} .0006027{col 37}{space 1}   -0.77{col 46}{space 3}0.442{col 54}{space 4}-.0016451{col 67}{space 3} .0007176
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0000869{col 26}{space 2} .0006628{col 37}{space 1}   -0.13{col 46}{space 3}0.896{col 54}{space 4} -.001386{col 67}{space 3} .0012121
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0006607{col 26}{space 2} .0006411{col 37}{space 1}   -1.03{col 46}{space 3}0.303{col 54}{space 4}-.0019173{col 67}{space 3} .0005958
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} .0013167{col 26}{space 2} .0008423{col 37}{space 1}    1.56{col 46}{space 3}0.118{col 54}{space 4}-.0003342{col 67}{space 3} .0029676
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2} .0008201{col 26}{space 2} .0009075{col 37}{space 1}    0.90{col 46}{space 3}0.366{col 54}{space 4}-.0009587{col 67}{space 3} .0025988
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0000393{col 26}{space 2} .0010239{col 37}{space 1}   -0.04{col 46}{space 3}0.969{col 54}{space 4}-.0020461{col 67}{space 3} .0019675
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2} .0025346{col 26}{space 2} .0013894{col 37}{space 1}    1.82{col 46}{space 3}0.068{col 54}{space 4}-.0001886{col 67}{space 3} .0052577
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} .0018383{col 26}{space 2} .0016975{col 37}{space 1}    1.08{col 46}{space 3}0.279{col 54}{space 4}-.0014887{col 67}{space 3} .0051653
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} .0035278{col 26}{space 2} .0024449{col 37}{space 1}    1.44{col 46}{space 3}0.149{col 54}{space 4}-.0012642{col 67}{space 3} .0083197
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0001112{col 26}{space 1} .0005463{col 38}   0.20{col 46}{space 3}-.0014759{col 58}{space 3} .0016983
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} .0008792{col 26}{space 1} .0005133{col 38}   1.71{col 46}{space 3}-.0006119{col 58}{space 3} .0023703
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0004056{col 26}{space 1} .0012357{col 38}  -0.33{col 46}{space 3}-.0039952{col 58}{space 3}  .003184
{col 1}{text}        tm7{col 13}{c |}{result}{space 2}  .000075{col 26}{space 1} .0010332{col 38}   0.07{col 46}{space 3}-.0029263{col 58}{space 3} .0030763
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0004518{col 26}{space 1} .0007602{col 38}   0.59{col 46}{space 3}-.0017566{col 58}{space 3} .0026601
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0011313{col 26}{space 1}  .000868{col 38}   1.30{col 46}{space 3}-.0013902{col 58}{space 3} .0036528
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0002114{col 26}{space 1} .0006283{col 38}   0.34{col 46}{space 3}-.0016137{col 58}{space 3} .0020366
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} -.000156{col 26}{space 1} .0005602{col 38}  -0.28{col 46}{space 3}-.0017833{col 58}{space 3} .0014714
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0005294{col 26}{space 1}  .000461{col 38}  -1.15{col 46}{space 3}-.0018685{col 58}{space 3} .0008096
{col 1}{text}        tp0{col 13}{c |}{result}{space 2} .0009354{col 26}{space 1} .0005473{col 38}   1.71{col 46}{space 3}-.0006544{col 58}{space 3} .0025253
{col 1}{text}        tp1{col 13}{c |}{result}{space 2} .0004958{col 26}{space 1} .0005367{col 38}   0.92{col 46}{space 3}-.0010633{col 58}{space 3} .0020548
{col 1}{text}        tp2{col 13}{c |}{result}{space 2} .0003323{col 26}{space 1} .0005898{col 38}   0.56{col 46}{space 3}-.0013809{col 58}{space 3} .0020455
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0004637{col 26}{space 1} .0005786{col 38}  -0.80{col 46}{space 3}-.0021446{col 58}{space 3} .0012171
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0000869{col 26}{space 1} .0006671{col 38}  -0.13{col 46}{space 3} -.002025{col 58}{space 3} .0018511
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0006607{col 26}{space 1} .0006735{col 38}  -0.98{col 46}{space 3}-.0026173{col 58}{space 3} .0012958
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} .0013167{col 26}{space 1} .0008377{col 38}   1.57{col 46}{space 3}-.0011167{col 58}{space 3} .0037501
{col 1}{text}        tp7{col 13}{c |}{result}{space 2} .0008201{col 26}{space 1}  .000933{col 38}   0.88{col 46}{space 3}-.0018902{col 58}{space 3} .0035303
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0000393{col 26}{space 1} .0009684{col 38}  -0.04{col 46}{space 3}-.0028526{col 58}{space 3}  .002774
{col 1}{text}        tp9{col 13}{c |}{result}{space 2} .0025346{col 26}{space 1} .0013598{col 38}   1.86{col 46}{space 3}-.0014157{col 58}{space 3} .0064849
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} .0018383{col 26}{space 1} .0016885{col 38}   1.09{col 46}{space 3}-.0030668{col 58}{space 3} .0067435
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} .0035278{col 26}{space 1} .0024731{col 38}   1.43{col 46}{space 3}-.0036567{col 58}{space 3} .0107122
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{err}Running event study for cardio_risk
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0005597{col 26}{space 2} .0004797{col 37}{space 1}    1.17{col 46}{space 3}0.243{col 54}{space 4}-.0003806{col 67}{space 3} .0014999
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}-.0011399{col 26}{space 2} .0005044{col 37}{space 1}   -2.26{col 46}{space 3}0.024{col 54}{space 4}-.0021285{col 67}{space 3}-.0001514
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2} .0002173{col 26}{space 2}  .001077{col 37}{space 1}    0.20{col 46}{space 3}0.840{col 54}{space 4}-.0018934{col 67}{space 3} .0023281
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0009238{col 26}{space 2} .0009326{col 37}{space 1}    0.99{col 46}{space 3}0.322{col 54}{space 4} -.000904{col 67}{space 3} .0027516
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2} .0013317{col 26}{space 2} .0007442{col 37}{space 1}    1.79{col 46}{space 3}0.074{col 54}{space 4} -.000127{col 67}{space 3} .0027904
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0008016{col 26}{space 2} .0006312{col 37}{space 1}    1.27{col 46}{space 3}0.204{col 54}{space 4}-.0004355{col 67}{space 3} .0020387
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0006665{col 26}{space 2} .0005923{col 37}{space 1}    1.13{col 46}{space 3}0.260{col 54}{space 4}-.0004944{col 67}{space 3} .0018274
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0001816{col 26}{space 2} .0005617{col 37}{space 1}    0.32{col 46}{space 3}0.746{col 54}{space 4}-.0009193{col 67}{space 3} .0012826
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0002048{col 26}{space 2} .0004896{col 37}{space 1}   -0.42{col 46}{space 3}0.676{col 54}{space 4}-.0011643{col 67}{space 3} .0007548
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0008542{col 26}{space 2} .0004792{col 37}{space 1}   -1.78{col 46}{space 3}0.075{col 54}{space 4}-.0017935{col 67}{space 3} .0000851
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.0009614{col 26}{space 2} .0005018{col 37}{space 1}   -1.92{col 46}{space 3}0.055{col 54}{space 4}-.0019449{col 67}{space 3} .0000221
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.0009629{col 26}{space 2} .0005241{col 37}{space 1}   -1.84{col 46}{space 3}0.066{col 54}{space 4}-.0019901{col 67}{space 3} .0000644
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0006823{col 26}{space 2} .0005996{col 37}{space 1}   -1.14{col 46}{space 3}0.255{col 54}{space 4}-.0018575{col 67}{space 3} .0004929
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0013192{col 26}{space 2} .0005658{col 37}{space 1}   -2.33{col 46}{space 3}0.020{col 54}{space 4}-.0024282{col 67}{space 3}-.0002102
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0012323{col 26}{space 2} .0005762{col 37}{space 1}   -2.14{col 46}{space 3}0.032{col 54}{space 4}-.0023616{col 67}{space 3} -.000103
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}-.0004156{col 26}{space 2} .0007317{col 37}{space 1}   -0.57{col 46}{space 3}0.570{col 54}{space 4}-.0018498{col 67}{space 3} .0010186
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2} .0001435{col 26}{space 2} .0008726{col 37}{space 1}    0.16{col 46}{space 3}0.869{col 54}{space 4}-.0015669{col 67}{space 3} .0018538
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0023895{col 26}{space 2} .0008197{col 37}{space 1}   -2.91{col 46}{space 3}0.004{col 54}{space 4}-.0039961{col 67}{space 3}-.0007829
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-.0026895{col 26}{space 2} .0009222{col 37}{space 1}   -2.92{col 46}{space 3}0.004{col 54}{space 4} -.004497{col 67}{space 3} -.000882
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2}-.0023994{col 26}{space 2} .0012614{col 37}{space 1}   -1.90{col 46}{space 3}0.057{col 54}{space 4}-.0048717{col 67}{space 3} .0000729
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} .0000835{col 26}{space 2} .0016167{col 37}{space 1}    0.05{col 46}{space 3}0.959{col 54}{space 4}-.0030852{col 67}{space 3} .0032522
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0005597{col 26}{space 1} .0005213{col 38}   1.07{col 46}{space 3}-.0008338{col 58}{space 3} .0019532
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2}-.0011399{col 26}{space 1} .0005042{col 38}  -2.26{col 46}{space 3}-.0024878{col 58}{space 3} .0002079
{col 1}{text}        tm8{col 13}{c |}{result}{space 2} .0002173{col 26}{space 1} .0010644{col 38}   0.20{col 46}{space 3}-.0026281{col 58}{space 3} .0030628
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0009238{col 26}{space 1} .0010513{col 38}   0.88{col 46}{space 3}-.0018865{col 58}{space 3} .0037342
{col 1}{text}        tm6{col 13}{c |}{result}{space 2} .0013317{col 26}{space 1} .0008439{col 38}   1.58{col 46}{space 3}-.0009242{col 58}{space 3} .0035876
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0008016{col 26}{space 1} .0006532{col 38}   1.23{col 46}{space 3}-.0009446{col 58}{space 3} .0025478
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0006665{col 26}{space 1} .0006414{col 38}   1.04{col 46}{space 3}-.0010481{col 58}{space 3} .0023811
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0001816{col 26}{space 1} .0005673{col 38}   0.32{col 46}{space 3}-.0013348{col 58}{space 3} .0016981
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0002048{col 26}{space 1} .0005137{col 38}  -0.40{col 46}{space 3}-.0015781{col 58}{space 3} .0011685
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0008542{col 26}{space 1} .0004997{col 38}  -1.71{col 46}{space 3}-.0021899{col 58}{space 3} .0004816
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.0009614{col 26}{space 1} .0004841{col 38}  -1.99{col 46}{space 3}-.0022555{col 58}{space 3} .0003327
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.0009629{col 26}{space 1} .0005127{col 38}  -1.88{col 46}{space 3}-.0023334{col 58}{space 3} .0004077
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0006823{col 26}{space 1} .0006394{col 38}  -1.07{col 46}{space 3}-.0023916{col 58}{space 3} .0010271
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0013192{col 26}{space 1} .0005412{col 38}  -2.44{col 46}{space 3}-.0027659{col 58}{space 3} .0001275
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0012323{col 26}{space 1}  .000613{col 38}  -2.01{col 46}{space 3} -.002871{col 58}{space 3} .0004064
{col 1}{text}        tp6{col 13}{c |}{result}{space 2}-.0004156{col 26}{space 1} .0007284{col 38}  -0.57{col 46}{space 3}-.0023627{col 58}{space 3} .0015316
{col 1}{text}        tp7{col 13}{c |}{result}{space 2} .0001435{col 26}{space 1}  .000894{col 38}   0.16{col 46}{space 3}-.0022464{col 58}{space 3} .0025333
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0023895{col 26}{space 1} .0008225{col 38}  -2.91{col 46}{space 3}-.0045883{col 58}{space 3}-.0001907
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}-.0026895{col 26}{space 1} .0009616{col 38}  -2.80{col 46}{space 3}-.0052602{col 58}{space 3}-.0001188
{col 1}{text}       tp10{col 13}{c |}{result}{space 2}-.0023994{col 26}{space 1} .0012538{col 38}  -1.91{col 46}{space 3}-.0057511{col 58}{space 3} .0009522
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} .0000835{col 26}{space 1} .0014443{col 38}   0.06{col 46}{space 3}-.0037774{col 58}{space 3} .0039444
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2} .0006589{col 26}{space 2} .0004887{col 37}{space 1}    1.35{col 46}{space 3}0.178{col 54}{space 4} -.000299{col 67}{space 3} .0016167
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}-.0015318{col 26}{space 2} .0005326{col 37}{space 1}   -2.88{col 46}{space 3}0.004{col 54}{space 4}-.0025757{col 67}{space 3}-.0004879
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2} .0001676{col 26}{space 2} .0010878{col 37}{space 1}    0.15{col 46}{space 3}0.878{col 54}{space 4}-.0019645{col 67}{space 3} .0022998
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2} .0010833{col 26}{space 2} .0009422{col 37}{space 1}    1.15{col 46}{space 3}0.250{col 54}{space 4}-.0007633{col 67}{space 3}   .00293
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2}   .00153{col 26}{space 2} .0007544{col 37}{space 1}    2.03{col 46}{space 3}0.043{col 54}{space 4} .0000514{col 67}{space 3} .0030087
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} .0009903{col 26}{space 2} .0006429{col 37}{space 1}    1.54{col 46}{space 3}0.123{col 54}{space 4}-.0002697{col 67}{space 3} .0022503
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0008073{col 26}{space 2}    .0006{col 37}{space 1}    1.35{col 46}{space 3}0.179{col 54}{space 4}-.0003688{col 67}{space 3} .0019833
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2} .0002571{col 26}{space 2} .0005658{col 37}{space 1}    0.45{col 46}{space 3}0.650{col 54}{space 4}-.0008519{col 67}{space 3}  .001366
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0002237{col 26}{space 2} .0004916{col 37}{space 1}   -0.46{col 46}{space 3}0.649{col 54}{space 4}-.0011873{col 67}{space 3} .0007399
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0009144{col 26}{space 2} .0004812{col 37}{space 1}   -1.90{col 46}{space 3}0.057{col 54}{space 4}-.0018575{col 67}{space 3} .0000286
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.0011049{col 26}{space 2} .0005065{col 37}{space 1}   -2.18{col 46}{space 3}0.029{col 54}{space 4}-.0020976{col 67}{space 3}-.0001123
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2} -.001151{col 26}{space 2} .0005322{col 37}{space 1}   -2.16{col 46}{space 3}0.031{col 54}{space 4}-.0021941{col 67}{space 3}-.0001078
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0009404{col 26}{space 2} .0006101{col 37}{space 1}   -1.54{col 46}{space 3}0.123{col 54}{space 4}-.0021361{col 67}{space 3} .0002554
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0016275{col 26}{space 2}  .000581{col 37}{space 1}   -2.80{col 46}{space 3}0.005{col 54}{space 4}-.0027661{col 67}{space 3}-.0004888
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0014663{col 26}{space 2} .0005959{col 37}{space 1}   -2.46{col 46}{space 3}0.014{col 54}{space 4}-.0026343{col 67}{space 3}-.0002983
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}-.0007965{col 26}{space 2} .0007573{col 37}{space 1}   -1.05{col 46}{space 3}0.293{col 54}{space 4}-.0022808{col 67}{space 3} .0006878
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}-.0004149{col 26}{space 2} .0009026{col 37}{space 1}   -0.46{col 46}{space 3}0.646{col 54}{space 4} -.002184{col 67}{space 3} .0013542
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2}-.0031402{col 26}{space 2} .0008713{col 37}{space 1}   -3.60{col 46}{space 3}0.000{col 54}{space 4} -.004848{col 67}{space 3}-.0014324
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}-.0036137{col 26}{space 2} .0009866{col 37}{space 1}   -3.66{col 46}{space 3}0.000{col 54}{space 4}-.0055473{col 67}{space 3}  -.00168
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2}-.0030874{col 26}{space 2} .0013174{col 37}{space 1}   -2.34{col 46}{space 3}0.019{col 54}{space 4}-.0056695{col 67}{space 3}-.0005054
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} -.000125{col 26}{space 2} .0016778{col 37}{space 1}   -0.07{col 46}{space 3}0.941{col 54}{space 4}-.0034134{col 67}{space 3} .0031634
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2} .0006589{col 26}{space 1} .0005101{col 38}   1.29{col 46}{space 3}-.0007098{col 58}{space 3} .0020275
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2}-.0015318{col 26}{space 1} .0005545{col 38}  -2.76{col 46}{space 3}-.0030194{col 58}{space 3}-.0000443
{col 1}{text}        tm8{col 13}{c |}{result}{space 2} .0001676{col 26}{space 1} .0011405{col 38}   0.15{col 46}{space 3}-.0028921{col 58}{space 3} .0032274
{col 1}{text}        tm7{col 13}{c |}{result}{space 2} .0010833{col 26}{space 1} .0010879{col 38}   1.00{col 46}{space 3}-.0018354{col 58}{space 3} .0040021
{col 1}{text}        tm6{col 13}{c |}{result}{space 2}   .00153{col 26}{space 1} .0007379{col 38}   2.07{col 46}{space 3}-.0004496{col 58}{space 3} .0035097
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} .0009903{col 26}{space 1} .0006609{col 38}   1.50{col 46}{space 3}-.0007828{col 58}{space 3} .0027635
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0008073{col 26}{space 1} .0006214{col 38}   1.30{col 46}{space 3}-.0008599{col 58}{space 3} .0024744
{col 1}{text}        tm3{col 13}{c |}{result}{space 2} .0002571{col 26}{space 1} .0005718{col 38}   0.45{col 46}{space 3} -.001277{col 58}{space 3} .0017911
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0002237{col 26}{space 1} .0005045{col 38}  -0.44{col 46}{space 3}-.0015774{col 58}{space 3} .0011299
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0009144{col 26}{space 1}   .00051{col 38}  -1.79{col 46}{space 3}-.0022828{col 58}{space 3} .0004539
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.0011049{col 26}{space 1} .0005242{col 38}  -2.11{col 46}{space 3}-.0025112{col 58}{space 3} .0003013
{col 1}{text}        tp2{col 13}{c |}{result}{space 2} -.001151{col 26}{space 1} .0005159{col 38}  -2.23{col 46}{space 3}-.0025351{col 58}{space 3} .0002331
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0009404{col 26}{space 1} .0006036{col 38}  -1.56{col 46}{space 3}-.0025596{col 58}{space 3} .0006789
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0016275{col 26}{space 1} .0005751{col 38}  -2.83{col 46}{space 3}-.0031704{col 58}{space 3}-.0000846
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0014663{col 26}{space 1} .0006118{col 38}  -2.40{col 46}{space 3}-.0031076{col 58}{space 3}  .000175
{col 1}{text}        tp6{col 13}{c |}{result}{space 2}-.0007965{col 26}{space 1} .0007561{col 38}  -1.05{col 46}{space 3} -.002825{col 58}{space 3} .0012321
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}-.0004149{col 26}{space 1} .0009103{col 38}  -0.46{col 46}{space 3} -.002857{col 58}{space 3} .0020273
{col 1}{text}        tp8{col 13}{c |}{result}{space 2}-.0031402{col 26}{space 1} .0008793{col 38}  -3.57{col 46}{space 3}-.0054993{col 58}{space 3}-.0007811
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}-.0036137{col 26}{space 1} .0009666{col 38}  -3.74{col 46}{space 3}-.0062069{col 58}{space 3}-.0010204
{col 1}{text}       tp10{col 13}{c |}{result}{space 2}-.0030874{col 26}{space 1} .0012655{col 38}  -2.44{col 46}{space 3}-.0064826{col 58}{space 3} .0003078
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} -.000125{col 26}{space 1} .0015997{col 38}  -0.08{col 46}{space 3}-.0044168{col 58}{space 3} .0041669
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{err}Running event study for laboral
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2}-.0012659{col 26}{space 2} .0016246{col 37}{space 1}   -0.78{col 46}{space 3}0.436{col 54}{space 4}-.0044502{col 67}{space 3} .0019183
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} -.001439{col 26}{space 2} .0011135{col 37}{space 1}   -1.29{col 46}{space 3}0.196{col 54}{space 4}-.0036215{col 67}{space 3} .0007434
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0039019{col 26}{space 2} .0037685{col 37}{space 1}   -1.04{col 46}{space 3}0.300{col 54}{space 4}-.0112879{col 67}{space 3} .0034842
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2}-.0028179{col 26}{space 2}  .002862{col 37}{space 1}   -0.98{col 46}{space 3}0.325{col 54}{space 4}-.0084273{col 67}{space 3} .0027914
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2}-.0022369{col 26}{space 2} .0022804{col 37}{space 1}   -0.98{col 46}{space 3}0.327{col 54}{space 4}-.0067064{col 67}{space 3} .0022325
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2}-.0011945{col 26}{space 2} .0018934{col 37}{space 1}   -0.63{col 46}{space 3}0.528{col 54}{space 4}-.0049055{col 67}{space 3} .0025166
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} .0001941{col 26}{space 2} .0017186{col 37}{space 1}    0.11{col 46}{space 3}0.910{col 54}{space 4}-.0031743{col 67}{space 3} .0035624
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2}-.0002737{col 26}{space 2} .0015286{col 37}{space 1}   -0.18{col 46}{space 3}0.858{col 54}{space 4}-.0032697{col 67}{space 3} .0027223
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2} .0013694{col 26}{space 2} .0014634{col 37}{space 1}    0.94{col 46}{space 3}0.349{col 54}{space 4}-.0014987{col 67}{space 3} .0042375
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0032132{col 26}{space 2} .0013983{col 37}{space 1}   -2.30{col 46}{space 3}0.022{col 54}{space 4}-.0059538{col 67}{space 3}-.0004726
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.0014024{col 26}{space 2}   .00153{col 37}{space 1}   -0.92{col 46}{space 3}0.359{col 54}{space 4}-.0044012{col 67}{space 3} .0015964
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.0002796{col 26}{space 2} .0016181{col 37}{space 1}   -0.17{col 46}{space 3}0.863{col 54}{space 4} -.003451{col 67}{space 3} .0028917
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2}-.0007902{col 26}{space 2}  .001705{col 37}{space 1}   -0.46{col 46}{space 3}0.643{col 54}{space 4}-.0041319{col 67}{space 3} .0025516
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0033823{col 26}{space 2} .0017528{col 37}{space 1}   -1.93{col 46}{space 3}0.054{col 54}{space 4}-.0068177{col 67}{space 3}  .000053
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2}-.0025821{col 26}{space 2} .0017936{col 37}{space 1}   -1.44{col 46}{space 3}0.150{col 54}{space 4}-.0060975{col 67}{space 3} .0009334
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2}-.0009634{col 26}{space 2} .0020009{col 37}{space 1}   -0.48{col 46}{space 3}0.630{col 54}{space 4} -.004885{col 67}{space 3} .0029583
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2}-.0004694{col 26}{space 2} .0022039{col 37}{space 1}   -0.21{col 46}{space 3}0.831{col 54}{space 4}-.0047889{col 67}{space 3} .0038501
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2} .0010788{col 26}{space 2} .0024944{col 37}{space 1}    0.43{col 46}{space 3}0.665{col 54}{space 4}-.0038101{col 67}{space 3} .0059678
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}  .001385{col 26}{space 2} .0030337{col 37}{space 1}    0.46{col 46}{space 3}0.648{col 54}{space 4} -.004561{col 67}{space 3} .0073311
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2}-.0025801{col 26}{space 2} .0033867{col 37}{space 1}   -0.76{col 46}{space 3}0.446{col 54}{space 4}-.0092178{col 67}{space 3} .0040576
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2}-.0040697{col 26}{space 2}   .00403{col 37}{space 1}   -1.01{col 46}{space 3}0.313{col 54}{space 4}-.0119684{col 67}{space 3}  .003829
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2}-.0012659{col 26}{space 1}  .001606{col 38}  -0.79{col 46}{space 3}-.0057967{col 58}{space 3} .0032649
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} -.001439{col 26}{space 1}  .001097{col 38}  -1.31{col 46}{space 3}-.0045338{col 58}{space 3} .0016558
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0039019{col 26}{space 1} .0036306{col 38}  -1.07{col 46}{space 3}-.0141444{col 58}{space 3} .0063407
{col 1}{text}        tm7{col 13}{c |}{result}{space 2}-.0028179{col 26}{space 1}  .002737{col 38}  -1.03{col 46}{space 3}-.0105394{col 58}{space 3} .0049036
{col 1}{text}        tm6{col 13}{c |}{result}{space 2}-.0022369{col 26}{space 1}  .002261{col 38}  -0.99{col 46}{space 3}-.0086157{col 58}{space 3} .0041419
{col 1}{text}        tm5{col 13}{c |}{result}{space 2}-.0011945{col 26}{space 1} .0017744{col 38}  -0.67{col 46}{space 3}-.0062003{col 58}{space 3} .0038114
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} .0001941{col 26}{space 1} .0016574{col 38}   0.12{col 46}{space 3}-.0044818{col 58}{space 3}   .00487
{col 1}{text}        tm3{col 13}{c |}{result}{space 2}-.0002737{col 26}{space 1} .0015151{col 38}  -0.18{col 46}{space 3} -.004548{col 58}{space 3} .0040006
{col 1}{text}        tm2{col 13}{c |}{result}{space 2} .0013694{col 26}{space 1} .0014511{col 38}   0.94{col 46}{space 3}-.0027243{col 58}{space 3} .0054631
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0032132{col 26}{space 1} .0013538{col 38}  -2.37{col 46}{space 3}-.0070325{col 58}{space 3} .0006061
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.0014024{col 26}{space 1} .0014683{col 38}  -0.96{col 46}{space 3}-.0055447{col 58}{space 3} .0027399
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.0002796{col 26}{space 1}  .001576{col 38}  -0.18{col 46}{space 3}-.0047257{col 58}{space 3} .0041664
{col 1}{text}        tp3{col 13}{c |}{result}{space 2}-.0007902{col 26}{space 1} .0016797{col 38}  -0.47{col 46}{space 3}-.0055289{col 58}{space 3} .0039486
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0033823{col 26}{space 1} .0016668{col 38}  -2.03{col 46}{space 3}-.0080846{col 58}{space 3}   .00132
{col 1}{text}        tp5{col 13}{c |}{result}{space 2}-.0025821{col 26}{space 1} .0017335{col 38}  -1.49{col 46}{space 3}-.0074724{col 58}{space 3} .0023083
{col 1}{text}        tp6{col 13}{c |}{result}{space 2}-.0009634{col 26}{space 1} .0019956{col 38}  -0.48{col 46}{space 3}-.0065931{col 58}{space 3} .0046664
{col 1}{text}        tp7{col 13}{c |}{result}{space 2}-.0004694{col 26}{space 1}  .002105{col 38}  -0.22{col 46}{space 3}-.0064079{col 58}{space 3} .0054691
{col 1}{text}        tp8{col 13}{c |}{result}{space 2} .0010788{col 26}{space 1} .0024582{col 38}   0.44{col 46}{space 3}-.0058562{col 58}{space 3} .0080138
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}  .001385{col 26}{space 1} .0031711{col 38}   0.44{col 46}{space 3}-.0075612{col 58}{space 3} .0103313
{col 1}{text}       tp10{col 13}{c |}{result}{space 2}-.0025801{col 26}{space 1} .0034575{col 38}  -0.75{col 46}{space 3}-.0123342{col 58}{space 3}  .007174
{col 1}{text}       tp11{col 13}{c |}{result}{space 2}-.0040697{col 26}{space 1} .0038712{col 38}  -1.05{col 46}{space 3}-.0149911{col 58}{space 3} .0068517
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2}-.0019618{col 26}{space 2} .0016375{col 37}{space 1}   -1.20{col 46}{space 3}0.231{col 54}{space 4}-.0051713{col 67}{space 3} .0012477
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2}  .003475{col 26}{space 2} .0011352{col 37}{space 1}    3.06{col 46}{space 3}0.002{col 54}{space 4} .0012501{col 67}{space 3} .0056999
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.0063419{col 26}{space 2}  .003786{col 37}{space 1}   -1.68{col 46}{space 3}0.094{col 54}{space 4}-.0137624{col 67}{space 3} .0010786
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2}-.0034009{col 26}{space 2}  .002878{col 37}{space 1}   -1.18{col 46}{space 3}0.237{col 54}{space 4}-.0090417{col 67}{space 3} .0022398
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2}-.0023154{col 26}{space 2} .0022952{col 37}{space 1}   -1.01{col 46}{space 3}0.313{col 54}{space 4}-.0068138{col 67}{space 3} .0021831
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2} -.001459{col 26}{space 2} .0019067{col 37}{space 1}   -0.77{col 46}{space 3}0.444{col 54}{space 4}-.0051962{col 67}{space 3} .0022781
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2}-.0001792{col 26}{space 2} .0017296{col 37}{space 1}   -0.10{col 46}{space 3}0.917{col 54}{space 4}-.0035692{col 67}{space 3} .0032108
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2}-.0007038{col 26}{space 2} .0015355{col 37}{space 1}   -0.46{col 46}{space 3}0.647{col 54}{space 4}-.0037133{col 67}{space 3} .0023056
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2} .0006676{col 26}{space 2} .0014675{col 37}{space 1}    0.45{col 46}{space 3}0.649{col 54}{space 4}-.0022086{col 67}{space 3} .0035439
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0030308{col 26}{space 2} .0014004{col 37}{space 1}   -2.16{col 46}{space 3}0.030{col 54}{space 4}-.0057756{col 67}{space 3} -.000286
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2} -.000908{col 26}{space 2} .0015333{col 37}{space 1}   -0.59{col 46}{space 3}0.554{col 54}{space 4}-.0039132{col 67}{space 3} .0020972
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2} .0007671{col 26}{space 2} .0016227{col 37}{space 1}    0.47{col 46}{space 3}0.636{col 54}{space 4}-.0024134{col 67}{space 3} .0039476
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2} .0009982{col 26}{space 2} .0017112{col 37}{space 1}    0.58{col 46}{space 3}0.560{col 54}{space 4}-.0023556{col 67}{space 3}  .004352
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2}-.0003926{col 26}{space 2} .0017603{col 37}{space 1}   -0.22{col 46}{space 3}0.823{col 54}{space 4}-.0038428{col 67}{space 3} .0030575
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2} .0017798{col 26}{space 2} .0018021{col 37}{space 1}    0.99{col 46}{space 3}0.323{col 54}{space 4}-.0017523{col 67}{space 3} .0053119
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} .0046756{col 26}{space 2} .0020127{col 37}{space 1}    2.32{col 46}{space 3}0.020{col 54}{space 4} .0007307{col 67}{space 3} .0086205
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2} .0062383{col 26}{space 2} .0022186{col 37}{space 1}    2.81{col 46}{space 3}0.005{col 54}{space 4} .0018899{col 67}{space 3} .0105867
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2} .0090631{col 26}{space 2} .0025155{col 37}{space 1}    3.60{col 46}{space 3}0.000{col 54}{space 4} .0041329{col 67}{space 3} .0139933
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2}  .010462{col 26}{space 2} .0030646{col 37}{space 1}    3.41{col 46}{space 3}0.001{col 54}{space 4} .0044554{col 67}{space 3} .0164686
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} .0075382{col 26}{space 2} .0034318{col 37}{space 1}    2.20{col 46}{space 3}0.028{col 54}{space 4}  .000812{col 67}{space 3} .0142644
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2}  .004509{col 26}{space 2} .0041085{col 37}{space 1}    1.10{col 46}{space 3}0.272{col 54}{space 4}-.0035435{col 67}{space 3} .0125616
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2}-.0019618{col 26}{space 1} .0017562{col 38}  -1.12{col 46}{space 3}-.0067358{col 58}{space 3} .0028122
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2}  .003475{col 26}{space 1} .0010965{col 38}   3.17{col 46}{space 3} .0004943{col 58}{space 3} .0064556
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.0063419{col 26}{space 1} .0038859{col 38}  -1.63{col 46}{space 3}-.0169052{col 58}{space 3} .0042214
{col 1}{text}        tm7{col 13}{c |}{result}{space 2}-.0034009{col 26}{space 1} .0029461{col 38}  -1.15{col 46}{space 3}-.0114096{col 58}{space 3} .0046077
{col 1}{text}        tm6{col 13}{c |}{result}{space 2}-.0023154{col 26}{space 1} .0023804{col 38}  -0.97{col 46}{space 3}-.0087861{col 58}{space 3} .0041554
{col 1}{text}        tm5{col 13}{c |}{result}{space 2} -.001459{col 26}{space 1} .0019423{col 38}  -0.75{col 46}{space 3}-.0067389{col 58}{space 3} .0038209
{col 1}{text}        tm4{col 13}{c |}{result}{space 2}-.0001792{col 26}{space 1} .0016885{col 38}  -0.11{col 46}{space 3}-.0047692{col 58}{space 3} .0044107
{col 1}{text}        tm3{col 13}{c |}{result}{space 2}-.0007038{col 26}{space 1} .0015653{col 38}  -0.45{col 46}{space 3} -.004959{col 58}{space 3} .0035513
{col 1}{text}        tm2{col 13}{c |}{result}{space 2} .0006676{col 26}{space 1} .0014006{col 38}   0.48{col 46}{space 3}-.0031398{col 58}{space 3} .0044751
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0030308{col 26}{space 1} .0014524{col 38}  -2.09{col 46}{space 3}-.0069791{col 58}{space 3} .0009175
{col 1}{text}        tp1{col 13}{c |}{result}{space 2} -.000908{col 26}{space 1} .0015376{col 38}  -0.59{col 46}{space 3}-.0050878{col 58}{space 3} .0032717
{col 1}{text}        tp2{col 13}{c |}{result}{space 2} .0007671{col 26}{space 1} .0016035{col 38}   0.48{col 46}{space 3}-.0035919{col 58}{space 3} .0051261
{col 1}{text}        tp3{col 13}{c |}{result}{space 2} .0009982{col 26}{space 1} .0018853{col 38}   0.53{col 46}{space 3}-.0041267{col 58}{space 3} .0061231
{col 1}{text}        tp4{col 13}{c |}{result}{space 2}-.0003926{col 26}{space 1} .0017622{col 38}  -0.22{col 46}{space 3} -.005183{col 58}{space 3} .0043977
{col 1}{text}        tp5{col 13}{c |}{result}{space 2} .0017798{col 26}{space 1} .0017425{col 38}   1.02{col 46}{space 3} -.002957{col 58}{space 3} .0065167
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} .0046756{col 26}{space 1} .0020949{col 38}   2.23{col 46}{space 3}-.0010191{col 58}{space 3} .0103702
{col 1}{text}        tp7{col 13}{c |}{result}{space 2} .0062383{col 26}{space 1} .0021884{col 38}   2.85{col 46}{space 3} .0002894{col 58}{space 3} .0121872
{col 1}{text}        tp8{col 13}{c |}{result}{space 2} .0090631{col 26}{space 1} .0025504{col 38}   3.55{col 46}{space 3} .0021302{col 58}{space 3}  .015996
{col 1}{text}        tp9{col 13}{c |}{result}{space 2}  .010462{col 26}{space 1} .0030135{col 38}   3.47{col 46}{space 3} .0022702{col 58}{space 3} .0186537
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} .0075382{col 26}{space 1} .0036107{col 38}   2.09{col 46}{space 3}-.0022771{col 58}{space 3} .0173535
{col 1}{text}       tp11{col 13}{c |}{result}{space 2}  .004509{col 26}{space 1}  .003892{col 38}   1.16{col 46}{space 3}-.0060709{col 58}{space 3}  .015089
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{err}Running event study for pila_independientes
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2}-.1654415{col 26}{space 2} .0062508{col 37}{space 1}  -26.47{col 46}{space 3}0.000{col 54}{space 4}-.1776928{col 67}{space 3}-.1531902
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} .1178635{col 26}{space 2} .0060214{col 37}{space 1}   19.57{col 46}{space 3}0.000{col 54}{space 4} .1060618{col 67}{space 3} .1296653
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.2442679{col 26}{space 2} .0137735{col 37}{space 1}  -17.73{col 46}{space 3}0.000{col 54}{space 4}-.2712634{col 67}{space 3}-.2172724
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2}-.2381774{col 26}{space 2} .0103636{col 37}{space 1}  -22.98{col 46}{space 3}0.000{col 54}{space 4}-.2584897{col 67}{space 3}-.2178652
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2}-.2018277{col 26}{space 2} .0085464{col 37}{space 1}  -23.62{col 46}{space 3}0.000{col 54}{space 4}-.2185784{col 67}{space 3} -.185077
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2}-.1701322{col 26}{space 2} .0076801{col 37}{space 1}  -22.15{col 46}{space 3}0.000{col 54}{space 4} -.185185{col 67}{space 3}-.1550795
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2}-.1382465{col 26}{space 2} .0068749{col 37}{space 1}  -20.11{col 46}{space 3}0.000{col 54}{space 4}-.1517211{col 67}{space 3} -.124772
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2}-.1048537{col 26}{space 2} .0061286{col 37}{space 1}  -17.11{col 46}{space 3}0.000{col 54}{space 4}-.1168655{col 67}{space 3}-.0928419
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0605849{col 26}{space 2} .0048453{col 37}{space 1}  -12.50{col 46}{space 3}0.000{col 54}{space 4}-.0700815{col 67}{space 3}-.0510883
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0747159{col 26}{space 2} .0047462{col 37}{space 1}  -15.74{col 46}{space 3}0.000{col 54}{space 4}-.0840182{col 67}{space 3}-.0654136
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.2620113{col 26}{space 2} .0058862{col 37}{space 1}  -44.51{col 46}{space 3}0.000{col 54}{space 4} -.273548{col 67}{space 3}-.2504747
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.1762197{col 26}{space 2} .0063191{col 37}{space 1}  -27.89{col 46}{space 3}0.000{col 54}{space 4}-.1886049{col 67}{space 3}-.1638344
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2} .1290444{col 26}{space 2} .0067537{col 37}{space 1}   19.11{col 46}{space 3}0.000{col 54}{space 4} .1158075{col 67}{space 3} .1422814
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2} .2770035{col 26}{space 2} .0063359{col 37}{space 1}   43.72{col 46}{space 3}0.000{col 54}{space 4} .2645855{col 67}{space 3} .2894216
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2} .2608523{col 26}{space 2} .0064134{col 37}{space 1}   40.67{col 46}{space 3}0.000{col 54}{space 4} .2482823{col 67}{space 3} .2734222
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} .2485375{col 26}{space 2}  .006989{col 37}{space 1}   35.56{col 46}{space 3}0.000{col 54}{space 4} .2348394{col 67}{space 3} .2622356
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2} .2304079{col 26}{space 2} .0077219{col 37}{space 1}   29.84{col 46}{space 3}0.000{col 54}{space 4} .2152732{col 67}{space 3} .2455426
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2} .2144062{col 26}{space 2} .0090075{col 37}{space 1}   23.80{col 46}{space 3}0.000{col 54}{space 4} .1967518{col 67}{space 3} .2320606
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2} .1917815{col 26}{space 2} .0104703{col 37}{space 1}   18.32{col 46}{space 3}0.000{col 54}{space 4}   .17126{col 67}{space 3}  .212303
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} .1822551{col 26}{space 2} .0130134{col 37}{space 1}   14.01{col 46}{space 3}0.000{col 54}{space 4} .1567493{col 67}{space 3}  .207761
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} .1930211{col 26}{space 2} .0179869{col 37}{space 1}   10.73{col 46}{space 3}0.000{col 54}{space 4} .1577673{col 67}{space 3} .2282749
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2}-.1654415{col 26}{space 1} .0063399{col 38} -26.10{col 46}{space 3}-.1826534{col 58}{space 3}-.1482296
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} .1178635{col 26}{space 1} .0061592{col 38}  19.14{col 46}{space 3} .1011421{col 58}{space 3}  .134585
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.2442679{col 26}{space 1} .0144297{col 38} -16.93{col 46}{space 3}-.2834426{col 58}{space 3}-.2050933
{col 1}{text}        tm7{col 13}{c |}{result}{space 2}-.2381774{col 26}{space 1} .0109393{col 38} -21.77{col 46}{space 3}-.2678762{col 58}{space 3}-.2084787
{col 1}{text}        tm6{col 13}{c |}{result}{space 2}-.2018277{col 26}{space 1} .0081191{col 38} -24.86{col 46}{space 3}  -.22387{col 58}{space 3}-.1797855
{col 1}{text}        tm5{col 13}{c |}{result}{space 2}-.1701322{col 26}{space 1} .0074373{col 38} -22.88{col 46}{space 3}-.1903234{col 58}{space 3}-.1499411
{col 1}{text}        tm4{col 13}{c |}{result}{space 2}-.1382465{col 26}{space 1} .0064616{col 38} -21.40{col 46}{space 3}-.1557889{col 58}{space 3}-.1207042
{col 1}{text}        tm3{col 13}{c |}{result}{space 2}-.1048537{col 26}{space 1} .0061341{col 38} -17.09{col 46}{space 3}-.1215069{col 58}{space 3}-.0882005
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0605849{col 26}{space 1} .0044939{col 38} -13.48{col 46}{space 3}-.0727851{col 58}{space 3}-.0483847
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0747159{col 26}{space 1} .0047749{col 38} -15.65{col 46}{space 3}-.0876793{col 58}{space 3}-.0617526
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.2620113{col 26}{space 1} .0057177{col 38} -45.82{col 46}{space 3} -.277534{col 58}{space 3}-.2464886
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.1762197{col 26}{space 1} .0063386{col 38} -27.80{col 46}{space 3}-.1934282{col 58}{space 3}-.1590112
{col 1}{text}        tp3{col 13}{c |}{result}{space 2} .1290444{col 26}{space 1} .0065281{col 38}  19.77{col 46}{space 3} .1113216{col 58}{space 3} .1467672
{col 1}{text}        tp4{col 13}{c |}{result}{space 2} .2770035{col 26}{space 1} .0061379{col 38}  45.13{col 46}{space 3} .2603399{col 58}{space 3} .2936672
{col 1}{text}        tp5{col 13}{c |}{result}{space 2} .2608523{col 26}{space 1} .0060326{col 38}  43.24{col 46}{space 3} .2444746{col 58}{space 3} .2772299
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} .2485375{col 26}{space 1} .0060588{col 38}  41.02{col 46}{space 3} .2320888{col 58}{space 3} .2649862
{col 1}{text}        tp7{col 13}{c |}{result}{space 2} .2304079{col 26}{space 1} .0074341{col 38}  30.99{col 46}{space 3} .2102253{col 58}{space 3} .2505904
{col 1}{text}        tp8{col 13}{c |}{result}{space 2} .2144062{col 26}{space 1} .0093469{col 38}  22.94{col 46}{space 3} .1890306{col 58}{space 3} .2397819
{col 1}{text}        tp9{col 13}{c |}{result}{space 2} .1917815{col 26}{space 1}  .010102{col 38}  18.98{col 46}{space 3} .1643559{col 58}{space 3} .2192071
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} .1822551{col 26}{space 1} .0135991{col 38}  13.40{col 46}{space 3} .1453355{col 58}{space 3} .2191748
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} .1930211{col 26}{space 1} .0182241{col 38}  10.59{col 46}{space 3} .1435452{col 58}{space 3}  .242497
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2}-.1640594{col 26}{space 2} .0063096{col 37}{space 1}  -26.00{col 46}{space 3}0.000{col 54}{space 4}-.1764259{col 67}{space 3}-.1516928
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} .1825055{col 26}{space 2}  .006234{col 37}{space 1}   29.28{col 46}{space 3}0.000{col 54}{space 4} .1702871{col 67}{space 3} .1947239
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2} -.240873{col 26}{space 2} .0138309{col 37}{space 1}  -17.42{col 46}{space 3}0.000{col 54}{space 4}-.2679811{col 67}{space 3}-.2137649
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2}-.2358496{col 26}{space 2} .0104343{col 37}{space 1}  -22.60{col 46}{space 3}0.000{col 54}{space 4}-.2563006{col 67}{space 3}-.2153987
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2}-.1994333{col 26}{space 2}   .00862{col 37}{space 1}  -23.14{col 46}{space 3}0.000{col 54}{space 4}-.2163282{col 67}{space 3}-.1825383
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2}-.1691763{col 26}{space 2} .0077461{col 37}{space 1}  -21.84{col 46}{space 3}0.000{col 54}{space 4}-.1843584{col 67}{space 3}-.1539942
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2} -.137285{col 26}{space 2} .0069226{col 37}{space 1}  -19.83{col 46}{space 3}0.000{col 54}{space 4}-.1508531{col 67}{space 3}-.1237168
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2}-.1048231{col 26}{space 2} .0061555{col 37}{space 1}  -17.03{col 46}{space 3}0.000{col 54}{space 4}-.1168876{col 67}{space 3}-.0927585
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0609754{col 26}{space 2} .0048566{col 37}{space 1}  -12.56{col 46}{space 3}0.000{col 54}{space 4}-.0704941{col 67}{space 3}-.0514566
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0725709{col 26}{space 2} .0047595{col 37}{space 1}  -15.25{col 46}{space 3}0.000{col 54}{space 4}-.0818992{col 67}{space 3}-.0632425
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.2556071{col 26}{space 2} .0059216{col 37}{space 1}  -43.17{col 46}{space 3}0.000{col 54}{space 4}-.2672132{col 67}{space 3}-.2440011
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.1624116{col 26}{space 2} .0063798{col 37}{space 1}  -25.46{col 46}{space 3}0.000{col 54}{space 4}-.1749157{col 67}{space 3}-.1499074
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2} .1522176{col 26}{space 2} .0068348{col 37}{space 1}   22.27{col 46}{space 3}0.000{col 54}{space 4} .1388216{col 67}{space 3} .1656135
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2} .3119629{col 26}{space 2}  .006437{col 37}{space 1}   48.46{col 46}{space 3}0.000{col 54}{space 4} .2993466{col 67}{space 3} .3245792
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2} .3084733{col 26}{space 2} .0065392{col 37}{space 1}   47.17{col 46}{space 3}0.000{col 54}{space 4} .2956567{col 67}{space 3}   .32129
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} .3111408{col 26}{space 2} .0071794{col 37}{space 1}   43.34{col 46}{space 3}0.000{col 54}{space 4} .2970695{col 67}{space 3} .3252122
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2} .3099948{col 26}{space 2} .0079608{col 37}{space 1}   38.94{col 46}{space 3}0.000{col 54}{space 4} .2943919{col 67}{space 3} .3255976
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2} .3172845{col 26}{space 2} .0092941{col 37}{space 1}   34.14{col 46}{space 3}0.000{col 54}{space 4} .2990684{col 67}{space 3} .3355006
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2} .3143911{col 26}{space 2} .0108138{col 37}{space 1}   29.07{col 46}{space 3}0.000{col 54}{space 4} .2931965{col 67}{space 3} .3355857
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} .3178139{col 26}{space 2}  .013411{col 37}{space 1}   23.70{col 46}{space 3}0.000{col 54}{space 4} .2915288{col 67}{space 3} .3440989
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} .3373766{col 26}{space 2} .0184595{col 37}{space 1}   18.28{col 46}{space 3}0.000{col 54}{space 4} .3011966{col 67}{space 3} .3735566
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2}-.1640594{col 26}{space 1} .0062964{col 38} -26.06{col 46}{space 3}-.1806061{col 58}{space 3}-.1475126
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} .1825055{col 26}{space 1} .0061981{col 38}  29.45{col 46}{space 3} .1662172{col 58}{space 3} .1987938
{col 1}{text}        tm8{col 13}{c |}{result}{space 2} -.240873{col 26}{space 1} .0137998{col 38} -17.45{col 46}{space 3}-.2771384{col 58}{space 3}-.2046076
{col 1}{text}        tm7{col 13}{c |}{result}{space 2}-.2358496{col 26}{space 1} .0108506{col 38} -21.74{col 46}{space 3}-.2643645{col 58}{space 3}-.2073348
{col 1}{text}        tm6{col 13}{c |}{result}{space 2}-.1994333{col 26}{space 1} .0080974{col 38} -24.63{col 46}{space 3}-.2207129{col 58}{space 3}-.1781536
{col 1}{text}        tm5{col 13}{c |}{result}{space 2}-.1691763{col 26}{space 1} .0080659{col 38} -20.97{col 46}{space 3}-.1903732{col 58}{space 3}-.1479794
{col 1}{text}        tm4{col 13}{c |}{result}{space 2} -.137285{col 26}{space 1}  .007055{col 38} -19.46{col 46}{space 3}-.1558253{col 58}{space 3}-.1187446
{col 1}{text}        tm3{col 13}{c |}{result}{space 2}-.1048231{col 26}{space 1} .0063437{col 38} -16.52{col 46}{space 3}-.1214941{col 58}{space 3}-.0881521
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0609754{col 26}{space 1} .0046996{col 38} -12.97{col 46}{space 3}-.0733256{col 58}{space 3}-.0486251
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0725709{col 26}{space 1} .0047372{col 38} -15.32{col 46}{space 3}  -.08502{col 58}{space 3}-.0601217
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.2556071{col 26}{space 1} .0057172{col 38} -44.71{col 46}{space 3}-.2706318{col 58}{space 3}-.2405825
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.1624116{col 26}{space 1} .0059719{col 38} -27.20{col 46}{space 3}-.1781055{col 58}{space 3}-.1467176
{col 1}{text}        tp3{col 13}{c |}{result}{space 2} .1522176{col 26}{space 1} .0069403{col 38}  21.93{col 46}{space 3} .1339786{col 58}{space 3} .1704565
{col 1}{text}        tp4{col 13}{c |}{result}{space 2} .3119629{col 26}{space 1}  .006134{col 38}  50.86{col 46}{space 3}  .295843{col 58}{space 3} .3280828
{col 1}{text}        tp5{col 13}{c |}{result}{space 2} .3084733{col 26}{space 1} .0063572{col 38}  48.52{col 46}{space 3}  .291767{col 58}{space 3} .3251797
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} .3111408{col 26}{space 1} .0071522{col 38}  43.50{col 46}{space 3}  .292345{col 58}{space 3} .3299366
{col 1}{text}        tp7{col 13}{c |}{result}{space 2} .3099948{col 26}{space 1} .0082461{col 38}  37.59{col 46}{space 3} .2883242{col 58}{space 3} .3316653
{col 1}{text}        tp8{col 13}{c |}{result}{space 2} .3172845{col 26}{space 1} .0085867{col 38}  36.95{col 46}{space 3} .2947189{col 58}{space 3} .3398501
{col 1}{text}        tp9{col 13}{c |}{result}{space 2} .3143911{col 26}{space 1} .0108255{col 38}  29.04{col 46}{space 3} .2859422{col 58}{space 3} .3428401
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} .3178139{col 26}{space 1} .0135681{col 38}  23.42{col 46}{space 3} .2821575{col 58}{space 3} .3534703
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} .3373766{col 26}{space 1} .0177679{col 38}  18.99{col 46}{space 3} .2906833{col 58}{space 3}   .38407
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{err}Running event study for p_cotizaciones
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2}-.1738426{col 26}{space 2} .0062825{col 37}{space 1}  -27.67{col 46}{space 3}0.000{col 54}{space 4}-.1861561{col 67}{space 3}-.1615291
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} .0482048{col 26}{space 2} .0061317{col 37}{space 1}    7.86{col 46}{space 3}0.000{col 54}{space 4} .0361869{col 67}{space 3} .0602227
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.2255474{col 26}{space 2} .0133895{col 37}{space 1}  -16.85{col 46}{space 3}0.000{col 54}{space 4}-.2517903{col 67}{space 3}-.1993045
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2}-.2342969{col 26}{space 2} .0098621{col 37}{space 1}  -23.76{col 46}{space 3}0.000{col 54}{space 4}-.2536263{col 67}{space 3}-.2149674
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2}-.2192247{col 26}{space 2} .0080549{col 37}{space 1}  -27.22{col 46}{space 3}0.000{col 54}{space 4} -.235012{col 67}{space 3}-.2034374
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2}-.2023158{col 26}{space 2} .0073569{col 37}{space 1}  -27.50{col 46}{space 3}0.000{col 54}{space 4} -.216735{col 67}{space 3}-.1878966
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2}-.1642998{col 26}{space 2} .0068049{col 37}{space 1}  -24.14{col 46}{space 3}0.000{col 54}{space 4}-.1776373{col 67}{space 3}-.1509624
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2}-.1130873{col 26}{space 2} .0063804{col 37}{space 1}  -17.72{col 46}{space 3}0.000{col 54}{space 4}-.1255926{col 67}{space 3} -.100582
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2}-.0581266{col 26}{space 2} .0056824{col 37}{space 1}  -10.23{col 46}{space 3}0.000{col 54}{space 4} -.069264{col 67}{space 3}-.0469892
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0119055{col 26}{space 2} .0059833{col 37}{space 1}   -1.99{col 46}{space 3}0.047{col 54}{space 4}-.0236326{col 67}{space 3}-.0001784
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.1614571{col 26}{space 2} .0062788{col 37}{space 1}  -25.71{col 46}{space 3}0.000{col 54}{space 4}-.1737633{col 67}{space 3} -.149151
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.0797766{col 26}{space 2} .0066049{col 37}{space 1}  -12.08{col 46}{space 3}0.000{col 54}{space 4}-.0927219{col 67}{space 3}-.0668313
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2} .1426846{col 26}{space 2} .0066554{col 37}{space 1}   21.44{col 46}{space 3}0.000{col 54}{space 4} .1296402{col 67}{space 3} .1557291
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2} .1863869{col 26}{space 2} .0065539{col 37}{space 1}   28.44{col 46}{space 3}0.000{col 54}{space 4} .1735415{col 67}{space 3} .1992322
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2} .1361086{col 26}{space 2} .0067243{col 37}{space 1}   20.24{col 46}{space 3}0.000{col 54}{space 4} .1229292{col 67}{space 3} .1492881
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} .1134252{col 26}{space 2} .0073801{col 37}{space 1}   15.37{col 46}{space 3}0.000{col 54}{space 4} .0989605{col 67}{space 3} .1278899
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2} .0869834{col 26}{space 2} .0081298{col 37}{space 1}   10.70{col 46}{space 3}0.000{col 54}{space 4} .0710492{col 67}{space 3} .1029176
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2} .0705918{col 26}{space 2} .0094691{col 37}{space 1}    7.45{col 46}{space 3}0.000{col 54}{space 4} .0520327{col 67}{space 3} .0891509
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2} .0362613{col 26}{space 2} .0110361{col 37}{space 1}    3.29{col 46}{space 3}0.001{col 54}{space 4} .0146309{col 67}{space 3} .0578918
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} .0139524{col 26}{space 2} .0140074{col 37}{space 1}    1.00{col 46}{space 3}0.319{col 54}{space 4}-.0135017{col 67}{space 3} .0414064
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} .0452028{col 26}{space 2} .0186879{col 37}{space 1}    2.42{col 46}{space 3}0.016{col 54}{space 4} .0085752{col 67}{space 3} .0818304
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2}-.1738426{col 26}{space 1}  .006204{col 38} -28.02{col 46}{space 3}-.1905224{col 58}{space 3}-.1571629
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} .0482048{col 26}{space 1} .0061612{col 38}   7.82{col 46}{space 3} .0316402{col 58}{space 3} .0647695
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.2255474{col 26}{space 1}  .013908{col 38} -16.22{col 46}{space 3}-.2629395{col 58}{space 3}-.1881552
{col 1}{text}        tm7{col 13}{c |}{result}{space 2}-.2342969{col 26}{space 1} .0097707{col 38} -23.98{col 46}{space 3}-.2605659{col 58}{space 3}-.2080278
{col 1}{text}        tm6{col 13}{c |}{result}{space 2}-.2192247{col 26}{space 1} .0081047{col 38} -27.05{col 46}{space 3}-.2410146{col 58}{space 3}-.1974347
{col 1}{text}        tm5{col 13}{c |}{result}{space 2}-.2023158{col 26}{space 1}  .007264{col 38} -27.85{col 46}{space 3}-.2218452{col 58}{space 3}-.1827863
{col 1}{text}        tm4{col 13}{c |}{result}{space 2}-.1642998{col 26}{space 1} .0067468{col 38} -24.35{col 46}{space 3}-.1824389{col 58}{space 3}-.1461608
{col 1}{text}        tm3{col 13}{c |}{result}{space 2}-.1130873{col 26}{space 1} .0059573{col 38} -18.98{col 46}{space 3}-.1291037{col 58}{space 3}-.0970709
{col 1}{text}        tm2{col 13}{c |}{result}{space 2}-.0581266{col 26}{space 1} .0053879{col 38} -10.79{col 46}{space 3}-.0726121{col 58}{space 3} -.043641
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0119055{col 26}{space 1} .0054874{col 38}  -2.17{col 46}{space 3}-.0266587{col 58}{space 3} .0028476
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.1614571{col 26}{space 1} .0061064{col 38} -26.44{col 46}{space 3}-.1778745{col 58}{space 3}-.1450398
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.0797766{col 26}{space 1} .0066486{col 38} -12.00{col 46}{space 3}-.0976515{col 58}{space 3}-.0619016
{col 1}{text}        tp3{col 13}{c |}{result}{space 2} .1426846{col 26}{space 1} .0068396{col 38}  20.86{col 46}{space 3} .1242961{col 58}{space 3} .1610731
{col 1}{text}        tp4{col 13}{c |}{result}{space 2} .1863869{col 26}{space 1} .0066828{col 38}  27.89{col 46}{space 3} .1684198{col 58}{space 3}  .204354
{col 1}{text}        tp5{col 13}{c |}{result}{space 2} .1361086{col 26}{space 1} .0067257{col 38}  20.24{col 46}{space 3} .1180264{col 58}{space 3} .1541908
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} .1134252{col 26}{space 1}  .007008{col 38}  16.19{col 46}{space 3} .0945839{col 58}{space 3} .1322664
{col 1}{text}        tp7{col 13}{c |}{result}{space 2} .0869834{col 26}{space 1}  .008272{col 38}  10.52{col 46}{space 3} .0647437{col 58}{space 3} .1092231
{col 1}{text}        tp8{col 13}{c |}{result}{space 2} .0705918{col 26}{space 1} .0094853{col 38}   7.44{col 46}{space 3} .0450902{col 58}{space 3} .0960934
{col 1}{text}        tp9{col 13}{c |}{result}{space 2} .0362613{col 26}{space 1} .0114293{col 38}   3.17{col 46}{space 3} .0055332{col 58}{space 3} .0669895
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} .0139524{col 26}{space 1} .0147939{col 38}   0.94{col 46}{space 3}-.0258215{col 58}{space 3} .0537262
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} .0452028{col 26}{space 1} .0183255{col 38}   2.47{col 46}{space 3} -.004066{col 58}{space 3} .0944716
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}Pre_avg {c |}{col 14}{res}{space 2}-.1754733{col 26}{space 2} .0063136{col 37}{space 1}  -27.79{col 46}{space 3}0.000{col 54}{space 4}-.1878478{col 67}{space 3}-.1630988
{txt}{space 4}Post_avg {c |}{col 14}{res}{space 2} .1466217{col 26}{space 2} .0062207{col 37}{space 1}   23.57{col 46}{space 3}0.000{col 54}{space 4} .1344294{col 67}{space 3}  .158814
{txt}{space 9}tm8 {c |}{col 14}{res}{space 2}-.2288164{col 26}{space 2} .0134161{col 37}{space 1}  -17.06{col 46}{space 3}0.000{col 54}{space 4}-.2551115{col 67}{space 3}-.2025214
{txt}{space 9}tm7 {c |}{col 14}{res}{space 2}-.2374681{col 26}{space 2} .0099029{col 37}{space 1}  -23.98{col 46}{space 3}0.000{col 54}{space 4}-.2568775{col 67}{space 3}-.2180587
{txt}{space 9}tm6 {c |}{col 14}{res}{space 2}-.2195573{col 26}{space 2}  .008101{col 37}{space 1}  -27.10{col 46}{space 3}0.000{col 54}{space 4} -.235435{col 67}{space 3}-.2036796
{txt}{space 9}tm5 {c |}{col 14}{res}{space 2}-.2032564{col 26}{space 2}  .007402{col 37}{space 1}  -27.46{col 46}{space 3}0.000{col 54}{space 4}-.2177642{col 67}{space 3}-.1887487
{txt}{space 9}tm4 {c |}{col 14}{res}{space 2}-.1648228{col 26}{space 2} .0068368{col 37}{space 1}  -24.11{col 46}{space 3}0.000{col 54}{space 4}-.1782228{col 67}{space 3}-.1514229
{txt}{space 9}tm3 {c |}{col 14}{res}{space 2}-.1147692{col 26}{space 2}  .006392{col 37}{space 1}  -17.96{col 46}{space 3}0.000{col 54}{space 4}-.1272973{col 67}{space 3}-.1022411
{txt}{space 9}tm2 {c |}{col 14}{res}{space 2} -.059623{col 26}{space 2} .0056906{col 37}{space 1}  -10.48{col 46}{space 3}0.000{col 54}{space 4}-.0707764{col 67}{space 3}-.0484696
{txt}{space 9}tp0 {c |}{col 14}{res}{space 2}-.0065801{col 26}{space 2} .0059946{col 37}{space 1}   -1.10{col 46}{space 3}0.272{col 54}{space 4}-.0183292{col 67}{space 3} .0051691
{txt}{space 9}tp1 {c |}{col 14}{res}{space 2}-.1474938{col 26}{space 2}  .006294{col 37}{space 1}  -23.43{col 46}{space 3}0.000{col 54}{space 4}-.1598299{col 67}{space 3}-.1351577
{txt}{space 9}tp2 {c |}{col 14}{res}{space 2}-.0520369{col 26}{space 2} .0066327{col 37}{space 1}   -7.85{col 46}{space 3}0.000{col 54}{space 4}-.0650368{col 67}{space 3} -.039037
{txt}{space 9}tp3 {c |}{col 14}{res}{space 2} .1868904{col 26}{space 2} .0066758{col 37}{space 1}   28.00{col 46}{space 3}0.000{col 54}{space 4}  .173806{col 67}{space 3} .1999747
{txt}{space 9}tp4 {c |}{col 14}{res}{space 2} .2499532{col 26}{space 2} .0065697{col 37}{space 1}   38.05{col 46}{space 3}0.000{col 54}{space 4} .2370767{col 67}{space 3} .2628296
{txt}{space 9}tp5 {c |}{col 14}{res}{space 2} .2161613{col 26}{space 2} .0067594{col 37}{space 1}   31.98{col 46}{space 3}0.000{col 54}{space 4}  .202913{col 67}{space 3} .2294095
{txt}{space 9}tp6 {c |}{col 14}{res}{space 2} .2157114{col 26}{space 2}  .007446{col 37}{space 1}   28.97{col 46}{space 3}0.000{col 54}{space 4} .2011176{col 67}{space 3} .2303053
{txt}{space 9}tp7 {c |}{col 14}{res}{space 2} .2112849{col 26}{space 2} .0082221{col 37}{space 1}   25.70{col 46}{space 3}0.000{col 54}{space 4} .1951699{col 67}{space 3} .2273998
{txt}{space 9}tp8 {c |}{col 14}{res}{space 2} .2251758{col 26}{space 2} .0095829{col 37}{space 1}   23.50{col 46}{space 3}0.000{col 54}{space 4} .2063937{col 67}{space 3}  .243958
{txt}{space 9}tp9 {c |}{col 14}{res}{space 2} .2132546{col 26}{space 2} .0111875{col 37}{space 1}   19.06{col 46}{space 3}0.000{col 54}{space 4} .1913274{col 67}{space 3} .2351817
{txt}{space 8}tp10 {c |}{col 14}{res}{space 2} .2068633{col 26}{space 2}  .014151{col 37}{space 1}   14.62{col 46}{space 3}0.000{col 54}{space 4} .1791278{col 67}{space 3} .2345988
{txt}{space 8}tp11 {c |}{col 14}{res}{space 2} .2402764{col 26}{space 2}  .018867{col 37}{space 1}   12.74{col 46}{space 3}0.000{col 54}{space 4} .2032976{col 67}{space 3} .2772551
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{res}{col 1}{text}{hline 12}{c TT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 13}{text}{c |} Coefficient{col 26}  Std. err.{col 38}     t{col 46}    [95% conf. interval]
{res}{col 1}{text}{hline 12}{c +}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{col 1}{text}    Pre_avg{col 13}{c |}{result}{space 2}-.1754733{col 26}{space 1} .0060998{col 38} -28.77{col 46}{space 3}-.1916641{col 58}{space 3}-.1592826
{col 1}{text}   Post_avg{col 13}{c |}{result}{space 2} .1466217{col 26}{space 1} .0060239{col 38}  24.34{col 46}{space 3} .1306324{col 58}{space 3}  .162611
{col 1}{text}        tm8{col 13}{c |}{result}{space 2}-.2288164{col 26}{space 1} .0130227{col 38} -17.57{col 46}{space 3}-.2633826{col 58}{space 3}-.1942503
{col 1}{text}        tm7{col 13}{c |}{result}{space 2}-.2374681{col 26}{space 1} .0092124{col 38} -25.78{col 46}{space 3}-.2619206{col 58}{space 3}-.2130156
{col 1}{text}        tm6{col 13}{c |}{result}{space 2}-.2195573{col 26}{space 1} .0077507{col 38} -28.33{col 46}{space 3}  -.24013{col 58}{space 3}-.1989847
{col 1}{text}        tm5{col 13}{c |}{result}{space 2}-.2032564{col 26}{space 1}   .00722{col 38} -28.15{col 46}{space 3}-.2224205{col 58}{space 3}-.1840924
{col 1}{text}        tm4{col 13}{c |}{result}{space 2}-.1648228{col 26}{space 1} .0070227{col 38} -23.47{col 46}{space 3}-.1834633{col 58}{space 3}-.1461824
{col 1}{text}        tm3{col 13}{c |}{result}{space 2}-.1147692{col 26}{space 1} .0062749{col 38} -18.29{col 46}{space 3}-.1314246{col 58}{space 3}-.0981139
{col 1}{text}        tm2{col 13}{c |}{result}{space 2} -.059623{col 26}{space 1} .0056181{col 38} -10.61{col 46}{space 3} -.074535{col 58}{space 3} -.044711
{col 1}{text}        tp0{col 13}{c |}{result}{space 2}-.0065801{col 26}{space 1} .0054317{col 38}  -1.21{col 46}{space 3}-.0209973{col 58}{space 3} .0078372
{col 1}{text}        tp1{col 13}{c |}{result}{space 2}-.1474938{col 26}{space 1}  .006173{col 38} -23.89{col 46}{space 3}-.1638787{col 58}{space 3}-.1311089
{col 1}{text}        tp2{col 13}{c |}{result}{space 2}-.0520369{col 26}{space 1} .0066755{col 38}  -7.80{col 46}{space 3}-.0697557{col 58}{space 3}-.0343182
{col 1}{text}        tp3{col 13}{c |}{result}{space 2} .1868904{col 26}{space 1} .0065345{col 38}  28.60{col 46}{space 3} .1695459{col 58}{space 3} .2042348
{col 1}{text}        tp4{col 13}{c |}{result}{space 2} .2499532{col 26}{space 1} .0068188{col 38}  36.66{col 46}{space 3} .2318541{col 58}{space 3} .2680523
{col 1}{text}        tp5{col 13}{c |}{result}{space 2} .2161613{col 26}{space 1} .0067366{col 38}  32.09{col 46}{space 3} .1982804{col 58}{space 3} .2340421
{col 1}{text}        tp6{col 13}{c |}{result}{space 2} .2157114{col 26}{space 1}  .006922{col 38}  31.16{col 46}{space 3} .1973385{col 58}{space 3} .2340844
{col 1}{text}        tp7{col 13}{c |}{result}{space 2} .2112849{col 26}{space 1} .0080276{col 38}  26.32{col 46}{space 3} .1899773{col 58}{space 3} .2325924
{col 1}{text}        tp8{col 13}{c |}{result}{space 2} .2251758{col 26}{space 1} .0091641{col 38}  24.57{col 46}{space 3} .2008516{col 58}{space 3}    .2495
{col 1}{text}        tp9{col 13}{c |}{result}{space 2} .2132546{col 26}{space 1} .0114173{col 38}  18.68{col 46}{space 3} .1829496{col 58}{space 3} .2435596
{col 1}{text}       tp10{col 13}{c |}{result}{space 2} .2068633{col 26}{space 1} .0133535{col 38}  15.49{col 46}{space 3} .1714192{col 58}{space 3} .2423074
{col 1}{text}       tp11{col 13}{c |}{result}{space 2} .2402764{col 26}{space 1} .0196943{col 38}  12.20{col 46}{space 3}  .188002{col 58}{space 3} .2925508
{col 1}{text}{hline 12}{c BT}{hline 12}{hline 12}{hline 8}{hline 12}{hline 12}
{res}WildBootstrap Standard errors
with 999 Repetitions
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Output\Tables\CS_results.dta{rm}
saved
{p_end}
{err}Running event study for pila_salario_r
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
...................................{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

end of do-file

{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

{com}. 