{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Logs\event_study.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}28 Jun 2024, 16:36:01
{txt}
{com}. 
. * Outcomes and categories
. global specialities     all quirurgical clinical other none
{txt}
{com}. global genders          all female male
{txt}
{com}. 
. /*
> global outcomes         sal_dias_cot posgrado_salud pila_salario_r l_pila_salario_r                             ///
>                                         posgrado_rethus p_cotizaciones nro_cotizaciones                                                         ///
>                                         pila_independientes pila_dependientes formal                                                            ///
>                                         diag_mental diag_mental2 service_mental service_mental2                                         ///
>                                         urg hosp urg_np hosp_np pregnancy service cons_mental                                           ///
>                                         cons_mental2 cons_mental3 cons_mental4 consul proce
> */
.                                         
. ****************************************************************************
. **#                                             1. Merge data and set-up
. ****************************************************************************
. 
. * Panel
. use "${c -(}data{c )-}\Individual_balanced_all_RIPS", clear
{txt}
{com}. 
. rename year_RIPS fecha_pila
{res}{txt}
{com}. drop if mi(fechapregrado)
{txt}(0 observations deleted)

{com}. merge 1:1 personabasicaid fecha_pila using "${c -(}data{c )-}\Individual_balanced_all_PILA"
{res}{txt}{p 0 7 2}
(variable
{bf:personabasicaid} was {bf:long}, now {bf:double} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:fecha_pila} was {bf:int}, now {bf:float} to accommodate using data's values)
{p_end}

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          96,046
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}          96,046{txt}  (_merge==2)

{col 5}Matched{col 30}{res}       1,344,644{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. cap drop year_grado
{txt}
{com}. gen year_grado = yofd(fechapregrado)
{txt}(96,046 missing values generated)

{com}. 
. drop if _merge == 2 // Estos son los del 2008
{txt}(96,046 observations deleted)

{com}. 
. rename rethus_sexo rethus_sexo_temp
{res}{txt}
{com}. gen rethus_sexo = 0 
{txt}
{com}. replace rethus_sexo = 1 if rethus_sexo_temp == "MASCULINO"
{txt}(574,462 real changes made)

{com}. replace rethus_sexo = 2 if rethus_sexo_temp == "FEMENINO"
{txt}(769,986 real changes made)

{com}. drop rethus_sexo_temp
{txt}
{com}. drop if rethus_sexo == 0
{txt}(196 observations deleted)

{com}. 
. keep if inrange(posgrado_start, 2011, 2017) | mi(posgrado_start)
{txt}(58,520 observations deleted)

{com}. 
. * Final outcomes
. g service_mental3       = (service_mental == 1          & service_mental2 == 0                                                          )
{txt}
{com}. g cardio_risk           = (stroke == 1                          | infarct == 1                  | cardiovascular == 1           )
{txt}
{com}. g laboral                       = (diag_laboral == 1            | estres_laboral == 1   | accidente_laboral == 1        |       ///
>                                            enfermedad_laboral == 1      | acc_enf_laboral == 1                                                          )
{txt}
{com}. 
. 
. ****************************************************************************
. **#                                             2. Estimation features
. ****************************************************************************
. 
. * Balance
. gen dist = fecha_pila - posgrado_start
{txt}(1,145,270 missing values generated)

{com}. *keep if (dist >= -2 & dist <= 5)
. 
. * Eventually treated dummy
. g eventually_treated = (posgrado_start != .)
{txt}
{com}. 
. * Never treated condition
. replace posgrado_start = 0      if      posgrado_start == .
{txt}(1,145,270 real changes made)

{com}. 
. * Outcomes all
. /*
> global outcomes service_mental service_mental2 service_mental3 diag_laboral estres_laboral                              ///
>                                 accidente_laboral enfermedad_laboral acc_enf_laboral laboral                                                    ///
>                                 pregnancy stroke infarct cardiovascular cardio_risk digestive                                                   ///
>                                 pila_independientes p_cotizaciones pila_salario_r pila_salario_r_max sal_dias_cot
> */
. 
. * Outcomes simplified
. *global outcomes service_mental service_mental2 service_mental3 cardio_risk laboral                                             ///
> *                               pila_independientes p_cotizaciones pila_salario_r sal_dias_cot
. global outcomes pila_salario_r service_mental
{txt}
{com}. * Controls
. global controls year_grado
{txt}
{com}. global cohorts 1995 //2000 2005 2010 
{txt}
{com}. global treatment_groups treated_1a treated_1b treated_1c treated_1d ///
>                       treated_2a treated_2b treated_3c treated_3d
{txt}
{com}. 
. ****************************************************************************
. **#                                             3. CS never treated only
. ****************************************************************************                    
. local replace replace
{txt}
{com}. 
. foreach treated in $treatment_groups {c -(}
{txt}  2{com}.     
.     preserve
{txt}  3{com}.         
.         keep if `treated' + control > 0
{txt}  4{com}.         
.         foreach cohort in $cohorts {c -(}
{txt}  5{com}.                 
.                 keep if year_grado >= `cohort'
{txt}  6{com}.                 
.                 foreach outcome in $outcomes {c -(}
{txt}  7{com}.                                                 
.                         dis as err "Running event study for `outcome'"
{txt}  8{com}.                         
.                         * Without controls
.                         qui sum `outcome' if mi(dist)
{txt}  9{com}.                         local mean = r(mean)
{txt} 10{com}.                         
.                         qui sum `outcome' if fecha_pila == 2015
{txt} 11{com}.                         local obs  = r(N) 
{txt} 12{com}.                         
.                         csdid2          `outcome',                                      ///
>                                                 i(personabasicaid)                      /// panel id variable
>                                                 t(fecha_pila)                           /// Time variable
>                                                 gvar(posgrado_start)            /// Treatment time
>                                                 long2                                           /// Calculate results relative to -1
>                                                 asinr                                           /// Calculate pre-treatment results as in R
>                                                 method(drimp)                           /// Use doubly robust improved method
>                                                 cluster(personabasicaid)                                
{txt} 13{com}.                         estat event, post                                               // Aggregate estimation like an event-study
{txt} 14{com}.                         
.                         regsave using "${c -(}output{c )-}\Tables\CS_results", `replace' ci level(95) ///
>                                         addlabel(treatment_group, `treated', outcome, `outcome', mean, `mean', n, `obs', wboot, 0, estimation, NT, cohort, `cohort', controls, 0)
{txt} 15{com}.                         
.                         local replace append
{txt} 16{com}.                         
.                         estat event, wboot post                                 // SE using WildBootstrap
{txt} 17{com}.                         regsave using "${c -(}output{c )-}\Tables\CS_results", append ci rtable ///
>                                         addlabel(treatment_group, `treated', outcome, `outcome', mean, `mean', n, `obs', wboot, 1, estimation, NT, cohort, `cohort', controls, 0)
{txt} 18{com}.                                         
.                         * With controls
.                         qui sum `outcome' if mi(dist)
{txt} 19{com}.                         local mean = r(mean)
{txt} 20{com}.                         
.                         qui sum `outcome' if fecha_pila == 2015
{txt} 21{com}.                         local obs  = r(N) 
{txt} 22{com}.                         
.                         csdid2          `outcome' $controls ,           ///
>                                                 i(personabasicaid)                      /// panel id variable
>                                                 t(fecha_pila)                           /// Time variable
>                                                 gvar(posgrado_start)            /// Treatment time
>                                                 long2                                           /// Calculate results relative to -1
>                                                 asinr                                           /// Calculate pre-treatment results as in R
>                                                 method(drimp)                           /// Use doubly robust improved method
>                                                 cluster(personabasicaid)                                
{txt} 23{com}.                         estat event, post                                               // Aggregate estimation like an event-study
{txt} 24{com}.                         
.                         regsave using "${c -(}output{c )-}\Tables\CS_results", append ci level(95) ///
>                                         addlabel(treatment_group, `treated', outcome, `outcome', mean, `mean', n, `obs', wboot, 0, estimation, NT, cohort, `cohort', controls, 1)
{txt} 25{com}.                         
.                         estat event, wboot post                                 // SE using WildBootstrap
{txt} 26{com}.                         regsave using "${c -(}output{c )-}\Tables\CS_results", append ci rtable ///
>                                         addlabel(treatment_group, `treated', outcome, `outcome', mean, `mean', n, `obs', wboot, 1, estimation, NT, cohort, `cohort', controls, 1)
{txt} 27{com}.                 
.                 {c )-}
{txt} 28{com}.                 
.         {c )-}
{txt} 29{com}. 
.         restore
{txt} 30{com}. {c )-}
{txt}(0 observations deleted)
(0 observations deleted)
{err}Running event study for pila_salario_r
{res}{txt}{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
.........................................