{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Proyectos\Banrep research\PhysiciansPosgraduates\Logs\Rethus-Pila.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}21 May 2024, 12:12:27
{txt}
{com}. 
. 
. ****************************************************************************
. **#  1. Create each occupations dataset by merging with PILA
. ****************************************************************************
. 
. 
. 
. * Create empty dataset where each month will be appended recursively
. 
. use "${c -(}data{c )-}\P07_PILA_monthly.dta", clear
{txt}
{com}. 
. 
. *New variables
. rename  tipo_cotiz tipo_cotizante
{res}{txt}
{com}. 
. gen     pila_independientes = inlist(tipo_cotizante, 2, 3, 16, 41, 42, 59, 57, 66)                      
{txt}
{com}. gen     pila_posgrado_salud     = (tipo_cotizante == 21)        
{txt}
{com}. gen     pila_dependientes   = (pila_independientes != 1 & pila_posgrado_salud != 1)
{txt}
{com}. 
. foreach var of varlist salario_bas ibc_pens ibc_salud ibc_rprof ibc_ccf  {c -(}
{txt}  2{com}.         
.         rename `var' `var'_orig
{txt}  3{com}.         bys personabasicaid id: egen    `var' = max(`var'_orig) if (pila_dependientes == 1)
{txt}  4{com}.         bys personabasicaid id: replace `var' = `var'_orig if (pila_independientes == 1)
{txt}  5{com}.         
. {c )-}
{res}{txt}(3,169,103 missing values generated)
(2667642 real changes made)
{res}{txt}(3,169,103 missing values generated)
(2667642 real changes made)
{res}{txt}(3,169,103 missing values generated)
(2667642 real changes made)
{res}{txt}(3,169,103 missing values generated)
(2667642 real changes made)
{res}{txt}(3,169,103 missing values generated)
(2667642 real changes made)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD59b8_000000.tmp"
{txt}
{com}. g licen_mat1 = (licen_mat == "X")
{txt}
{com}. drop licen_mat
{txt}
{com}. rename licen_mat1 licen_mat
{res}{txt}
{com}. 
. *General incapacity
. g incap_gral1 = (incap_gral == "X")
{txt}
{com}. drop incap_gral
{txt}
{com}. rename incap_gral1 incap_gral
{res}{txt}
{com}. 
. *Days of incapacity
. replace incap_trab = 0 if incap_trab < 0
{txt}(0 real changes made)

{com}. rename incap_trab incap_dias
{res}{txt}
{com}. 
. drop salario_bas_orig ibc_pens_orig ibc_sal_orig ibc_rprof_orig ibc_ccf_orig
{err}variable {bf}ibc_sal_orig{sf} not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD59b8_000000.tmp"
{txt}
{com}. drop salario_bas_orig ibc_pens_orig ibc_salud_orig ibc_rprof_orig ibc_ccf_orig
{txt}
{com}. 
. *Minimum wage per year
. gen     mw = 461500  if (year == 2008)
{txt}(11,103,058 missing values generated)

{com}. replace mw = 496900  if (year == 2009)
{txt}(251,012 real changes made)

{com}. replace mw = 515000  if (year == 2010)
{txt}(318,780 real changes made)

{com}. replace mw = 535600  if (year == 2011)
{txt}(346,727 real changes made)

{com}. replace mw = 566700  if (year == 2012)
{txt}(419,877 real changes made)

{com}. replace mw = 589500  if (year == 2013)
{txt}(494,283 real changes made)

{com}. replace mw = 616000  if (year == 2014)
{txt}(569,476 real changes made)

{com}. replace mw = 644350  if (year == 2015)
{txt}(831,176 real changes made)

{com}. replace mw = 689455  if (year == 2016)
{txt}(932,330 real changes made)

{com}. replace mw = 737717  if (year == 2017)
{txt}(1,077,646 real changes made)

{com}. replace mw = 781242  if (year == 2018)
{txt}(1,190,636 real changes made)

{com}. replace mw = 828116  if (year == 2019)
{txt}(1,239,109 real changes made)

{com}. replace mw = 877803  if (year == 2020)
{txt}(1,197,689 real changes made)

{com}. replace mw = 908526  if (year == 2021)
{txt}(1,289,673 real changes made)

{com}. replace mw = 1000000 if (year == 2022)
{txt}(944,625 real changes made)

{com}. 
. *Minimum wage t-1
. gen     mw_1 = 461500  if (year == 2009)
{txt}(10,852,061 missing values generated)

{com}. replace mw_1 = 496900  if (year == 2010)
{txt}(318,780 real changes made)

{com}. replace mw_1 = 515000  if (year == 2011)
{txt}(346,727 real changes made)

{com}. replace mw_1 = 535600  if (year == 2012)
{txt}(419,877 real changes made)

{com}. replace mw_1 = 566700  if (year == 2013)
{txt}(494,283 real changes made)

{com}. replace mw_1 = 589500  if (year == 2014)
{txt}(569,476 real changes made)

{com}. replace mw_1 = 616000  if (year == 2015)
{txt}(831,176 real changes made)

{com}. replace mw_1 = 644350  if (year == 2016)
{txt}(932,330 real changes made)

{com}. replace mw_1 = 689455  if (year == 2017)
{txt}(1,077,646 real changes made)

{com}. replace mw_1 = 737717  if (year == 2018)
{txt}(1,190,636 real changes made)

{com}. replace mw_1 = 781242  if (year == 2019)
{txt}(1,239,109 real changes made)

{com}. replace mw_1 = 828116  if (year == 2020)
{txt}(1,197,689 real changes made)

{com}. replace mw_1 = 877803  if (year == 2021)
{txt}(1,289,673 real changes made)

{com}. replace mw_1 = 908526  if (year == 2022)
{txt}(944,625 real changes made)

{com}. replace mw_1 = 1000000 if (year == 2023)
{txt}(4 real changes made)

{com}. 
. egen    rowmax          = rowmax(ibc*)
{txt}(501,461 missing values generated)

{com}. replace rowmax          = mw if (rowmax >= mw_1 * 0.8 & rowmax < mw)            
{txt}(68,820 real changes made, 4 to missing)

{com}. replace rowmax          = rowmax / 0.4 if (pila_independientes == 1 & rowmax > mw)
{txt}(1,916,490 real changes made)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD59b8_000000.tmp"
{txt}
{com}. replace salario_bas = mw if (rowmax >= mw_1 * 0.8 & rowmax < mw)
{txt}(0 real changes made)

{com}. 
. egen    pila_salario = rowmax(rowmax salario_bas)
{txt}(501,461 missing values generated)

{com}. replace pila_salario = .  if (pila_posgrado_salud == 1)
{txt}(0 real changes made)

{com}. lab var pila_salario    "Salario nominal"
{txt}
{com}. drop    rowmax
{txt}
{com}. 
. gen             pila_salario_max = pila_salario
{txt}(501,461 missing values generated)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD59b8_000000.tmp"
{txt}
{com}. merge m:1 year month using "\\sm037577\D\Proyectos\Banrep research\c_2018_SSO Servicio Social Obligatorio\Project SSO Training\Data\IPC mensual", keepusing(IPC) keep(1 3) nogen
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}      11,103,073{txt}  
{col 5}{hline 41}

{com}. 
. *Generate real wages (base 2018m12)
. global vars pila_salario pila_salario_max
{txt}
{com}. 
. foreach var in $vars {c -(}
{txt}  2{com}.         
.         gen     `var'_r = (`var' / IPC) * 100
{txt}  3{com}.         replace `var'_r = . if mi(`var')
{txt}  4{com}.         
. {c )-}
{txt}(501,461 missing values generated)
(0 real changes made)
(501,461 missing values generated)
(0 real changes made)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD59b8_000000.tmp"
{txt}
{com}. * Remove duplicates of contributions with same company
. gduplicates drop personabasicaid id if pila_dependientes == 1, force

{p 0 4}{txt}Duplicates in terms of {res} personabasicaid id{p_end}
{txt}{res}
{txt}(7,531,942 observations deleted)

{com}. 
. bys personabasicaid: gen nro_cotizaciones = _N
{txt}
{com}.         
. * Since people may have more than one contribution each month, sum the wages of each contribution and keep the max of worked days. 
. foreach var of varlist pila_salario_r {c -(}
{txt}  2{com}.         
.   bys personabasicaid: ereplace `var'                            = total(`var')
{txt}  3{com}.   bys personabasicaid: egen     `var'_dependientes       = total(`var') if (pila_dependientes == 1)
{txt}  4{com}.   bys personabasicaid: egen     `var'_independientes = total(`var') if (pila_independientes == 1)
{txt}  5{com}.   
. {c )-}
{txt}(3,565,653 real changes made)
(3,169,103 missing values generated)
(903,489 missing values generated)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD59b8_000000.tmp"
{txt}
{com}. foreach var of varlist sal_dias_cot pila_dependientes pila_independientes pila_posgrado_salud pila_salario_max_r incap_dias incap_gral licen_mat {c -(}
{txt}  2{com}.   bys personabasicaid: ereplace `var' = max(`var')
{txt}  3{com}. {c )-}
{txt}(477,270 real changes made)
(3,048,039 real changes made)
(791,424 real changes made)
(852,239 real changes made)
(1,040 missing values generated)
(1040 missing values generated)
(3,475,834 real changes made)
(23,293 real changes made)
(151,903 real changes made)
(56,470 real changes made)

{com}. 
. replace sal_dias_cot = 30 if (sal_dias_cot > 30 & !mi(sal_dias_cot))
{txt}(450 real changes made)

{com}. 
. gsort personabasicaid tipo_cotizante
{txt}
{com}. 
. gduplicates drop personabasicaid, force

{p 0 4}{txt}Duplicates in terms of {res} personabasicaid{p_end}
{txt}{res}
{txt}(3,477,187 observations deleted)

{com}. 
. tostring ciudad_cod depto_cod, replace
{txt}ciudad_cod was {res:double} now {res:str3}
depto_cod was {res:double} now {res:str2}

{com}. 
. replace ciudad_cod      = "00" + ciudad_cod if (length(ciudad_cod) == 1 & ciudad_cod != ".")
{txt}(75,996 real changes made)

{com}. replace ciudad_cod      = "0" + ciudad_cod      if (length(ciudad_cod) == 2 & ciudad_cod != ".")
{txt}(1,637 real changes made)

{com}. 
. replace depto_cod       = "0" + depto_cod       if (length(depto_cod) == 1 & depto_cod != ".")
{txt}(21,273 real changes made)

{com}. 
. gen pila_cod_mun        = depto_cod + ciudad_cod
{txt}
{com}. 
. *Keep relevant variables
. keep personabasicaid fecha_pila year month sexomode fechantomode *_r    ///
> pila_independientes pila_dependientes pila_cod_mun id                                   ///
> sal_dias_cot *dependientes *independientes nro_cotizaciones                     ///
> pila_posgrad_salud rethus_sexo rethus_posgrado year_posgrado                    ///
> fechalicenciapregrado year_licencia fechapregrado year_grado                    ///
> rethus_fechagradopos1 year_posgrado rethus_codigoperfilpos1                     ///
> rethus_perfilpos1 tipo_cotiz rethus_codigoperfilpre1                                    ///
> pila_salario_max_r incap_dias incap_gral licen_mat
{err}variable {bf}pila_posgrad_salud{sf} not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD59b8_000000.tmp"
{txt}
{com}. keep personabasicaid fecha_pila year month sexomode fechantomode *_r    ///
> pila_independientes pila_dependientes pila_cod_mun id                                   ///
> sal_dias_cot *dependientes *independientes nro_cotizaciones                     ///
> pila_posgrado_salud rethus_sexo rethus_posgrado year_posgrado                   ///
> fechalicenciapregrado year_licencia fechapregrado year_grado                    ///
> rethus_fechagradopos1 year_posgrado rethus_codigoperfilpos1                     ///
> rethus_perfilpos1 tipo_cotiz rethus_codigoperfilpre1                                    ///
> pila_salario_max_r incap_dias incap_gral licen_mat
{err}variable {bf}rethus_sexo{sf} not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD59b8_000000.tmp"
{txt}
{com}. keep personabasicaid fecha_pila year month sexomode fechantomode *_r    ///
> pila_independientes pila_dependientes pila_cod_mun id                                   ///
> sal_dias_cot *dependientes *independientes nro_cotizaciones                     ///
> pila_posgrado_salud year_posgrado                       ///
> fechalicenciapregrado year_licencia fechapregrado year_grado                    ///
> rethus_fechagradopos1 year_posgrado rethus_codigoperfilpos1                     ///
> rethus_perfilpos1 tipo_cotiz rethus_codigoperfilpre1                                    ///
> pila_salario_max_r incap_dias incap_gral licen_mat
{err}variable {bf}year_posgrado{sf} not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD59b8_000000.tmp"
{txt}
{com}. keep personabasicaid fecha_pila year month sexomode fechantomode *_r    ///
> pila_independientes pila_dependientes pila_cod_mun id                                   ///
> sal_dias_cot *dependientes *independientes nro_cotizaciones                     ///
> pila_posgrado_salud tipo_cotiz pila_salario_max_r incap_dias incap_gral ///
> licen_mat
{txt}
{com}. 
{txt}end of do-file

{com}. doedit "C:\Proyectos\Banrep research\Health_shocks_and_labor\Dofiles\Step 3 - Event study estimation tables.do"

. do "C:\Proyectos\Banrep research\Health_shocks_and_labor\Dofiles\Step 3 - Event study estimation tables.do"
{txt}
{com}. /*      
>         Creation date: 28/02/2024
>         Author: Naomi Calle
>         
>         Description: This do-file conducts the event study analysis for depression.
>         Instead of using the monthly dummies, it utilizes collapsed versions of those
>         dummies to make it shorter for presentation. Finally, it generates the
>         corresponding tables.
> */
. 
. * Working directory
. if "`c(hostname)'" == "SM201439" {c -(}      
.         global pc "C:"  
. {c )-}
{txt}
{com}. 
. else {c -(}
.         global pc "\\sm093119"
. {c )-}
{txt}
{com}. 
. /* Remove and create the results folder
> shell rmdir "$pc\Proyectos\Banrep research\Health_shocks_and_labor\Results" /s
> cap rm "$pc\Proyectos\Banrep research\Health_shocks_and_labor\Results.7z"*/
. cap mkdir "$pc\Proyectos\Banrep research\Health_shocks_and_labor\Results"
{txt}
{com}. 
. global cddofiles "$pc\Proyectos\Banrep research\Health_shocks_and_labor\Dofiles"
{txt}
{com}. global cddata "$pc\Proyectos\Banrep research\Health_shocks_and_labor\Data"
{txt}
{com}. global cdgraphs "$pc\Proyectos\Banrep research\Health_shocks_and_labor\Figures"
{txt}
{com}. global cdtables "$pc\Proyectos\Banrep research\Health_shocks_and_labor\Tables"
{txt}
{com}. global cdresults "$pc\Proyectos\Banrep research\Health_shocks_and_labor\Results"
{txt}
{com}. 
. 
. cd "${c -(}cddata{c )-}"
{res}C:\Proyectos\Banrep research\Health_shocks_and_labor\data
{txt}
{com}. 
. ********************************************************************************
. **#                        1. Processing data
. ********************************************************************************
. ** Identify number of consultations
. use "contacts_ED_O_merged/Depression_3yeargap_AllOutpatient", clear
{txt}
{com}. 
. * Generate consultation variables
. gen cons_psico = substr(cod_consul, 5, 2) == "08"
{txt}
{com}. gen cons_traba_social = substr(cod_consul, 5, 2) == "09"
{txt}
{com}. gen cons_psiquiatria = substr(cod_consul, 5, 2) == "84"
{txt}
{com}. gen cons_mental = max(cons_psico, cons_traba_social, cons_psiquiatria)
{txt}
{com}. gen cons_especialista = substr(cod_consul, 5, 2) == "02"
{txt}
{com}. gen cons = 1
{txt}
{com}. gen cons_NoMental = cons_mental == 0
{txt}
{com}. gen cons_lowback = cod_diag == "M545"
{txt}
{com}. gen cons_hypo = cod_diag == "E039"
{txt}
{com}. 
. gen month_pila = mofd(date_consul)
{txt}
{com}. format month_pila %tm
{txt}
{com}. 
. * Count consultations per person and month
. collapse (sum) cons*, by(personabasicaid month_pila)
{res}{txt}
{com}. 
. * Managing outliers: winsorizing 
. sum cons, d

                         {txt}(sum) cons
{hline 61}
      Percentiles      Smallest
 1%    {res}        1              1
{txt} 5%    {res}        1              1
{txt}10%    {res}        1              1       {txt}Obs         {res}  1,845,405
{txt}25%    {res}        1              1       {txt}Sum of wgt. {res}  1,845,405

{txt}50%    {res}        1                      {txt}Mean          {res} 1.751883
                        {txt}Largest       Std. dev.     {res} 1.385639
{txt}75%    {res}        2             90
{txt}90%    {res}        3             92       {txt}Variance      {res} 1.919995
{txt}95%    {res}        4            103       {txt}Skewness      {res}  6.70058
{txt}99%    {res}        7            140       {txt}Kurtosis      {res} 192.0296
{txt}
{com}. replace cons = r(p99) if cons > r(p99)
{txt}(13,701 real changes made)

{com}. 
. sum cons_especialista, d

                   {txt}(sum) cons_especialista
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}  1,845,405
{txt}25%    {res}        0              0       {txt}Sum of wgt. {res}  1,845,405

{txt}50%    {res}        0                      {txt}Mean          {res} .4181917
                        {txt}Largest       Std. dev.     {res} .8507533
{txt}75%    {res}        1             55
{txt}90%    {res}        1             60       {txt}Variance      {res} .7237812
{txt}95%    {res}        2             66       {txt}Skewness      {res} 6.676672
{txt}99%    {res}        3             68       {txt}Kurtosis      {res} 178.7626
{txt}
{com}. replace cons_especialista = r(p99) if cons_especialista > r(p99)
{txt}(17,671 real changes made)

{com}. 
. tempfile temp_consultations
{txt}
{com}. save `temp_consultations'
{txt}{p 0 4 2}
file {bf}
C:\Users\pmede1\AppData\Local\Temp\ST_59b8_000001.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. * Merge outpatient data to PILA panel
. use personabasicaid id_event ibc* dias* num_jobs id month* date eps_cod treatment simul preg_3ybef licen_mat_3ybef depto mun using "contacts_ED_O_merged/Depression_3yeargap_panel", clear
{txt}
{com}. 
. keep if max(preg_3ybef, licen_mat_3ybef) == 0
{txt}(665,016 observations deleted)

{com}. 
. gen cod_muni = depto * 1000 + mun
{txt}(2,035,791 missing values generated)

{com}. drop preg_3ybef licen_mat_3ybef depto mun
{txt}
{com}. 
. merge m:1 personabasicaid month_pila using `temp_consultations', keep(1 3) nogen
{res}{txt}{p 0 7 2}
(variable
{bf:month_pila} was {bf:int}, now {bf:float} to accommodate using data's values)
{p_end}

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       5,464,763
{txt}{col 9}from master{col 30}{res}       5,464,763{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}Matched{col 30}{res}       1,734,385{txt}  
{col 5}{hline 41}

{com}. 
. * PILA outcomes
. gen formal = (ibc_real_miss != . & dias != .)
{txt}
{com}. gen daily_wage = ibc_real_miss/dias
{txt}(2,346,534 missing values generated)

{com}. 
. 
. * Job transitions
. bys id_event (month_pila): gen job_loss = id[_n] == . & id[_n-1] != . & _n > 1
{txt}
{com}. bys id_event (month_pila): gen job_gain = id[_n] != . & id[_n-1] == . & _n > 1
{txt}
{com}. bys id_event (month_pila): gen job_change = id[_n] != id[_n-1] & id[_n] != . & id[_n-1] != . & _n > 1
{txt}
{com}. 
. * Last six months
. tsset id_event month_pila
{res}
{col 1}{txt:Panel variable: }{res:id_event}{txt: (strongly balanced)}
{p 1 16 2}{txt:Time variable: }{res:month_pila}{txt:, }{res:{bind:588}}{txt: to }{res:{bind:719}}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. 
. gen job_loss_6m = max(job_loss, l.job_loss, l2.job_loss, l3.job_loss, l4.job_loss, l5.job_loss) 
{txt}
{com}. gen job_gain_6m = max(job_gain, l.job_gain, l2.job_gain, l3.job_gain, l4.job_gain, l5.job_gain) 
{txt}
{com}. gen job_change_6m = max(job_change, l.job_change, l2.job_change, l3.job_change, l4.job_change, l5.job_change) 
{txt}
{com}. 
. 
. * Replace health insurer missing values with the last non-missing value by id_event
. bys id_event (month_pila): replace eps_cod = eps_cod[_n-1] if mi(eps_cod)
{txt}(2,030,278 real changes made)

{com}. bys id_event (month_pila): gen eps_change = eps_cod[_n] != eps_cod[_n-1] & eps_cod[_n-1] != "" & eps_cod[_n] != "" & _n > 1
{txt}
{com}. 
. foreach var of varlist dias* {c -(}
{txt}  2{com}.         gen `var'_miss = `var'
{txt}  3{com}.         replace `var' = 0 if mi(`var')
{txt}  4{com}. {c )-}
{txt}(2,035,302 missing values generated)
(2,035,302 real changes made)
(2,035,302 missing values generated)
(2,035,302 real changes made)
(2,035,302 missing values generated)
(2,035,302 real changes made)
(2,035,302 missing values generated)
(2,035,302 real changes made)
(2,035,302 missing values generated)
(2,035,302 real changes made)
(2,035,302 missing values generated)
(2,035,302 real changes made)

{com}. 
. gen full_time = dias + dias_incap_trab + dias_vacac + dias_incap_gral + dias_licen_mat >= 30
{txt}
{com}. 
. * Consultation extensive margin (probability)
. foreach var of varlist cons* {c -(}
{txt}  2{com}.         replace `var' = 0 if mi(`var')  
{txt}  3{com}.         gen pr_`var' = `var' > 0
{txt}  4{com}. {c )-}
{txt}(5,464,763 real changes made)
(5,464,763 real changes made)
(5,464,763 real changes made)
(5,464,763 real changes made)
(5,464,763 real changes made)
(5,464,763 real changes made)
(5,464,763 real changes made)
(5,464,763 real changes made)
(5,464,763 real changes made)

{com}. 
. * Get individuals characteristics
. merge m:1 personabasicaid using "PILA/Formal_workers_2009", keep(1 3) keepusing(yearmode sexomode) nogen        
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}       7,199,148{txt}  
{col 5}{hline 41}

{com}. 
. * Restrict to period of interest
. drop if month_event < ym(2012, 1) | month_event > ym(2017, 12)
{txt}(2,354,220 observations deleted)

{com}. drop if month_pila < ym(2010, 1)
{txt}(440,448 observations deleted)

{com}. 
. * Restrict age
. gen age_at_event = yofd(dofm(month_event))-real(yearmode)
{txt}
{com}. keep if inrange(age_at_event, 18, 62)
{txt}(148,200 observations deleted)

{com}. drop yearmode
{txt}
{com}. 
. gen dist = month_pila - month_event
{txt}
{com}. egen month_by_t = group(month_pila treatment)
{res}{txt}
{com}. 
. * Get quarterly number of cases in the municipality
. // This data is generated in Step 4, so if it have not been run, comment this or
. // run Step 4 first. For now we are just exploring
. gen quarter_event = qofd(date_event)
{txt}
{com}. merge m:1 cod_muni quarter_event using "contacts_ED_O_merged\number_cases_muni_quarter", keep(1 3) nogen
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       1,250,356
{txt}{col 9}from master{col 30}{res}       1,250,356{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}Matched{col 30}{res}       3,005,924{txt}  
{col 5}{hline 41}

{com}. 
. * Keep the number of cases for the specific quarter of event
. replace cases = 0 if dist != 0
{txt}(4,220,811 real changes made)

{com}. bys id_event: ereplace cases = max(cases)
{txt}(3,136,627 real changes made)

{com}. replace cases = 0 if mi(cases)
{txt}(0 real changes made)

{com}. 
. * Generate event dummies
. gen pre_ = dist < -24
{txt}
{com}. gen pre6 = inrange(dist, -24, -19)
{txt}
{com}. gen pre5 = inrange(dist, -18, -13)
{txt}
{com}. gen pre4 = inrange(dist, -12, -7)
{txt}
{com}. gen pre3 = inrange(dist, -6, -4)
{txt}
{com}. gen pre2 = inrange(dist, -3, -2)
{txt}
{com}. gen pre1 = 0
{txt}
{com}. 
. gen pos0 = dist == 0
{txt}
{com}. gen pos1 = inrange(dist, 1, 3)
{txt}
{com}. gen pos2 = inrange(dist, 4, 6)
{txt}
{com}. gen pos3 = inrange(dist, 7, 12)
{txt}
{com}. gen pos4 = inrange(dist, 13, 18)
{txt}
{com}. gen pos5 = inrange(dist, 19, 24)
{txt}
{com}. gen pos_ = dist > 24
{txt}
{com}. 
. 
. * Generate event dummies interacted with treatment
. gen byte inter_pre = pre_ * treatment
{txt}
{com}. forval x = 6(-1)1 {c -(}
{txt}  2{com}.         gen byte inter_pre`x' = pre`x' * treatment
{txt}  3{com}. {c )-}
{txt}
{com}. 
. forval x = 0/5 {c -(}
{txt}  2{com}.         gen byte inter_pos`x' = pos`x' * treatment
{txt}  3{com}. {c )-}
{txt}
{com}. gen byte inter_pos = pos_ *  treatment
{txt}
{com}. 
. compress
  {txt}variable {bf}{res}month_pila{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}formal{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}job_loss{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}job_gain{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}job_change{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}job_loss_6m{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}job_gain_6m{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}job_change_6m{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}eps_change{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}dias_incap_trab_miss{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}dias_miss{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}dias_vacac_miss{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}dias_susp_temp_miss{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}dias_incap_gral_miss{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}dias_licen_mat_miss{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}full_time{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pr_cons_psico{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pr_cons_traba_social{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pr_cons_psiquiatria{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pr_cons_mental{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pr_cons_especialista{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pr_cons{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pr_cons_NoMental{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pr_cons_lowback{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pr_cons_hypo{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}age_at_event{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}dist{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}month_by_t{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}quarter_event{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}pre_{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pre6{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pre5{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pre4{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pre3{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pre2{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pre1{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pos0{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pos1{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pos2{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pos3{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pos4{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pos5{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}pos_{sf}{txt} was {bf}{res}float{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}cons_psico{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}cons_traba_social{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}cons_psiquiatria{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}cons_mental{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}cons_especialista{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}cons{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}cons_NoMental{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}int{sf}
  {txt}variable {bf}{res}cons_lowback{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
  {txt}variable {bf}{res}cons_hypo{sf}{txt} was {bf}{res}double{sf}{txt} now {bf}{res}byte{sf}
{txt}  (800,180,640 bytes saved)

{com}. 
. * Labels
. lab var ibc_real "Monthly labor earnings (zeros)"
{txt}
{com}. lab var ibc_real_miss "Monthly labor earnings (miss)"
{txt}
{com}. lab var job_loss "Job loss"
{txt}
{com}. lab var job_gain "Job gain"
{txt}
{com}. lab var job_change "Job-to-job"
{txt}
{com}. lab var job_loss_6m "Job loss (last 6 months)"
{txt}
{com}. lab var job_gain_6m "Job gain (last 6 months)"
{txt}
{com}. lab var job_change_6m "Job-to-job (last 6 months)"
{txt}
{com}. lab var formal "Wage earner"
{txt}
{com}. lab var daily_wage "Daily wage"
{txt}
{com}. lab var num_jobs "Number of jobs"
{txt}
{com}. lab var full_time "Full-time"
{txt}
{com}. lab var eps_change "Health insurer change"
{txt}
{com}. 
. lab var dias "Worked days (zeros)"
{txt}
{com}. lab var dias_vacac "Vacation days (zeros)"
{txt}
{com}. lab var dias_susp_temp "Temporal suspension days (zeros)"
{txt}
{com}. lab var dias_incap_gral "Non-labor sick leave days (zeros)"
{txt}
{com}. lab var dias_incap_trab "Labor sick leave days (zeros)"
{txt}
{com}. lab var dias_licen_mat "Maternity leave days (zeros)"
{txt}
{com}. 
. lab var dias_miss "Worked days (miss)"
{txt}
{com}. lab var dias_vacac_miss "Vacation days (miss)"
{txt}
{com}. lab var dias_susp_temp_miss "Temporal suspension days (miss)"
{txt}
{com}. lab var dias_incap_gral_miss "Non-labor sick leave days (miss)"
{txt}
{com}. lab var dias_incap_trab_miss "Labor sick leave days (miss)"
{txt}
{com}. lab var dias_licen_mat_miss "Maternity leave days (miss)"
{txt}
{com}. 
. lab var cons "Num. outpatient visits"
{txt}
{com}. lab var cons_mental "Num. outpatient visits with a mental health specialist"
{txt}
{com}. lab var cons_especialista "Num. outpatient visits with other specialist"
{txt}
{com}. lab var cons_psico "Num. outpatient visits with a psychologist"
{txt}
{com}. lab var cons_psiquiatria "Num. outpatient visits with a psychiatrist"
{txt}
{com}. lab var cons_traba_social "Num. outpatient visits with a social worker"
{txt}
{com}. lab var cons_NoMental "Num. outpatient visits excluding a mental health specialist"
{txt}
{com}. lab var cons_lowback "Num. outpatient visits for low back pain"
{txt}
{com}. lab var cons_hypo "Num. outpatient visits for hypothyroidism"
{txt}
{com}. 
. lab var pr_cons "Pr. outpatient visit"
{txt}
{com}. lab var pr_cons_mental "Pr. outpatient visit with a mental health specialist"
{txt}
{com}. lab var pr_cons_especialista "Pr. outpatient visits with a specialist"
{txt}
{com}. lab var pr_cons_psico "Pr. outpatient visit with a psychologist"
{txt}
{com}. lab var pr_cons_psiquiatria "Pr. outpatient visit with a psychiatrist"
{txt}
{com}. lab var pr_cons_traba_social "Pr. outpatient visit with a social worker"
{txt}
{com}. lab var pr_cons_NoMental "Pr. outpatient visit excluding a mental health specialist"
{txt}
{com}. lab var pr_cons_lowback "Pr. outpatient visit for low back pain"
{txt}
{com}. lab var pr_cons_hypo "Pr. outpatient visit for hypothyroidism"
{txt}
{com}.         
.         
. 
. ********************************************************************************
. **#                        2. Regression tables
. ********************************************************************************
. *************************
. * Main estimation table
. *************************
. * Locals to restrict regressions by gender, age and type of coefficient
. local lsexF & sexomode == 0
{txt}
{com}. local lsexM & sexomode == 1
{txt}
{com}. 
. local lAge18_62 "18, 62"
{txt}
{com}. local lAge18_34 "18, 34"
{txt}
{com}. local lAge35_50 "35, 50"
{txt}
{com}. 
. local dummy_type1 "singleEvents"
{txt}
{com}. local dummy_type2 "inter"
{txt}
{com}. 
. local nrow1 "All"
{txt}
{com}. local nrow2 "Young"
{txt}
{com}. local nrow3 "Elder"
{txt}
{com}. local nrow4 "Males"
{txt}
{com}. local nrow5 "Young males"
{txt}
{com}. local nrow6 "Elder males"
{txt}
{com}. local nrow7 "Females"
{txt}
{com}. local nrow8 "Young females"
{txt}
{com}. local nrow9 "Elder females"
{txt}
{com}.         
. * L1. Loop across gender
. local r = 1
{txt}
{com}. foreach sex in "All" "M" "F" {c -(}
{txt}  2{com}.         
.         * L2. Loop across age groups
.         foreach age in "Age18_62" "Age18_34" "Age35_50" {c -(}               
{txt}  3{com}.                 
.                 cap reghdfe ibc_real pre* pos* inter* if inrange(age_at_event, `l`age'') `lsex`sex'', abs(month_by_t id_event) vce(cl persona)
{txt}  4{com}.                 matrix reg = r(table)
{txt}  5{com}.                 
.                 * Observations
.                 local obs`r' : di %15.0fc e(N)/120
{txt}  6{com}.                 local obs`r' = strtrim("`obs_`r''")
{txt}  7{com}.                 
.                 * L5. Two tables per type of variables: single events and interacted with treatment
.                 forval a = 1/2 {c -(}
{txt}  8{com}.                         
.                         if `a' == 1 {c -(}
{txt}  9{com}.                                 ds pre* pos*
{txt} 10{com}.                                 global dummies `r(varlist)'
{txt} 11{com}.                         {c )-}
{txt} 12{com}.                         
.                         if `a' == 2 {c -(}
{txt} 13{com}.                                 ds inter*
{txt} 14{com}.                                 global dummies `r(varlist)'
{txt} 15{com}.                         {c )-}
{txt} 16{com}.                 
.                         * L6. Store locals for each coefficient to print in the table
.                         local c = 1
{txt} 17{com}.                         foreach d of global dummies {c -(}
{txt} 18{com}.                                 
.                                 if "`d'" != "pre_" & "`d'" != "inter_pre" {c -(}
{txt} 19{com}.                                         
.                                         dis in red "`d'"
{txt} 20{com}.                                         
.                                         * Coefficient and SE format
.                                         local B_`r'_`a'`c': di %8.2f _b[`d']
{txt} 21{com}.                                         local se_`r'_`a'`c': di %8.2f _se[`d']
{txt} 22{com}.                                         local se_`r'_`a'`c' = strtrim("`se_`r'_`a'`c''")
{txt} 23{com}.                                         local se_`r'_`a'`c' = "(`se_`r'_`a'`c'')"       
{txt} 24{com}.                                         
.                                         * Add significance to coefficients
.                                         local pv: di %10.5fc reg["pvalue", "`d'"]
{txt} 25{com}.                                         
.                                         if `pv' < 0.1 {c -(}
{txt} 26{com}.                                                 local B_`r'_`a'`c' = "`B_`r'_`a'`c''*"
{txt} 27{com}.                                         {c )-}
{txt} 28{com}.                                         
.                                         if `pv' < 0.05 {c -(}
{txt} 29{com}.                                                 local B_`r'_`a'`c' = "`B_`r'_`a'`c''*"
{txt} 30{com}.                                         {c )-}
{txt} 31{com}.                                         
.                                         if `pv' < 0.01 {c -(}
{txt} 32{com}.                                                 local B_`r'_`a'`c' = "`B_`r'_`a'`c''*"
{txt} 33{com}.                                         {c )-}
{txt} 34{com}.                                         
.                                         local c = `c' + 1
{txt} 35{com}.                                 {c )-}
{txt} 36{com}.                         {c )-}
{txt} 37{com}.                 {c )-}
{txt} 38{com}.                         
.                 * Store and format mean in t-1
.                 sum ibc_real if dist == -1 & inrange(age_at_event, `l`age'') `lsex`sex''
{txt} 39{com}.                 local mean_`r' : di %8.2f r(mean)
{txt} 40{com}.                 
.                 local r = `r' + 1
{txt} 41{com}.         {c )-}
{txt} 42{com}. {c )-}
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}     35,469    738.6709    1022.146          0   7842.213
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}      7,219    656.9367    748.9142          0   7728.022
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}     17,890     781.533    1038.526          0   7764.625
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}     12,924    813.9683    1139.384          0   7842.213
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}      2,647    668.7818    810.2575          0    7670.17
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}      6,312    851.5496    1135.262          0   7764.625
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}     22,545    695.5065    945.7527          0   7842.213
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}      4,572    650.0789    710.9861          0   7728.022
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}     11,578    743.3619    979.7287          0   7764.625
{txt}
{com}. 
.         
. * L. One table per each type of coefficient
. forval a = 1/2 {c -(}
{txt}  2{com}.         
.         ***************
.         * Latex table
.         ***************
.         texdoc init "$cdresults\ES_earnings_hetSexAge_`dummy_type`a''.tex", force replace
{txt}  3{com}. 
.         tex \begin{c -(}tabular{c )-}{c -(}lccccccccccccc{c )-} 
{txt}  4{com}.         tex \hline \hline
{txt}  5{com}.         tex  & [-24, -19] & [-18, -13] & [-12, -7] & [-6, -4] & [-3, -2] & 0 & [1, 3] & [4, 6] & [7, 12] & [13, 18] & [19, 24] & Mean t-1 & Obs. \\
{txt}  6{com}.         tex \midrule
{txt}  7{com}.         tex  &  & \\
{txt}  8{com}. 
.         forval r = 1/9 {c -(}
{txt}  9{com}.                                 
.                 tex `nrow`r''  & `B_`r'_`a'1' & `B_`r'_`a'2' & `B_`r'_`a'3' & `B_`r'_`a'4' & `B_`r'_`a'5' & `B_`r'_`a'7' & `B_`r'_`a'8' & `B_`r'_`a'9' & `B_`r'_`a'10' & `B_`r'_`a'11' & `B_`r'_`a'12' & `mean_`r'' & `obs`r'' \\
{txt} 10{com}.                 
.                 tex        & `se_`r'_`a'1' & `se_`r'_`a'2' & `se_`r'_`a'3' & `se_`r'_`a'4' & `se_`r'_`a'5' & `se_`r'_`a'7' & `se_`r'_`a'8' & `se_`r'_`a'9' & `se_`r'_`a'10' & `se_`r'_`a'11' & `se_`r'_`a'12' \\ \vspace{c -(}2mm{c )-}\\
{txt} 11{com}.         {c )-}
{txt} 12{com}.         
.         tex \bottomrule \\
{txt} 13{com}.         tex \end{c -(}tabular{c )-}
{txt} 14{com}. 
.         texdoc close
{txt} 15{com}. {c )-}
{res}{txt}(texdoc output file is C:\Proyectos\Banrep research\Health_shocks_and_labor\Results\ES_earnings_hetSexAge_singleEvents.tex)
{res}{txt}(texdoc output written to {browse `"C:\Proyectos\Banrep research\Health_shocks_and_labor\Results\ES_earnings_hetSexAge_singleEvents.tex"':C:\Proyectos\Banrep research\Health_shocks_and_labor\Results\ES_earnings_hetSexAge_singleEvents.tex})
{res}{txt}(texdoc output file is C:\Proyectos\Banrep research\Health_shocks_and_labor\Results\ES_earnings_hetSexAge_inter.tex)
{res}{txt}(texdoc output written to {browse `"C:\Proyectos\Banrep research\Health_shocks_and_labor\Results\ES_earnings_hetSexAge_inter.tex"':C:\Proyectos\Banrep research\Health_shocks_and_labor\Results\ES_earnings_hetSexAge_inter.tex})
{res}{txt}
{com}. 
. 
. 
. *******************************************************************
. * Restricting to the number of cases (municipality-quarter level)
. *******************************************************************
. local cond1 & cases > 1
{txt}
{com}. local cond2 & cases <= 1
{txt}
{com}. 
. forval n = 1/2 {c -(}
{txt}  2{com}.         
.         * L1. Loop across gender
.         local r = 1
{txt}  3{com}.         foreach sex in "All" "M" "F" {c -(}
{txt}  4{com}.                 
.                 * L2. Loop across age groups
.                 foreach age in "Age18_62" "Age18_34" "Age35_50" {c -(}               
{txt}  5{com}.                         
.                         cap reghdfe ibc_real pre* pos* inter* if inrange(age_at_event, `l`age'') `lsex`sex'' `cond`n'', abs(month_by_t id_event) vce(cl persona)
{txt}  6{com}.                         matrix reg = r(table)
{txt}  7{com}.                         
.                         * Observations
.                         local obs`r' : di %15.0fc e(N)/120
{txt}  8{com}.                         local obs`r' = strtrim("`obs_`r''")
{txt}  9{com}.                         
.                         * L5. Two tables per type of variables: single events and interacted with treatment
.                         forval a = 1/2 {c -(}
{txt} 10{com}.                                 
.                                 if `a' == 1 {c -(}
{txt} 11{com}.                                         ds pre* pos*
{txt} 12{com}.                                         global dummies `r(varlist)'
{txt} 13{com}.                                 {c )-}
{txt} 14{com}.                                 
.                                 if `a' == 2 {c -(}
{txt} 15{com}.                                         ds inter*
{txt} 16{com}.                                         global dummies `r(varlist)'
{txt} 17{com}.                                 {c )-}
{txt} 18{com}.                         
.                                 * L6. Store locals for each coefficient to print in the table
.                                 local c = 1
{txt} 19{com}.                                 foreach d of global dummies {c -(}
{txt} 20{com}.                                         
.                                         if "`d'" != "pre_" & "`d'" != "inter_pre" {c -(}
{txt} 21{com}.                                                 
.                                                 dis in red "`d'"
{txt} 22{com}.                                                 
.                                                 * Coefficient and SE format
.                                                 local B_`r'_`a'`c': di %8.2f _b[`d']
{txt} 23{com}.                                                 local se_`r'_`a'`c': di %8.2f _se[`d']
{txt} 24{com}.                                                 local se_`r'_`a'`c' = strtrim("`se_`r'_`a'`c''")
{txt} 25{com}.                                                 local se_`r'_`a'`c' = "(`se_`r'_`a'`c'')"       
{txt} 26{com}.                                                 
.                                                 * Add significance to coefficients
.                                                 local pv: di %10.5fc reg["pvalue", "`d'"]
{txt} 27{com}.                                                 
.                                                 if `pv' < 0.1 {c -(}
{txt} 28{com}.                                                         local B_`r'_`a'`c' = "`B_`r'_`a'`c''*"
{txt} 29{com}.                                                 {c )-}
{txt} 30{com}.                                                 
.                                                 if `pv' < 0.05 {c -(}
{txt} 31{com}.                                                         local B_`r'_`a'`c' = "`B_`r'_`a'`c''*"
{txt} 32{com}.                                                 {c )-}
{txt} 33{com}.                                                 
.                                                 if `pv' < 0.01 {c -(}
{txt} 34{com}.                                                         local B_`r'_`a'`c' = "`B_`r'_`a'`c''*"
{txt} 35{com}.                                                 {c )-}
{txt} 36{com}.                                                 
.                                                 local c = `c' + 1
{txt} 37{com}.                                         {c )-}
{txt} 38{com}.                                 {c )-}
{txt} 39{com}.                         {c )-}
{txt} 40{com}.                                 
.                         * Store and format mean in t-1
.                         sum ibc_real if dist == -1 & inrange(age_at_event, `l`age'') `lsex`sex'' `cond`n''
{txt} 41{com}.                         local mean_`r' : di %8.2f r(mean)
{txt} 42{com}.                         
.                         local r = `r' + 1
{txt} 43{com}.                 {c )-}
{txt} 44{com}.         {c )-}
{txt} 45{com}. 
.         
.         * L. One table per each type of coefficient
.         forval a = 1/2 {c -(}
{txt} 46{com}.                 
.                 ***************
.                 * Latex table
.                 ***************
.                 texdoc init "$cdresults\ES_earnings_hetSexAge_Cases`n'_`dummy_type`a''.tex", force replace
{txt} 47{com}. 
.                 tex \begin{c -(}tabular{c )-}{c -(}lccccccccccccc{c )-} 
{txt} 48{com}.                 tex \hline \hline
{txt} 49{com}.                 tex  & [-24, -19] & [-18, -13] & [-12, -7] & [-6, -4] & [-3, -2] & 0 & [1, 3] & [4, 6] & [7, 12] & [13, 18] & [19, 24] & Mean t-1 & Obs. \\
{txt} 50{com}.                 tex \midrule
{txt} 51{com}.                 tex  &  & \\
{txt} 52{com}. 
.                 forval r = 1/9 {c -(}
{txt} 53{com}.                                         
.                         tex `nrow`r''  & `B_`r'_`a'1' & `B_`r'_`a'2' & `B_`r'_`a'3' & `B_`r'_`a'4' & `B_`r'_`a'5' & `B_`r'_`a'7' & `B_`r'_`a'8' & `B_`r'_`a'9' & `B_`r'_`a'10' & `B_`r'_`a'11' & `B_`r'_`a'12' & `mean_`r'' & `obs`r'' \\
{txt} 54{com}.                         
.                         tex        & `se_`r'_`a'1' & `se_`r'_`a'2' & `se_`r'_`a'3' & `se_`r'_`a'4' & `se_`r'_`a'5' & `se_`r'_`a'7' & `se_`r'_`a'8' & `se_`r'_`a'9' & `se_`r'_`a'10' & `se_`r'_`a'11' & `se_`r'_`a'12' \\ \vspace{c -(}2mm{c )-}\\
{txt} 55{com}.                 {c )-}
{txt} 56{com}.                 
.                 tex \bottomrule \\
{txt} 57{com}.                 tex \end{c -(}tabular{c )-}
{txt} 58{com}. 
.                 texdoc close
{txt} 59{com}.         {c )-}
{txt} 60{com}. {c )-}
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}     25,250    974.1102    1083.051          0   7842.213
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}      5,615    797.8194    760.4888          0   7728.022
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}     13,294    989.7967    1093.705          0   7764.625
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}      9,458    1039.058    1206.684          0   7842.213
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}      2,093    796.7479    834.8828          0    7670.17
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}      4,779    1054.853    1199.322          0   7764.625
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}     15,792    935.2122    999.7489          0   7842.213
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}      3,522    798.4562    712.7335          0   7728.022
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}      8,515    953.2841    1027.964          0   7764.625
{txt}(texdoc output file is C:\Proyectos\Banrep research\Health_shocks_and_labor\Results\ES_earnings_hetSexAge_Cases1_singleEvents.tex)
{res}{txt}(texdoc output written to {browse `"C:\Proyectos\Banrep research\Health_shocks_and_labor\Results\ES_earnings_hetSexAge_Cases1_singleEvents.tex"':C:\Proyectos\Banrep research\Health_shocks_and_labor\Results\ES_earnings_hetSexAge_Cases1_singleEvents.tex})
{res}{txt}(texdoc output file is C:\Proyectos\Banrep research\Health_shocks_and_labor\Results\ES_earnings_hetSexAge_Cases1_inter.tex)
{res}{txt}(texdoc output written to {browse `"C:\Proyectos\Banrep research\Health_shocks_and_labor\Results\ES_earnings_hetSexAge_Cases1_inter.tex"':C:\Proyectos\Banrep research\Health_shocks_and_labor\Results\ES_earnings_hetSexAge_Cases1_inter.tex})
{res}{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}     10,219    156.9271    502.6079          0   7659.022
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}      1,604    163.7593    432.5938          0   5740.307
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}      4,596     179.127    499.9509          0   7469.383
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}      3,466    199.7449    593.2691          0   7629.959
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}        554    185.3284    456.4206          0   5740.307
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}      1,533    217.7676    540.7018          0   7290.621
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}      6,753    134.9506    447.4836          0   7659.022
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}      1,050     152.379    419.2539          0   5542.923
{txt}{col 1}pre_{col 7}pre5{col 13}pre3{col 19}pre1{col 25}pos1{col 31}pos3{col 37}pos5
{col 1}pre6{col 7}pre4{col 13}pre2{col 19}pos0{col 25}pos2{col 31}pos4{col 37}pos_
{err}pre6
pre5
pre4
pre3
pre2
pre1
pos0
pos1
pos2
pos3
pos4
pos5
pos_
{txt}{col 1}inter_pre{col 13}inter_pre4{col 25}inter_pre1{col 37}inter_pos2{col 49}inter_pos5
{col 1}inter_pre6{col 13}inter_pre3{col 25}inter_pos0{col 37}inter_pos3{col 49}inter_pos
{col 1}inter_pre5{col 13}inter_pre2{col 25}inter_pos1{col 37}inter_pos4
{err}inter_pre6
inter_pre5
inter_pre4
inter_pre3
inter_pre2
inter_pre1
inter_pos0
inter_pos1
inter_pos2
inter_pos3
inter_pos4
inter_pos5
inter_pos

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}ibc_real {c |}{res}      3,063    159.7878    477.1722          0   7469.383
{txt}(texdoc output file is C:\Proyectos\Banrep research\Health_shocks_and_labor\Results\ES_earnings_hetSexAge_Cases2_singleEvents.tex)
{res}{txt}(texdoc output written to {browse `"C:\Proyectos\Banrep research\Health_shocks_and_labor\Results\ES_earnings_hetSexAge_Cases2_singleEvents.tex"':C:\Proyectos\Banrep research\Health_shocks_and_labor\Results\ES_earnings_hetSexAge_Cases2_singleEvents.tex})
{res}{txt}(texdoc output file is C:\Proyectos\Banrep research\Health_shocks_and_labor\Results\ES_earnings_hetSexAge_Cases2_inter.tex)
{res}{txt}(texdoc output written to {browse `"C:\Proyectos\Banrep research\Health_shocks_and_labor\Results\ES_earnings_hetSexAge_Cases2_inter.tex"':C:\Proyectos\Banrep research\Health_shocks_and_labor\Results\ES_earnings_hetSexAge_Cases2_inter.tex})
{res}{txt}
{com}. 
. 
. 
. 
. 
. /* L1. Loop across number of cases
> foreach n of numlist 1 2 5 10 50 {c -(}
>         
>         local option replace
>         * L2. Loop across gender
>         foreach sex in "All" "M" /*"F"*/ {c -(}
> 
>                 * L3. Loop across age groups
>                 foreach age in "Age18_62" "Age18_34" /*"Age35_50"*/ {c -(}
>                 
>                         cap reghdfe ibc_real pre* pos* inter* if cases > `n' & inrange(age_at_event, `l`age'') `lsex`sex'' `treat_`treat'', a(month_by_t id_event) vce(cl persona)
>                         estimates store reg
>                 
>                         sum ibc_real if dist == -1 & inrange(age_at_event, `l`age'') `lsex`sex'' `treat_`treat''
>                         local mean = r(mean)
>                                                 
>                         outreg2 [reg] using "${c -(}cdresults{c )-}\ES_earnings_hetSexAge_NumCases`n'.xls", excel long nor addstat(Pre-event mean, `mean') `option'                                       
>                         
>                         local option append
>                 {c )-}
>         {c )-}
> {c )-}
> 
> 
> 
> 
> 
> /* Globals for each group of variables
> global vars_job ibc_real ibc_real_miss formal dias_miss daily_wage job_loss job_gain job_change job_loss_6m job_gain_6m job_change_6m num_jobs full_time eps_change
> global vars_days dias dias_incap_gral dias_incap_trab dias_licen_mat dias_vacac dias_susp_temp
> global vars_days_miss dias_miss dias_incap_gral_miss dias_incap_trab_miss dias_licen_mat_miss dias_vacac_miss dias_susp_temp_miss
> global vars_health cons cons_mental cons_psico cons_psiquiatria cons_traba_social cons_especialista cons_NoMental cons_lowback cons_hypo
> global vars_health_pr pr_cons pr_cons_mental pr_cons_psico pr_cons_psiquiatria pr_cons_traba_social pr_cons_especialista pr_cons_NoMental pr_cons_lowback pr_cons_hypo
> 
> * Locals to restrict regressions by gender, age and type of coefficient
> local lsexF & sexomode == 0
> local lsexM & sexomode == 1
> 
> local lAge18_62 "18, 62"
> local lAge18_34 "18, 34"
> local lAge35_50 "35, 50"
> 
> local dummy_type1 "singleEvents"
> local dummy_type2 "inter"
> 
> local treat_simul & simulta == 1
> local treat_Nosimul & simulta == 0
> 
> local tsave_All "Treatment all"
> local tsave_Simul "Treatment simultaneous"
> local tsave_Nosimul "Treatment non-simultaneous"
> 
> 
> ****************
> * Excel tables
> ****************
> * L1. Define different tables grouped by the type of variables
> foreach vars_type in job days days_miss /*health health_pr*/ {c -(}
>         
>         * L2. Loop across type of treatment
>         foreach treat in "All" "Simul" "Nosimul" {c -(}
>                 cap mkdir "$cdtables\Collapsed\\`tsave_`treat''"
>         
>                 * L3. Loop across gender
>                 foreach sex in "All" "M" "F" {c -(}
>                 
>                         * L4. Loop across age groups
>                         foreach age in "Age18_62" "Age18_34" /*"Age35_50"*/ {c -(}           
>                                 
>                                 local option replace
>                                 * L5. Run regressions for the different outcomes
>                                 foreach var of global vars_`vars_type' {c -(}
>                                         cap reghdfe `var' pre* pos* inter* if inrange(age_at_event, `l`age'') `lsex`sex'' `treat_`treat'', a(month_by_t id_event) vce(cl persona)
>                                         estimates store reg
>                                 
>                                         sum `var' if dist == -1 & inrange(age_at_event, `l`age'') `lsex`sex'' `treat_`treat''
>                                         local mean = r(mean)
>                                                                 
>                                         outreg2 [reg] using "$cdtables\Collapsed\\`tsave_`treat''\ES_Depression_`vars_type'_Sex`sex'_`age'_treat_`treat'.xls", excel long nor addstat(Pre-event mean, `mean') `option'                                  
>                                         
>                                         local option append
>                                 {c )-}
>                         {c )-}
>                 {c )-}
>         {c )-}
> {c )-}
> 
> 
> * Varying fixed effects
> cap mkdir "$cdtables\Collapsed\Different FE"
> 
> local lfe None
> local lfemonth_by_t Month
> local lfeid_event Id
> 
> * L1. Define different tables grouped by the type of variables
> foreach vars_type in job /*days days_miss health health_pr*/ {c -(}
>         
>         * L2. Loop across type of treatment
>         foreach fe in "" month_by_t id_event {c -(}
>                         
>                 * L3. Loop across gender
>                 foreach sex in "All" "M" {c -(}
>                 
>                         * L4. Loop across age groups
>                         foreach age in "Age18_62" "Age18_34" /*"Age35_50"*/ {c -(}
>                                 
>                                 local option replace
>                                 * L5. Run regressions for the different outcomes
>                                 foreach var of global vars_`vars_type' {c -(}
>                                         cap reghdfe `var' pre* pos* inter* if inrange(age_at_event, `l`age'') `lsex`sex'', a(`fe') vce(cl persona)
>                                         estimates store reg
>                                 
>                                         sum `var' if dist == -1 & inrange(age_at_event, `l`age'') `lsex`sex'' `treat_`treat''
>                                         local mean = r(mean)
>                                                                 
>                                         outreg2 [reg] using "$cdtables\Collapsed\Different FE\ES_Depression_`vars_type'_Sex`sex'_`age'_FE`lfe`fe''.xls", excel long nor addstat(Pre-event mean, `mean') `option'                                        
>                                         
>                                         local option append
>                                 {c )-}
>                         {c )-}
>                 {c )-}
>         {c )-}
> {c )-}
> 
> 
> 
> ****************
> * Latex tables
> ****************
> * L1. Define different tables grouped by the type of variables
> foreach vars_type in job days days_miss health health_pr {c -(}
>         
>         * L2. Loop across gender
>         foreach sex in "All" "M" "F" {c -(}
>                 
>                 * L3. Loop across age groups
>                 foreach age in "Age18_62" "Age18_34" /*"Age35_50"*/ {c -(}           
>                         
>                         * L4. Run regressions for the different outcomes
>                         foreach var of global vars_`vars_type' {c -(}
>                                 cap reghdfe `var' pre* pos* inter* if inrange(age_at_event, `l`age'') `lsex`sex'', abs(month_by_t id_event) vce(cl persona)
>                                 matrix reg = r(table)
>                                 
>                                 * Observations
>                                 local obs_`var' : di %15.0fc e(N)/120
>                                 local obs_`var' = strtrim("`obs_`var''")
>                                 
>                                 * L5. Two tables per type of variables: single events and interacted with treatment
>                                 forval a = 1/2 {c -(}
>                                         
>                                         if `a' == 1 {c -(}
>                                                 ds pre* pos*
>                                                 global dummies `r(varlist)'
>                                         {c )-}
>                                         
>                                         if `a' == 2 {c -(}
>                                                 ds inter*
>                                                 global dummies `r(varlist)'
>                                         {c )-}
>                                 
>                                         * L6. Store locals for each coefficient to print in the table
>                                         local x = 1
>                                         foreach d of global dummies {c -(}
>                                                 
>                                                 if "`d'" != "pre_" & "`d'" != "inter_pre" {c -(}
>                                                         
>                                                         dis in red "`d'"
>                                                         
>                                                         * Coefficient and SE format
>                                                         local B_`var'_`a'`x' = _b[`d']
>                                                         local se_`var'_`a'`x' = _se[`d']
>                                                         local obs_`var'_`a' = e(N)
>                                                         
>                                                         if abs(`B_`var'_`a'`x'') >= 1 {c -(}
>                                                                 local B_`var'_`a'`x': di %8.2f `B_`var'_`a'`x''
>                                                                 local se_`var'_`a'`x': di %8.2f `se_`var'_`a'`x''
>                                                         {c )-}
>                                                         
>                                                         else {c -(}
>                                                                 local B_`var'_`a'`x': di %8.4f `B_`var'_`a'`x''
>                                                                 local se_`var'_`a'`x': di %8.4f `se_`var'_`a'`x''
>                                                         {c )-}
>                                                                                                         
>                                                         local se_`var'_`a'`x' = strtrim("`se_`var'_`a'`x''")
>                                                         local se_`var'_`a'`x' = "(`se_`var'_`a'`x'')"                                                                           
>                                                         
>                                                         * Add significance to coefficients
>                                                         local pv: di %10.5fc reg["pvalue", "`d'"]
>                                                         
>                                                         if `pv' < 0.1 {c -(}
>                                                                 local B_`var'_`a'`x' = "`B_`var'_`a'`x''*"
>                                                         {c )-}
>                                                         
>                                                         if `pv' < 0.05 {c -(}
>                                                                 local B_`var'_`a'`x' = "`B_`var'_`a'`x''*"
>                                                         {c )-}
>                                                         
>                                                         if `pv' < 0.01 {c -(}
>                                                                 local B_`var'_`a'`x' = "`B_`var'_`a'`x''*"
>                                                         {c )-}
>                                                         
>                                                         local x = `x' + 1
>                                                 {c )-}
>                                         {c )-}
>                                 {c )-}
>                                 
>                                 * Store and format mean in t-1
>                                 sum `var' if dist == -1 & inrange(age_at_event, `l`age'') `lsex`sex''
>                                 local mean_`var' = r(mean)
>                                 
>                                 if abs(`mean_`var'') >= 1 {c -(}
>                                         local mean_`var': di %8.2f `mean_`var''
>                                 {c )-}
> 
>                                 else {c -(}
>                                         local mean_`var': di %8.4f `mean_`var''
>                                 {c )-}               
>                         {c )-}
>                         
>                         * L7. One table per each type of coefficient
>                         forval a = 1/2 {c -(}
>                                 
>                                 ***************
>                                 * Latex table
>                                 ***************
>                                 texdoc init "$cdtables\Collapsed\ES_Depression_`vars_type'_Sex`sex'_`age'_`dummy_type`a''.tex", force replace
> 
>                                 tex \begin{c -(}tabular{c )-}{c -(}lccccccccccccc{c )-} 
>                                 tex \hline \hline
>                                 tex  & [-24, -19] & [-18, -13] & [-12, -7] & [-6, -4] & [-3, -2] & 0 & [1, 3] & [4, 6] & [7, 12] & [13, 18] & [19, 24] & Mean t-1 & Obs. \\
>                                 tex \midrule
>                                 tex  &  & \\
> 
>                                 foreach v of global vars_`vars_type' {c -(}
>                                         
>                                         local lab_var : variable label `v'      
>                                         
>                                         tex `lab_var'  & `B_`v'_`a'1' & `B_`v'_`a'2' & `B_`v'_`a'3' & `B_`v'_`a'4' & `B_`v'_`a'5' & `B_`v'_`a'7' & `B_`v'_`a'8' & `B_`v'_`a'9' & `B_`v'_`a'10' & `B_`v'_`a'11' & `B_`v'_`a'12' & `mean_`v'' & `obs_`v'' \\
>                                         
>                                         tex        & `se_`v'_`a'1' & `se_`v'_`a'2' & `se_`v'_`a'3' & `se_`v'_`a'4' & `se_`v'_`a'5' & `se_`v'_`a'7' & `se_`v'_`a'8' & `se_`v'_`a'9' & `se_`v'_`a'10' & `se_`v'_`a'11' & `se_`v'_`a'12' \\ \vspace{c -(}2mm{c )-}\\
>                                 {c )-}
>                                 
>                                 tex \bottomrule \\
>                                 tex \end{c -(}tabular{c )-}
> 
>                                 texdoc close
>                         {c )-}
>                 {c )-}
>         {c )-}
> {c )-}

{txt}end of do-file

{com}. doedit "C:\Proyectos\Banrep research\Health_shocks_and_labor\Dofiles\Step 4 - IV database and estimation outputs.do"

. do "C:\Proyectos\Banrep research\Health_shocks_and_labor\Dofiles\Step 4 - IV database and estimation outputs.do"
{txt}
{com}. /*      
>         Creation date: 15/02/2024
>         Author: Naomi Calle
>         
>         Description:
> */
. 
. set trace off
{txt}
{com}. cap log close
{smcl}
{com}{sf}{ul off}