{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Logs\step3_event_study.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}18 Jul 2024, 16:17:03
{txt}
{com}. 
. 
. * Controls
. global controls year_grado
{txt}
{com}. global cohorts 1995 //2000 2005 2010 
{txt}
{com}. global treatment_groups treated_1a treated_1b treated_1c treated_1d                                             ///
>                         treated_2a treated_2b treated_2c treated_2d
{txt}
{com}. * Outcomes
. global outcomes service_mental service_mental2 service_mental3 cardio_risk laboral                      ///
>                                 pila_independientes p_cotizaciones pila_salario_r sal_dias_cot
{txt}
{com}.                                         
.                                         
. ****************************************************************************
. **#                                             1. Merge data and set-up
. ****************************************************************************
. 
. * RIPS
. use "${c -(}data{c )-}\Individual_balanced_all_RIPS", clear
{txt}
{com}. rename year_RIPS fecha_pila
{res}{txt}
{com}. 
. * PILA
. merge 1:1 personabasicaid fecha_pila using "${c -(}data{c )-}\Individual_balanced_all_PILA"
{res}{txt}{p 0 7 2}
(variable
{bf:personabasicaid} was {bf:long}, now {bf:double} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:fecha_pila} was {bf:int}, now {bf:float} to accommodate using data's values)
{p_end}

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          96,046
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}          96,046{txt}  (_merge==2)

{col 5}Matched{col 30}{res}       1,344,644{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop if _merge == 2 // Estos son los del 2008
{txt}(96,046 observations deleted)

{com}. keep if inrange(posgrado_start, 2011, 2017) | mi(posgrado_start)
{txt}(58,534 observations deleted)

{com}. 
. * ReTHUS
. merge m:1 personabasicaid using "${c -(}data{c )-}\master_rethus.dta", keep(3) nogen 
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}       1,286,110{txt}  
{col 5}{hline 41}

{com}. drop if mi(fechapregrado)
{txt}(0 observations deleted)

{com}. gen year_grado = yofd(fechapregrado)
{txt}
{com}. 
. rename rethus_sexo rethus_sexo_temp
{res}{txt}
{com}. gen rethus_sexo = 0 
{txt}
{com}. replace rethus_sexo = 1 if rethus_sexo_temp == "MASCULINO"
{txt}(546,868 real changes made)

{com}. replace rethus_sexo = 2 if rethus_sexo_temp == "FEMENINO"
{txt}(739,046 real changes made)

{com}. drop rethus_sexo_temp
{txt}
{com}. drop if rethus_sexo == 0
{txt}(196 observations deleted)

{com}. 
. * Final outcomes
. gen service_mental3 = (service_mental == 1 & service_mental2 == 0)
{txt}
{com}. gen cardio_risk     = (stroke == 1 | infarct == 1 | cardiovascular == 1)
{txt}
{com}. gen laboral         = (diag_laboral == 1 | estres_laboral == 1 | ///
>                        accidente_laboral == 1 | enfermedad_laboral == 1 | ///
>                                            acc_enf_laboral == 1)
{txt}
{com}. 
. * Label globals
. global labels ""Mental health diagnosis" "Stress, anxiety or depression" "Mental health diagnosis (excluding)" "Cardio risk" "Laboral disease" "Independent" "Multiple jobs" "Real monthly earnings (total - 2018 COP)" "Monthly worked days""
{txt}
{com}. 
. local o = 1
{txt}
{com}. foreach label in $labels {c -(}              
{txt}  2{com}.         global o`o' = "`label'" 
{txt}  3{com}.         local o = `o' + 1       
{txt}  4{com}. {c )-}
{txt}
{com}. 
. 
. ****************************************************************************
. **#                             3.  Figures
. ****************************************************************************
. 
. * Option 1
. preserve
{txt}
{com}. 
. * Never treated as exposed in 2017
. replace posgrado_start = 2017 if posgrado_start == .
{txt}(1,145,214 real changes made)

{com}. 
. * Distance to enrollment
. gen dist = fecha_pila - posgrado_start
{txt}
{com}. 
. * Average calculations
. global residuals ""
{txt}
{com}. foreach outcome in $outcomes {c -(}  
{txt}  2{com}.         
.         reghdfe `outcome', abs(personabasicaid fecha_pila) resid(res_`outcome')
{txt}  3{com}.         g r_`outcome' = _b[_cons] + res_`outcome'
{txt}  4{com}.         drop res_`outcome'
{txt}  5{com}.         
.         global residuals "${c -(}residuals{c )-} r_`outcome'"
{txt}  6{com}.         
. {c )-}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.1945
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1325
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.1271

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}service_me~l{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0189818{col 26}{space 2} .0001121{col 37}{space 1}  169.36{col 46}{space 3}0.000{col 54}{space 4} .0187622{col 67}{space 3} .0192015
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.1938
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1318
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.1203

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}service_me~2{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0169576{col 26}{space 2} .0001061{col 37}{space 1}  159.84{col 46}{space 3}0.000{col 54}{space 4} .0167497{col 67}{space 3} .0171655
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.0949
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0253
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.0479

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}service_me~3{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0023594{col 26}{space 2} .0000422{col 37}{space 1}   55.86{col 46}{space 3}0.000{col 54}{space 4} .0022766{col 67}{space 3} .0024422
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.1496
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0842
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.0461

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} cardio_risk{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0023291{col 26}{space 2} .0000407{col 37}{space 1}   57.25{col 46}{space 3}0.000{col 54}{space 4} .0022494{col 67}{space 3} .0024088
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.1004
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0312
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.1138

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     laboral{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0135452{col 26}{space 2} .0001003{col 37}{space 1}  135.01{col 46}{space 3}0.000{col 54}{space 4} .0133486{col 67}{space 3} .0137419
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.3898
{txt}{col 51}Adj R-squared{col 67}= {res}    0.3429
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.3447

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pila_indep~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .2369109{col 26}{space 2} .0003039{col 37}{space 1}  779.45{col 46}{space 3}0.000{col 54}{space 4} .2363151{col 67}{space 3} .2375066
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.3283
{txt}{col 51}Adj R-squared{col 67}= {res}    0.2766
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.3499

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}p_cotizaci~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .2159172{col 26}{space 2} .0003086{col 37}{space 1}  699.66{col 46}{space 3}0.000{col 54}{space 4} .2153124{col 67}{space 3} .2165221
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.5356
{txt}{col 51}Adj R-squared{col 67}= {res}    0.4999
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res} 2.704e+06

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pila_salar~r{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}  2246767{col 26}{space 2} 2384.753{col 37}{space 1}  942.14{col 46}{space 3}0.000{col 54}{space 4}  2242093{col 67}{space 3}  2251441
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.5778
{txt}{col 51}Adj R-squared{col 67}= {res}    0.5453
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    9.9898

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sal_dias_cot{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 13.85881{col 26}{space 2} .0088095{col 37}{space 1} 1573.16{col 46}{space 3}0.000{col 54}{space 4} 13.84154{col 67}{space 3} 13.87607
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}
{com}. 
. collapse (mean) $outcomes $residuals , by(dist treated_1a)
{res}{txt}
{com}. keep if dist >= -2 & dist <= 5
{txt}(24 observations deleted)

{com}. replace treated_1a = 0 if treated_1a == .
{txt}(8 real changes made)

{com}. 
. * Graphs
. local i = 1
{txt}
{com}. foreach outcome in $outcomes {c -(}
{txt}  2{com}.         
.         * Format local
.         qui sum `outcome'
{txt}  3{com}.         local mean = r(mean)
{txt}  4{com}.         
.         if r(mean)>1 & r(mean)>1000  {c -(}                  
{txt}  5{com}.                 local format = "%12.0fc"                        
{txt}  6{com}.         {c )-}
{txt}  7{com}.         if r(mean)>1 & r(mean)<=1000 {c -(}          
{txt}  8{com}.                 local format = "%5.0f"                  
{txt}  9{com}.         {c )-}               
{txt} 10{com}.         if r(mean)<=1                            {c -(}              
{txt} 11{com}.                 local format = "%5.2f"                  
{txt} 12{com}.         {c )-}
{txt} 13{com}. 
.         twoway  (line `outcome' dist if (treated_1a == 1), color(gs5))                                          ///
>                         (line `outcome' dist if (treated_1a == 0), color(gs10)),                                        ///
>                         xlabel(-2(1)5, nogrid labsize(vsmall))                                                                          ///
>                         ylabel(#6, labsize(small) angle(360) format(`format'))                                          ///
>                         xline(-1,lwidth(thin) lcolor(navy*0.5) lpattern(-))                                                     ///
>                         xtitle("Time since enrollment (months)", size(small))                                           ///
>                         ytitle("${c -(}o`i'{c )-}", size(small))                                                                                          ///
>                         legend(order(1 "Treated Average" 2 "Control Average") position(6) col(2))       ///
>                         scheme(s1color) graphregion(fcolor(white)) plotregion(fcolor(white))
{txt} 14{com}.                         
.         graph export "${c -(}output{c )-}\Figures\Averages\Ave1_`outcome'.png", replace
{txt} 15{com}.                         
.         twoway  (line r_`outcome' dist if (treated_1a == 1), color(gs5))                                        ///
>                         (line r_`outcome' dist if (treated_1a == 0), color(gs10)),                                      ///
>                         xlabel(-2(1)5, nogrid labsize(vsmall))                                                                          ///
>                         ylabel(#6, labsize(small) angle(360) format(`format'))                                          ///
>                         xline(-1,lwidth(thin) lcolor(navy*0.5) lpattern(-))                                                     ///
>                         xtitle("Time since enrollment (months)", size(small))                                           ///
>                         ytitle("${c -(}o`i'{c )-}", size(small))                                                                                          ///
>                         legend(order(1 "Treated Average" 2 "Control Average") position(6) col(2))       ///
>                         scheme(s1color) graphregion(fcolor(white)) plotregion(fcolor(white))
{txt} 16{com}.                         
.         graph export "${c -(}output{c )-}\Figures\Averages\Res1_`outcome'.png", replace
{txt} 17{com}.                         
.         local i = `i' + 1
{txt} 18{com}.                         
. {c )-} 
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave1_service_mental.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res1_service_mental.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave1_service_mental2.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res1_service_mental2.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave1_service_mental3.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res1_service_mental3.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave1_cardio_risk.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res1_cardio_risk.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave1_laboral.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res1_laboral.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave1_pila_independientes.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res1_pila_independientes.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave1_p_cotizaciones.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res1_p_cotizaciones.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave1_pila_salario_r.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res1_pila_salario_r.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave1_sal_dias_cot.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res1_sal_dias_cot.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. restore
{txt}
{com}. 
. 
. * Option 2
. preserve
{txt}
{com}. 
. * Distance to enrollment
. gen dist = fecha_pila - posgrado_start
{txt}(1,145,214 missing values generated)

{com}. 
. * Average calculations
. global residuals ""
{txt}
{com}. foreach outcome in $outcomes {c -(}  
{txt}  2{com}.         
.         reghdfe `outcome', abs(personabasicaid fecha_pila) resid(res_`outcome')
{txt}  3{com}.         g r_`outcome' = _b[_cons] + res_`outcome'
{txt}  4{com}.         drop res_`outcome'
{txt}  5{com}.         
.         global residuals "${c -(}residuals{c )-} r_`outcome'"
{txt}  6{com}.         
. {c )-}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.1945
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1325
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.1271

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}service_me~l{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0189818{col 26}{space 2} .0001121{col 37}{space 1}  169.36{col 46}{space 3}0.000{col 54}{space 4} .0187622{col 67}{space 3} .0192015
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.1938
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1318
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.1203

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}service_me~2{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0169576{col 26}{space 2} .0001061{col 37}{space 1}  159.84{col 46}{space 3}0.000{col 54}{space 4} .0167497{col 67}{space 3} .0171655
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.0949
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0253
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.0479

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}service_me~3{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0023594{col 26}{space 2} .0000422{col 37}{space 1}   55.86{col 46}{space 3}0.000{col 54}{space 4} .0022766{col 67}{space 3} .0024422
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.1496
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0842
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.0461

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} cardio_risk{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0023291{col 26}{space 2} .0000407{col 37}{space 1}   57.25{col 46}{space 3}0.000{col 54}{space 4} .0022494{col 67}{space 3} .0024088
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.1004
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0312
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.1138

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     laboral{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0135452{col 26}{space 2} .0001003{col 37}{space 1}  135.01{col 46}{space 3}0.000{col 54}{space 4} .0133486{col 67}{space 3} .0137419
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.3898
{txt}{col 51}Adj R-squared{col 67}= {res}    0.3429
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.3447

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pila_indep~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .2369109{col 26}{space 2} .0003039{col 37}{space 1}  779.45{col 46}{space 3}0.000{col 54}{space 4} .2363151{col 67}{space 3} .2375066
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.3283
{txt}{col 51}Adj R-squared{col 67}= {res}    0.2766
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.3499

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}p_cotizaci~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .2159172{col 26}{space 2} .0003086{col 37}{space 1}  699.66{col 46}{space 3}0.000{col 54}{space 4} .2153124{col 67}{space 3} .2165221
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.5356
{txt}{col 51}Adj R-squared{col 67}= {res}    0.4999
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res} 2.704e+06

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pila_salar~r{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}  2246767{col 26}{space 2} 2384.753{col 37}{space 1}  942.14{col 46}{space 3}0.000{col 54}{space 4}  2242093{col 67}{space 3}  2251441
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.5778
{txt}{col 51}Adj R-squared{col 67}= {res}    0.5453
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    9.9898

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sal_dias_cot{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 13.85881{col 26}{space 2} .0088095{col 37}{space 1} 1573.16{col 46}{space 3}0.000{col 54}{space 4} 13.84154{col 67}{space 3} 13.87607
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}
{com}. 
. collapse (mean) $outcomes $residuals , by(dist treated_1a)
{res}{txt}
{com}. keep if (dist >= -2 & dist <= 5) | dist == .
{txt}(24 observations deleted)

{com}. 
. * Constant for never treated
. foreach outcome in $outcomes {c -(}
{txt}  2{com}. 
.         qui sum `outcome' if dist == .
{txt}  3{com}.         local never = r(mean)
{txt}  4{com}.         g `outcome'_nt = `never'
{txt}  5{com}.         
.         qui sum r_`outcome' if dist == .
{txt}  6{com}.         local never = r(mean)
{txt}  7{com}.         g r_`outcome'_nt = `never'
{txt}  8{com}.         
. {c )-}
{txt}
{com}. 
. drop if dist == .
{txt}(2 observations deleted)

{com}. 
. * Graphs
. local i = 1
{txt}
{com}. foreach outcome in $outcomes {c -(}
{txt}  2{com}.         
.         * Format local
.         qui sum `outcome'
{txt}  3{com}.         local mean = r(mean)
{txt}  4{com}.         
.         if r(mean)>1 & r(mean)>1000  {c -(}                  
{txt}  5{com}.                 local format = "%12.0fc"                        
{txt}  6{com}.         {c )-}
{txt}  7{com}.         if r(mean)>1 & r(mean)<=1000 {c -(}          
{txt}  8{com}.                 local format = "%5.0f"                  
{txt}  9{com}.         {c )-}               
{txt} 10{com}.         if r(mean)<=1                            {c -(}              
{txt} 11{com}.                 local format = "%5.2f"                  
{txt} 12{com}.         {c )-}
{txt} 13{com}. 
.         twoway  (line `outcome'         dist, color(gs5))                                                                               ///
>                         (line `outcome'_nt      dist, color(gs10)),                                                                             ///
>                         xlabel(-2(1)5, nogrid labsize(vsmall))                                                                          ///
>                         ylabel(#6, labsize(small) angle(360) format(`format'))                                          ///
>                         xline(-1,lwidth(thin) lcolor(navy*0.5) lpattern(-))                                                     ///
>                         xtitle("Time since enrollment (months)", size(small))                                           ///
>                         ytitle("${c -(}o`i'{c )-}", size(small))                                                                                          ///
>                         legend(order(1 "Treated Average" 2 "Control Average") position(6) col(2))       ///
>                         scheme(s1color) graphregion(fcolor(white)) plotregion(fcolor(white))
{txt} 14{com}.                         
.         graph export "${c -(}output{c )-}\Figures\Averages\Ave2_`outcome'.png", replace
{txt} 15{com}.                         
.         twoway  (line r_`outcome'               dist, color(gs5))                                                                       ///
>                         (line r_`outcome'_nt    dist, color(gs10)),                                                                     ///
>                         xlabel(-2(1)5, nogrid labsize(vsmall))                                                                          ///
>                         ylabel(#6, labsize(small) angle(360) format(`format'))                                          ///
>                         xline(-1,lwidth(thin) lcolor(navy*0.5) lpattern(-))                                                     ///
>                         xtitle("Time since enrollment (months)", size(small))                                           ///
>                         ytitle("${c -(}o`i'{c )-}", size(small))                                                                                          ///
>                         legend(order(1 "Treated Average" 2 "Control Average") position(6) col(2))       ///
>                         scheme(s1color) graphregion(fcolor(white)) plotregion(fcolor(white))
{txt} 16{com}.                         
.         graph export "${c -(}output{c )-}\Figures\Averages\Res2_`outcome'.png", replace
{txt} 17{com}.                         
.         local i = `i' + 1
{txt} 18{com}.                         
. {c )-} 
{res}{txt}{p 0 4 2}
(file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_service_mental.png{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_service_mental.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
(file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_service_mental.png{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_service_mental.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
(file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_service_mental2.png{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_service_mental2.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
(file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_service_mental2.png{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_service_mental2.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
(file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_service_mental3.png{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_service_mental3.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
(file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_service_mental3.png{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_service_mental3.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
(file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_cardio_risk.png{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_cardio_risk.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
(file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_cardio_risk.png{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_cardio_risk.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
(file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_laboral.png{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_laboral.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
(file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_laboral.png{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_laboral.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
(file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_pila_independientes.png{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_pila_independientes.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
(file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_pila_independientes.png{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_pila_independientes.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
(file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_p_cotizaciones.png{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_p_cotizaciones.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
(file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_p_cotizaciones.png{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_p_cotizaciones.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
(file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_pila_salario_r.png{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_pila_salario_r.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
(file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_pila_salario_r.png{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_pila_salario_r.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
(file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_sal_dias_cot.png{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_sal_dias_cot.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
(file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_sal_dias_cot.png{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_sal_dias_cot.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. restore
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD1e9e0_000000.tmp"
{txt}
{com}. gen dist = fecha_pila - posgrado_start
{txt}(1,145,214 missing values generated)

{com}. 
. * Average calculations
. global residuals ""
{txt}
{com}. foreach outcome in $outcomes {c -(}  
{txt}  2{com}.         
.         reghdfe `outcome', abs(personabasicaid fecha_pila) resid(res_`outcome')
{txt}  3{com}.         g r_`outcome' = _b[_cons] + res_`outcome'
{txt}  4{com}.         drop res_`outcome'
{txt}  5{com}.         
.         global residuals "${c -(}residuals{c )-} r_`outcome'"
{txt}  6{com}.         
. {c )-}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.1945
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1325
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.1271

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}service_me~l{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0189818{col 26}{space 2} .0001121{col 37}{space 1}  169.36{col 46}{space 3}0.000{col 54}{space 4} .0187622{col 67}{space 3} .0192015
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.1938
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1318
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.1203

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}service_me~2{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0169576{col 26}{space 2} .0001061{col 37}{space 1}  159.84{col 46}{space 3}0.000{col 54}{space 4} .0167497{col 67}{space 3} .0171655
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.0949
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0253
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.0479

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}service_me~3{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0023594{col 26}{space 2} .0000422{col 37}{space 1}   55.86{col 46}{space 3}0.000{col 54}{space 4} .0022766{col 67}{space 3} .0024422
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.1496
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0842
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.0461

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} cardio_risk{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0023291{col 26}{space 2} .0000407{col 37}{space 1}   57.25{col 46}{space 3}0.000{col 54}{space 4} .0022494{col 67}{space 3} .0024088
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.1004
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0312
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.1138

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     laboral{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0135452{col 26}{space 2} .0001003{col 37}{space 1}  135.01{col 46}{space 3}0.000{col 54}{space 4} .0133486{col 67}{space 3} .0137419
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.3898
{txt}{col 51}Adj R-squared{col 67}= {res}    0.3429
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.3447

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pila_indep~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .2369109{col 26}{space 2} .0003039{col 37}{space 1}  779.45{col 46}{space 3}0.000{col 54}{space 4} .2363151{col 67}{space 3} .2375066
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.3283
{txt}{col 51}Adj R-squared{col 67}= {res}    0.2766
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.3499

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}p_cotizaci~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .2159172{col 26}{space 2} .0003086{col 37}{space 1}  699.66{col 46}{space 3}0.000{col 54}{space 4} .2153124{col 67}{space 3} .2165221
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.5356
{txt}{col 51}Adj R-squared{col 67}= {res}    0.4999
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res} 2.704e+06

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pila_salar~r{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}  2246767{col 26}{space 2} 2384.753{col 37}{space 1}  942.14{col 46}{space 3}0.000{col 54}{space 4}  2242093{col 67}{space 3}  2251441
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.5778
{txt}{col 51}Adj R-squared{col 67}= {res}    0.5453
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    9.9898

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sal_dias_cot{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 13.85881{col 26}{space 2} .0088095{col 37}{space 1} 1573.16{col 46}{space 3}0.000{col 54}{space 4} 13.84154{col 67}{space 3} 13.87607
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}
{com}. 
. collapse (mean) $outcomes $residuals , by(dist treated_1a)
{res}{txt}
{com}. keep if (dist >= -2 & dist <= 5) | dist == .
{txt}(24 observations deleted)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD1e9e0_000000.tmp"
{txt}
{com}. replace treated_1a = 0 treated_1a == .
{err}invalid 'treated_1a' 
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD1e9e0_000000.tmp"
{txt}
{com}. replace treated_1a = 0 if treated_1a == .
{txt}(9 real changes made)

{com}. 
{txt}end of do-file

{com}. restore
{err}nothing to restore
{txt}{search r(622), local:r(622);}

{com}. replace treated_1a = . if treated_1a == 0
{txt}(9 real changes made, 9 to missing)

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD1e9e0_000000.tmp"
{txt}
{com}. drop if treated_1a = . & dist != .
{err}=exp not allowed
{txt}{search r(101), local:r(101);}

end of do-file

{search r(101), local:r(101);}

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD1e9e0_000000.tmp"
{txt}
{com}. drop if treated_1a == . & dist != .
{txt}(8 observations deleted)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD1e9e0_000000.tmp"
{txt}
{com}. drop if treated_1a == 1 & dist == .
{txt}(1 observation deleted)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD1e9e0_000000.tmp"
{txt}
{com}. foreach outcome in $outcomes {c -(}
{txt}  2{com}. 
.         qui sum `outcome' if dist == .
{txt}  3{com}.         local never = r(mean)
{txt}  4{com}.         g `outcome'_nt = `never'
{txt}  5{com}.         
.         qui sum r_`outcome' if dist == .
{txt}  6{com}.         local never = r(mean)
{txt}  7{com}.         g r_`outcome'_nt = `never'
{txt}  8{com}.         
. {c )-}
{txt}
{com}. 
. drop if dist == .
{txt}(1 observation deleted)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD1e9e0_000000.tmp"
{txt}
{com}. local i = 1
{txt}
{com}. foreach outcome in $outcomes {c -(}
{txt}  2{com}.         
.         * Format local
.         qui sum `outcome'
{txt}  3{com}.         local mean = r(mean)
{txt}  4{com}.         
.         if r(mean)>1 & r(mean)>1000  {c -(}                  
{txt}  5{com}.                 local format = "%12.0fc"                        
{txt}  6{com}.         {c )-}
{txt}  7{com}.         if r(mean)>1 & r(mean)<=1000 {c -(}          
{txt}  8{com}.                 local format = "%5.0f"                  
{txt}  9{com}.         {c )-}               
{txt} 10{com}.         if r(mean)<=1                            {c -(}              
{txt} 11{com}.                 local format = "%5.2f"                  
{txt} 12{com}.         {c )-}
{txt} 13{com}. 
.         twoway  (line `outcome'         dist, color(gs5))                                                                               ///
>                         (line `outcome'_nt      dist, color(gs10)),                                                                             ///
>                         xlabel(-2(1)5, nogrid labsize(vsmall))                                                                          ///
>                         ylabel(#6, labsize(small) angle(360) format(`format'))                                          ///
>                         xline(-1,lwidth(thin) lcolor(navy*0.5) lpattern(-))                                                     ///
>                         xtitle("Time since enrollment (months)", size(small))                                           ///
>                         ytitle("${c -(}o`i'{c )-}", size(small))                                                                                          ///
>                         legend(order(1 "Treated Average" 2 "Control Average") position(6) col(2))       ///
>                         scheme(s1color) graphregion(fcolor(white)) plotregion(fcolor(white))
{txt} 14{com}.                         
.         graph export "${c -(}output{c )-}\Figures\Averages\Ave2_`outcome'.png", replace
{txt} 15{com}.                         
.         twoway  (line r_`outcome'               dist, color(gs5))                                                                       ///
>                         (line r_`outcome'_nt    dist, color(gs10)),                                                                     ///
>                         xlabel(-2(1)5, nogrid labsize(vsmall))                                                                          ///
>                         ylabel(#6, labsize(small) angle(360) format(`format'))                                          ///
>                         xline(-1,lwidth(thin) lcolor(navy*0.5) lpattern(-))                                                     ///
>                         xtitle("Time since enrollment (months)", size(small))                                           ///
>                         ytitle("${c -(}o`i'{c )-}", size(small))                                                                                          ///
>                         legend(order(1 "Treated Average" 2 "Control Average") position(6) col(2))       ///
>                         scheme(s1color) graphregion(fcolor(white)) plotregion(fcolor(white))
{txt} 16{com}.                         
.         graph export "${c -(}output{c )-}\Figures\Averages\Res2_`outcome'.png", replace
{txt} 17{com}.                         
.         local i = `i' + 1
{txt} 18{com}.                         
. {c )-} 
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_service_mental.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_service_mental.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_service_mental2.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_service_mental2.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_service_mental3.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_service_mental3.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_cardio_risk.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_cardio_risk.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_laboral.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_laboral.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_pila_independientes.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_pila_independientes.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_p_cotizaciones.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_p_cotizaciones.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_pila_salario_r.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_pila_salario_r.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Ave2_sal_dias_cot.png{rm}
saved as
PNG
format
{p_end}
{res}{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Output\Figures\Averages\Res2_sal_dias_cot.png{rm}
saved as
PNG
format
{p_end}

{com}. 
{txt}end of do-file

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD1e9e0_000000.tmp"
{txt}
{com}. 
. * RIPS
. use "${c -(}data{c )-}\Individual_balanced_all_RIPS", clear
{txt}
{com}. rename year_RIPS fecha_pila
{res}{txt}
{com}. 
. * PILA
. merge 1:1 personabasicaid fecha_pila using "${c -(}data{c )-}\Individual_balanced_all_PILA"
{res}{txt}{p 0 7 2}
(variable
{bf:personabasicaid} was {bf:long}, now {bf:double} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:fecha_pila} was {bf:int}, now {bf:float} to accommodate using data's values)
{p_end}

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          96,046
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}          96,046{txt}  (_merge==2)

{col 5}Matched{col 30}{res}       1,344,644{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop if _merge == 2 // Estos son los del 2008
{txt}(96,046 observations deleted)

{com}. keep if inrange(posgrado_start, 2011, 2017) | mi(posgrado_start)
{txt}(58,534 observations deleted)

{com}. 
. * ReTHUS
. merge m:1 personabasicaid using "${c -(}data{c )-}\master_rethus.dta", keep(3) nogen 
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}       1,286,110{txt}  
{col 5}{hline 41}

{com}. drop if mi(fechapregrado)
{txt}(0 observations deleted)

{com}. gen year_grado = yofd(fechapregrado)
{txt}
{com}. 
. rename rethus_sexo rethus_sexo_temp
{res}{txt}
{com}. gen rethus_sexo = 0 
{txt}
{com}. replace rethus_sexo = 1 if rethus_sexo_temp == "MASCULINO"
{txt}(546,868 real changes made)

{com}. replace rethus_sexo = 2 if rethus_sexo_temp == "FEMENINO"
{txt}(739,046 real changes made)

{com}. drop rethus_sexo_temp
{txt}
{com}. drop if rethus_sexo == 0
{txt}(196 observations deleted)

{com}. 
. * Final outcomes
. gen service_mental3 = (service_mental == 1 & service_mental2 == 0)
{txt}
{com}. gen cardio_risk     = (stroke == 1 | infarct == 1 | cardiovascular == 1)
{txt}
{com}. gen laboral         = (diag_laboral == 1 | estres_laboral == 1 | ///
>                        accidente_laboral == 1 | enfermedad_laboral == 1 | ///
>                                            acc_enf_laboral == 1)
{txt}
{com}. 
. * Label globals
. global labels ""Mental health diagnosis" "Stress, anxiety or depression" "Mental health diagnosis (excluding)" "Cardio risk" "Laboral disease" "Independent" "Multiple jobs" "Real monthly earnings (total - 2018 COP)" "Monthly worked days""
{txt}
{com}. 
. local o = 1
{txt}
{com}. foreach label in $labels {c -(}              
{txt}  2{com}.         global o`o' = "`label'" 
{txt}  3{com}.         local o = `o' + 1       
{txt}  4{com}. {c )-}
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD1e9e0_000000.tmp"
{txt}
{com}. gen dist = fecha_pila - posgrado_start
{txt}(1,145,214 missing values generated)

{com}. 
{txt}end of do-file

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD1e9e0_000000.tmp"
{txt}
{com}. global residuals ""
{txt}
{com}. foreach outcome in $outcomes {c -(}  
{txt}  2{com}.         
.         reghdfe `outcome', abs(personabasicaid fecha_pila) resid(res_`outcome')
{txt}  3{com}.         g r_`outcome' = _b[_cons] + res_`outcome'
{txt}  4{com}.         drop res_`outcome'
{txt}  5{com}.         
.         global residuals "${c -(}residuals{c )-} r_`outcome'"
{txt}  6{com}.         
. {c )-}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.1945
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1325
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.1271

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}service_me~l{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0189818{col 26}{space 2} .0001121{col 37}{space 1}  169.36{col 46}{space 3}0.000{col 54}{space 4} .0187622{col 67}{space 3} .0192015
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.1938
{txt}{col 51}Adj R-squared{col 67}= {res}    0.1318
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.1203

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}service_me~2{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0169576{col 26}{space 2} .0001061{col 37}{space 1}  159.84{col 46}{space 3}0.000{col 54}{space 4} .0167497{col 67}{space 3} .0171655
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.0949
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0253
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.0479

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}service_me~3{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0023594{col 26}{space 2} .0000422{col 37}{space 1}   55.86{col 46}{space 3}0.000{col 54}{space 4} .0022766{col 67}{space 3} .0024422
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.1496
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0842
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.0461

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} cardio_risk{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0023291{col 26}{space 2} .0000407{col 37}{space 1}   57.25{col 46}{space 3}0.000{col 54}{space 4} .0022494{col 67}{space 3} .0024088
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.1004
{txt}{col 51}Adj R-squared{col 67}= {res}    0.0312
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.1138

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     laboral{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0135452{col 26}{space 2} .0001003{col 37}{space 1}  135.01{col 46}{space 3}0.000{col 54}{space 4} .0133486{col 67}{space 3} .0137419
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.3898
{txt}{col 51}Adj R-squared{col 67}= {res}    0.3429
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.3447

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pila_indep~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .2369109{col 26}{space 2} .0003039{col 37}{space 1}  779.45{col 46}{space 3}0.000{col 54}{space 4} .2363151{col 67}{space 3} .2375066
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.3283
{txt}{col 51}Adj R-squared{col 67}= {res}    0.2766
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    0.3499

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}p_cotizaci~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .2159172{col 26}{space 2} .0003086{col 37}{space 1}  699.66{col 46}{space 3}0.000{col 54}{space 4} .2153124{col 67}{space 3} .2165221
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.5356
{txt}{col 51}Adj R-squared{col 67}= {res}    0.4999
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res} 2.704e+06

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pila_salar~r{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}  2246767{col 26}{space 2} 2384.753{col 37}{space 1}  942.14{col 46}{space 3}0.000{col 54}{space 4}  2242093{col 67}{space 3}  2251441
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 2 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res} 1,285,914
{txt}Absorbing 2 HDFE groups{col 51}{help j_robustsingular##|_new:F(   0,1194050)}{col 67}=          {res}.
{txt}{col 51}Prob > F{col 67}=          {res}.
{txt}{col 51}R-squared{col 67}= {res}    0.5778
{txt}{col 51}Adj R-squared{col 67}= {res}    0.5453
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0000
{txt}{col 51}Root MSE{col 67}= {res}    9.9898

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}sal_dias_cot{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} 13.85881{col 26}{space 2} .0088095{col 37}{space 1} 1573.16{col 46}{space 3}0.000{col 54}{space 4} 13.84154{col 67}{space 3} 13.87607
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 17}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text}     Absorbed FE{col 18}{c |} Categories{col 31} - Redundant{col 43}  = Num. Coefs{col 58}{c |}
{res}{col 1}{text}{hline 17}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text} personabasicaid{col 18}{c |}{space 1}    91851{col 31}{space 1}        0{col 43}{result}{space 1}    91851{col 57}{text} {col 58}{c |}
{res}{col 1}{text}      fecha_pila{col 18}{c |}{space 1}       14{col 31}{space 1}        1{col 43}{result}{space 1}       13{col 57}{text} {col 58}{c |}
{res}{col 1}{text}{hline 17}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\pmede1\AppData\Local\Temp\STD1e9e0_000000.tmp"
{txt}
{com}. collapse (mean) $outcomes $residuals , by(dist treated_1a)
{res}{txt}
{com}. 
{txt}end of do-file

{com}. exit, clear
