{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Logs\Step_4.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}29 Jun 2024, 10:55:03
{txt}
{com}. 
. ****************************************************************************
. **#                             1. Process each occupation's dataset
. ****************************************************************************
. 
. * Balancear panel with rethus sample
. use personabasicaid using "${c -(}data{c )-}\master_rethus", clear
{txt}
{com}. expand 176 // 176 months between 2008 and 2022m8
{txt}(16,808,050 observations created)

{com}. bys personabasicaid: gen fecha_pila = _n + 575
{txt}
{com}. format fecha_pila %tm
{txt}
{com}. merge 1:1 personabasicaid fecha_pila using "${c -(}data{c )-}\\P07_PILA_monthly", keep(1 3)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       8,311,504
{txt}{col 9}from master{col 30}{res}       8,311,504{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}       8,592,592{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. gen formal = (_merge == 3)
{txt}
{com}. drop _merge
{txt}
{com}. replace pila_dependientes       = 0 if mi(pila_dependientes)
{txt}(8,311,504 real changes made)

{com}. replace pila_independientes = 0 if mi(pila_independientes)
{txt}(8,311,504 real changes made)

{com}. 
. * Postgraduate PILA
. gen posgrado_salud = (tipo_cotizante == 21)
{txt}
{com}. * replace posgrado_salud        = 0 if (fecha_pila < fechapregrado)
. 
. * Postgraduate starting date
. gen posgrado_start = fecha_pila if posgrado_salud == 1
{txt}(16,501,183 missing values generated)

{com}. bys personabasicaid: ereplace posgrado_start = min(posgrado_start)
{txt}(14,399,440 missing values generated)
(14399440 missing values generated)
(2,490,425 real changes made)

{com}. 
. * Postgraduate RETHUS
. /*
> gen     month_posgrado                  = mofd(rethus_fechagradopos1)
> bys     personabasicaid:                ereplace month_posgrado = min(month_posgrado)
> gen     posgrado_rethus                 = 0
> replace posgrado_rethus             = 1  if (month_posgrado == fecha_pila)
> 
> replace rethus_perfilpos1                   = "" if (month_posgrado > fecha_pila)
> replace rethus_codigoperfilpos1 = "" if (month_posgrado > fecha_pila)
> 
> gen auxiliar        = substr(rethus_perfilpos1, 1, 1)
> gen posgrado_clin = 1 if auxiliar == "M" & rethus_codigoperfilpos1 != "MA99"
> gen posgrado_quir = 1 if auxiliar == "Q"
> gen posgrado_otro = 1 if posgrado_clin != 1 & posgrado_quir != 1 & !mi(rethus_perfilpos1)
> drop auxiliar
> */
. * PILA variables
. rename  pila_salario_max_r pila_salario_r_max
{res}{txt}
{com}. 
. replace pila_salario_r     = 0 if mi(pila_salario_r)
{txt}(8,311,504 real changes made)

{com}. replace pila_salario_r_max = 0 if mi(pila_salario_r_max)        
{txt}(8,675,045 real changes made)

{com}. replace sal_dias_cot       = 0 if mi(sal_dias_cot)
{txt}(8,311,504 real changes made)

{com}. replace nro_cotizaciones   = 0 if mi(nro_cotizaciones)  
{txt}(8,311,504 real changes made)

{com}. 
. * Annualize
. rename fecha_pila fecha_pila_temp
{res}{txt}
{com}. gen fecha_pila = yofd(dofm(fecha_pila_temp))
{txt}
{com}. drop fecha_pila_temp
{txt}
{com}. 
. /*rename fechapregrado fechapregrado_temp
> gen fechapregrado = yofd(fechapregrado_temp)
> drop fechapregrado_temp
> 
> rename month_posgrado month_posgrado_temp
> gen month_posgrado = yofd(dofm(month_posgrado_temp))
> drop month_posgrado_temp*/
. 
. rename posgrado_start posgrado_start_temp
{res}{txt}
{com}. gen posgrado_start = yofd(dofm(posgrado_start_temp))
{txt}(14,399,440 missing values generated)

{com}. drop posgrado_start_temp
{txt}
{com}. 
. format fecha_pila     %ty
{txt}
{com}. /*format fechapregrado  %ty
> format month_posgrado %ty*/
. format posgrado_start %ty
{txt}
{com}. 
. /*collapse      (median) sal_dias_cot pila_salario_r pila_salario_r_max                                                 ///                             
>                         (max) nro_cotizaciones formal incap_dias incap_gral licen_mat                                   ///
>                         posgrado_salud posgrado_start posgrado_rethus posgrado_clin                                             ///
>                         posgrado_quir posgrado_otro pila_independientes pila_dependientes,                              ///
>                         by(personabasicaid fecha_pila fechapregrado year_grado rethus_sexo)*/
.                         
. collapse        (median) sal_dias_cot pila_salario_r pila_salario_r_max                                                 ///                             
>                         (max) nro_cotizaciones formal incap_dias incap_gral licen_mat                                   ///
>                         posgrado_salud posgrado_start                                           ///
>                         pila_independientes pila_dependientes,                          ///
>                         by(personabasicaid fecha_pila)
{res}{txt}
{com}. 
. * Last variables
. gen     l_pila_salario_r                = log(pila_salario_r)
{txt}(696,456 missing values generated)

{com}. gen             p_cotizaciones                  = (nro_cotizaciones > 1)
{txt}
{com}. 
. save "${c -(}data{c )-}\Individual_balanced_all_PILA.dta", replace
{txt}{p 0 4 2}
file {bf}
//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Data\Individual_balanced_all_PILA.dta{rm}
saved
{p_end}

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates\Logs\Step_4.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}29 Jun 2024, 10:56:00
{txt}{.-}
{smcl}
{txt}{sf}{ul off}