{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}//wmedesrv/gamma/Christian Posso/_banrep_research/proyectos/PhysiciansPosgraduates/Logs\step3_event_study.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Nov 2024, 14:32:24
{txt}
{com}. 
. 
. * Controls
. global controls year_grado
{txt}
{com}. global cohorts 1995 //2000 2005 2010 
{txt}
{com}. global treatment_groups treated_1a treated_1b treated_1c treated_1d ///
>                         treated_2a treated_2b treated_2c treated_2d
{txt}
{com}. * Outcomes
. global outcomes service_mental service_mental2 service_mental3 cardio_risk laboral                                              ///
>                                 pila_independientes p_cotizaciones pila_salario_r sal_dias_cot
{txt}
{com}.                                 
. /*
> global outcomes service_mental service_mental2 service_mental3 diag_laboral estres_laboral                              ///
>                                 accidente_laboral enfermedad_laboral acc_enf_laboral laboral                                                    ///
>                                 pregnancy stroke infarct cardiovascular cardio_risk digestive                                                   ///
>                                 pila_independientes p_cotizaciones pila_salario_r pila_salario_r_max sal_dias_cot
> */
.         
.                                         
. ****************************************************************************
. **#                                             1. Merge data and set-up
. ****************************************************************************
. 
. * RIPS
. use "${c -(}data{c )-}\Individual_balanced_all_RIPS", clear
{txt}
{com}. rename year_RIPS fecha_pila
{res}{txt}
{com}. 
. * PILA
. merge 1:1 personabasicaid fecha_pila using "${c -(}data{c )-}\Individual_balanced_all_PILA"
{res}{txt}{p 0 7 2}
(variable
{bf:personabasicaid} was {bf:long}, now {bf:double} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:fecha_pila} was {bf:int}, now {bf:float} to accommodate using data's values)
{p_end}

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          96,046
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}          96,046{txt}  (_merge==2)

{col 5}Matched{col 30}{res}       1,344,644{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop if _merge == 2 // Estos son los del 2008
{txt}(96,046 observations deleted)

{com}. keep if inrange(posgrado_start, 2011, 2017) | mi(posgrado_start)
{txt}(58,534 observations deleted)

{com}. 
. * ReTHUS
. merge m:1 personabasicaid using "${c -(}data{c )-}\master_rethus.dta", keep(3) nogen 
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}       1,286,110{txt}  
{col 5}{hline 41}

{com}. drop if mi(fechapregrado)
{txt}(0 observations deleted)

{com}. gen year_grado = yofd(fechapregrado)
{txt}
{com}. 
. rename rethus_sexo rethus_sexo_temp
{res}{txt}
{com}. gen rethus_sexo = 0 
{txt}
{com}. replace rethus_sexo = 1 if rethus_sexo_temp == "MASCULINO"
{txt}(546,868 real changes made)

{com}. replace rethus_sexo = 2 if rethus_sexo_temp == "FEMENINO"
{txt}(739,046 real changes made)

{com}. drop rethus_sexo_temp
{txt}
{com}. drop if rethus_sexo == 0
{txt}(196 observations deleted)

{com}. 
. * Final outcomes
. gen service_mental3 = (service_mental == 1 & service_mental2 == 0)
{txt}
{com}. gen cardio_risk     = (stroke == 1 | infarct == 1 | cardiovascular == 1)
{txt}
{com}. gen laboral         = (diag_laboral == 1 | estres_laboral == 1 | ///
>                        accidente_laboral == 1 | enfermedad_laboral == 1 | ///
>                                            acc_enf_laboral == 1)
{txt}
{com}. 
. 
. ****************************************************************************
. **#                                             2. Estimation features
. ****************************************************************************
. 
. gen dist = fecha_pila - posgrado_start
{txt}(1,145,214 missing values generated)

{com}. *keep if (dist >= -2 & dist <= 5)
. 
. * Eventually treated dummy
. gen eventually_treated = (posgrado_start != .)
{txt}
{com}. 
. * Never treated condition
. replace posgrado_start = 0      if      posgrado_start == .
{txt}(1,145,214 real changes made)

{com}. 
. ****************************************************************************
. **#                                             3. CS never treated only
. ****************************************************************************                    
. local replace replace
{txt}
{com}. 
. preserve
{txt}
{com}. 
. timer on 1
{txt}
{com}. foreach treated in $treatment_groups {c -(}    
{txt}  2{com}.         
.         keep if `treated' + control > 0
{txt}  3{com}.         
.         foreach cohort in $cohorts {c -(}
{txt}  4{com}.                 
.                 keep if year_grado >= `cohort'
{txt}  5{com}.                 
.                 foreach outcome in $outcomes {c -(}
{txt}  6{com}.                                                 
.                         dis as err "Running event study for `outcome'"
{txt}  7{com}.                         
.                         * Without controls
.                         qui sum `outcome' if mi(dist)
{txt}  8{com}.                         local mean = r(mean)
{txt}  9{com}.                         
.                         qui sum `outcome' if fecha_pila == 2015
{txt} 10{com}.                         local obs  = r(N) 
{txt} 11{com}.                         
.                         csdid2          `outcome',                                      ///
>                                                 i(personabasicaid)                      /// panel id variable
>                                                 t(fecha_pila)                           /// Time variable
>                                                 gvar(posgrado_start)            /// Treatment time
>                                                 long2                                           /// Calculate results relative to -1
>                                                 asinr                                           /// Calculate pre-treatment results as in R
>                                                 method(drimp)                           /// Use doubly robust improved method
>                                                 cluster(personabasicaid)                                
{txt} 12{com}.                         estat event, post                                               // Aggregate estimation like an event-study
{txt} 13{com}.                         
.                         regsave using "${c -(}output{c )-}\Tables\CS_results", `replace' ci level(95) ///
>                                         addlabel(treatment_group, `treated', outcome, `outcome', mean, `mean', n, `obs', wboot, 0, estimation, NT, cohort, `cohort', controls, 0)
{txt} 14{com}.                         
.                         local replace append
{txt} 15{com}.                         
.                         estat event, wboot post                                 // SE using WildBootstrap
{txt} 16{com}.                         regsave using "${c -(}output{c )-}\Tables\CS_results", append ci rtable ///
>                                         addlabel(treatment_group, `treated', outcome, `outcome', mean, `mean', n, `obs', wboot, 1, estimation, NT, cohort, `cohort', controls, 0)
{txt} 17{com}.                                         
.                         * With controls
.                         qui sum `outcome' if mi(dist)
{txt} 18{com}.                         local mean = r(mean)
{txt} 19{com}.                         
.                         qui sum `outcome' if fecha_pila == 2015
{txt} 20{com}.                         local obs  = r(N) 
{txt} 21{com}.                         
.                         csdid2          `outcome' $controls ,           ///
>                                                 i(personabasicaid)                      /// panel id variable
>                                                 t(fecha_pila)                           /// Time variable
>                                                 gvar(posgrado_start)            /// Treatment time
>                                                 long2                                           /// Calculate results relative to -1
>                                                 asinr                                           /// Calculate pre-treatment results as in R
>                                                 method(drimp)                           /// Use doubly robust improved method
>                                                 cluster(personabasicaid)                                
{txt} 22{com}.                         estat event, post                                               // Aggregate estimation like an event-study
{txt} 23{com}.                         
.                         regsave using "${c -(}output{c )-}\Tables\CS_results", append ci level(95) ///
>                                         addlabel(treatment_group, `treated', outcome, `outcome', mean, `mean', n, `obs', wboot, 0, estimation, NT, cohort, `cohort', controls, 1)
{txt} 24{com}.                         
.                         estat event, wboot post                                 // SE using WildBootstrap
{txt} 25{com}.                         regsave using "${c -(}output{c )-}\Tables\CS_results", append ci rtable ///
>                                         addlabel(treatment_group, `treated', outcome, `outcome', mean, `mean', n, `obs', wboot, 1, estimation, NT, cohort, `cohort', controls, 1)
{txt} 26{com}.                 
.                 {c )-}
{txt} 27{com}.                 
.         {c )-}
{txt} 28{com}. 
.         cap restore
{txt} 29{com}. {c )-}
{txt}(0 observations deleted)
(0 observations deleted)
{err}Running event study for service_mental
{res}{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

end of do-file

{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

{com}. exit, clear
